<?php
$data = array (
  '01' => 
  array (
    'province' => 
    array (
      'id' => '01',
      'name' => '北京',
    ),
    'list' => 
    array (
      '0101' => 
      array (
        'id' => '0101',
        'name' => '北京',
      ),
    ),
  ),
  '02' => 
  array (
    'province' => 
    array (
      'id' => '02',
      'name' => '上海',
    ),
    'list' => 
    array (
      '0201' => 
      array (
        'id' => '0201',
        'name' => '上海',
      ),
    ),
  ),
  '03' => 
  array (
    'province' => 
    array (
      'id' => '03',
      'name' => '天津',
    ),
    'list' => 
    array (
      '0301' => 
      array (
        'id' => '0301',
        'name' => '天津',
      ),
    ),
  ),
  '04' => 
  array (
    'province' => 
    array (
      'id' => '04',
      'name' => '重庆',
    ),
    'list' => 
    array (
      '0401' => 
      array (
        'id' => '0401',
        'name' => '重庆',
      ),
    ),
  ),
  '05' => 
  array (
    'province' => 
    array (
      'id' => '05',
      'name' => '黑龙江',
    ),
    'list' => 
    array (
      '0501' => 
      array (
        'id' => '0501',
        'name' => '哈尔滨',
      ),
      '0502' => 
      array (
        'id' => '0502',
        'name' => '齐齐哈尔',
      ),
      '0503' => 
      array (
        'id' => '0503',
        'name' => '牡丹江',
      ),
      '0504' => 
      array (
        'id' => '0504',
        'name' => '佳木斯',
      ),
      '0505' => 
      array (
        'id' => '0505',
        'name' => '绥化',
      ),
      '0506' => 
      array (
        'id' => '0506',
        'name' => '黑河',
      ),
      '0507' => 
      array (
        'id' => '0507',
        'name' => '大兴安岭',
      ),
      '0508' => 
      array (
        'id' => '0508',
        'name' => '伊春',
      ),
      '0509' => 
      array (
        'id' => '0509',
        'name' => '大庆',
      ),
      '0510' => 
      array (
        'id' => '0510',
        'name' => '七台河',
      ),
      '0511' => 
      array (
        'id' => '0511',
        'name' => '鸡西',
      ),
      '0512' => 
      array (
        'id' => '0512',
        'name' => '鹤岗',
      ),
      '0513' => 
      array (
        'id' => '0513',
        'name' => '双鸭山',
      ),
    ),
  ),
  '06' => 
  array (
    'province' => 
    array (
      'id' => '06',
      'name' => '吉林',
    ),
    'list' => 
    array (
      '0601' => 
      array (
        'id' => '0601',
        'name' => '长春',
      ),
      '0602' => 
      array (
        'id' => '0602',
        'name' => '吉林',
      ),
      '0603' => 
      array (
        'id' => '0603',
        'name' => '延边',
      ),
      '0604' => 
      array (
        'id' => '0604',
        'name' => '四平',
      ),
      '0605' => 
      array (
        'id' => '0605',
        'name' => '通化',
      ),
      '0606' => 
      array (
        'id' => '0606',
        'name' => '白城',
      ),
      '0607' => 
      array (
        'id' => '0607',
        'name' => '辽源',
      ),
      '0608' => 
      array (
        'id' => '0608',
        'name' => '松原',
      ),
      '0609' => 
      array (
        'id' => '0609',
        'name' => '白山',
      ),
    ),
  ),
  '07' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'list' => 
    array (
      '0701' => 
      array (
        'id' => '0701',
        'name' => '沈阳',
      ),
      '0702' => 
      array (
        'id' => '0702',
        'name' => '大连',
      ),
      '0703' => 
      array (
        'id' => '0703',
        'name' => '鞍山',
      ),
      '0704' => 
      array (
        'id' => '0704',
        'name' => '抚顺',
      ),
      '0705' => 
      array (
        'id' => '0705',
        'name' => '本溪',
      ),
      '0706' => 
      array (
        'id' => '0706',
        'name' => '丹东',
      ),
      '0707' => 
      array (
        'id' => '0707',
        'name' => '锦州',
      ),
      '0708' => 
      array (
        'id' => '0708',
        'name' => '营口',
      ),
      '0709' => 
      array (
        'id' => '0709',
        'name' => '阜新',
      ),
      '0710' => 
      array (
        'id' => '0710',
        'name' => '辽阳',
      ),
      '0711' => 
      array (
        'id' => '0711',
        'name' => '铁岭',
      ),
      '0712' => 
      array (
        'id' => '0712',
        'name' => '朝阳',
      ),
      '0713' => 
      array (
        'id' => '0713',
        'name' => '盘锦',
      ),
      '0714' => 
      array (
        'id' => '0714',
        'name' => '葫芦岛',
      ),
    ),
  ),
  '08' => 
  array (
    'province' => 
    array (
      'id' => '08',
      'name' => '内蒙古',
    ),
    'list' => 
    array (
      '0801' => 
      array (
        'id' => '0801',
        'name' => '呼和浩特',
      ),
      '0802' => 
      array (
        'id' => '0802',
        'name' => '包头',
      ),
      '0803' => 
      array (
        'id' => '0803',
        'name' => '乌海',
      ),
      '0804' => 
      array (
        'id' => '0804',
        'name' => '乌兰察布',
      ),
      '0805' => 
      array (
        'id' => '0805',
        'name' => '通辽',
      ),
      '0806' => 
      array (
        'id' => '0806',
        'name' => '赤峰',
      ),
      '0807' => 
      array (
        'id' => '0807',
        'name' => '鄂尔多斯',
      ),
      '0808' => 
      array (
        'id' => '0808',
        'name' => '巴彦淖尔',
      ),
      '0809' => 
      array (
        'id' => '0809',
        'name' => '锡林郭勒',
      ),
      '0810' => 
      array (
        'id' => '0810',
        'name' => '呼伦贝尔',
      ),
      '0811' => 
      array (
        'id' => '0811',
        'name' => '兴安盟',
      ),
      '0812' => 
      array (
        'id' => '0812',
        'name' => '阿拉善盟',
      ),
    ),
  ),
  '09' => 
  array (
    'province' => 
    array (
      'id' => '09',
      'name' => '河北',
    ),
    'list' => 
    array (
      '0901' => 
      array (
        'id' => '0901',
        'name' => '石家庄',
      ),
      '0902' => 
      array (
        'id' => '0902',
        'name' => '保定',
      ),
      '0903' => 
      array (
        'id' => '0903',
        'name' => '张家口',
      ),
      '0904' => 
      array (
        'id' => '0904',
        'name' => '承德',
      ),
      '0905' => 
      array (
        'id' => '0905',
        'name' => '唐山',
      ),
      '0906' => 
      array (
        'id' => '0906',
        'name' => '廊坊',
      ),
      '0907' => 
      array (
        'id' => '0907',
        'name' => '沧州',
      ),
      '0908' => 
      array (
        'id' => '0908',
        'name' => '衡水',
      ),
      '0909' => 
      array (
        'id' => '0909',
        'name' => '邢台',
      ),
      '0910' => 
      array (
        'id' => '0910',
        'name' => '邯郸',
      ),
      '0911' => 
      array (
        'id' => '0911',
        'name' => '秦皇岛',
      ),
    ),
  ),
  10 => 
  array (
    'province' => 
    array (
      'id' => '10',
      'name' => '山西',
    ),
    'list' => 
    array (
      1001 => 
      array (
        'id' => '1001',
        'name' => '太原',
      ),
      1002 => 
      array (
        'id' => '1002',
        'name' => '大同',
      ),
      1003 => 
      array (
        'id' => '1003',
        'name' => '阳泉',
      ),
      1004 => 
      array (
        'id' => '1004',
        'name' => '晋中',
      ),
      1005 => 
      array (
        'id' => '1005',
        'name' => '长治',
      ),
      1006 => 
      array (
        'id' => '1006',
        'name' => '晋城',
      ),
      1007 => 
      array (
        'id' => '1007',
        'name' => '临汾',
      ),
      1008 => 
      array (
        'id' => '1008',
        'name' => '运城',
      ),
      1009 => 
      array (
        'id' => '1009',
        'name' => '朔州',
      ),
      1010 => 
      array (
        'id' => '1010',
        'name' => '忻州',
      ),
      1011 => 
      array (
        'id' => '1011',
        'name' => '吕梁',
      ),
    ),
  ),
  11 => 
  array (
    'province' => 
    array (
      'id' => '11',
      'name' => '陕西',
    ),
    'list' => 
    array (
      1101 => 
      array (
        'id' => '1101',
        'name' => '西安',
      ),
      1102 => 
      array (
        'id' => '1102',
        'name' => '咸阳',
      ),
      1103 => 
      array (
        'id' => '1103',
        'name' => '延安',
      ),
      1104 => 
      array (
        'id' => '1104',
        'name' => '榆林',
      ),
      1105 => 
      array (
        'id' => '1105',
        'name' => '渭南',
      ),
      1106 => 
      array (
        'id' => '1106',
        'name' => '商洛',
      ),
      1107 => 
      array (
        'id' => '1107',
        'name' => '安康',
      ),
      1108 => 
      array (
        'id' => '1108',
        'name' => '汉中',
      ),
      1109 => 
      array (
        'id' => '1109',
        'name' => '宝鸡',
      ),
      1110 => 
      array (
        'id' => '1110',
        'name' => '铜川',
      ),
      1111 => 
      array (
        'id' => '1111',
        'name' => '杨凌',
      ),
    ),
  ),
  12 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'list' => 
    array (
      1201 => 
      array (
        'id' => '1201',
        'name' => '济南',
      ),
      1202 => 
      array (
        'id' => '1202',
        'name' => '青岛',
      ),
      1203 => 
      array (
        'id' => '1203',
        'name' => '淄博',
      ),
      1204 => 
      array (
        'id' => '1204',
        'name' => '德州',
      ),
      1205 => 
      array (
        'id' => '1205',
        'name' => '烟台',
      ),
      1206 => 
      array (
        'id' => '1206',
        'name' => '潍坊',
      ),
      1207 => 
      array (
        'id' => '1207',
        'name' => '济宁',
      ),
      1208 => 
      array (
        'id' => '1208',
        'name' => '泰安',
      ),
      1209 => 
      array (
        'id' => '1209',
        'name' => '临沂',
      ),
      1210 => 
      array (
        'id' => '1210',
        'name' => '菏泽',
      ),
      1211 => 
      array (
        'id' => '1211',
        'name' => '滨州',
      ),
      1212 => 
      array (
        'id' => '1212',
        'name' => '东营',
      ),
      1213 => 
      array (
        'id' => '1213',
        'name' => '威海',
      ),
      1214 => 
      array (
        'id' => '1214',
        'name' => '枣庄',
      ),
      1215 => 
      array (
        'id' => '1215',
        'name' => '日照',
      ),
      1216 => 
      array (
        'id' => '1216',
        'name' => '莱芜',
      ),
      1217 => 
      array (
        'id' => '1217',
        'name' => '聊城',
      ),
    ),
  ),
  13 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'list' => 
    array (
      1301 => 
      array (
        'id' => '1301',
        'name' => '乌鲁木齐',
      ),
      1302 => 
      array (
        'id' => '1302',
        'name' => '克拉玛依',
      ),
      1303 => 
      array (
        'id' => '1303',
        'name' => '石河子',
      ),
      1304 => 
      array (
        'id' => '1304',
        'name' => '昌吉',
      ),
      1305 => 
      array (
        'id' => '1305',
        'name' => '吐鲁番',
      ),
      1306 => 
      array (
        'id' => '1306',
        'name' => '巴音郭楞',
      ),
      1307 => 
      array (
        'id' => '1307',
        'name' => '阿拉尔',
      ),
      1308 => 
      array (
        'id' => '1308',
        'name' => '阿克苏',
      ),
      1309 => 
      array (
        'id' => '1309',
        'name' => '喀什',
      ),
      1310 => 
      array (
        'id' => '1310',
        'name' => '伊犁',
      ),
      1311 => 
      array (
        'id' => '1311',
        'name' => '塔城',
      ),
      1312 => 
      array (
        'id' => '1312',
        'name' => '哈密',
      ),
      1313 => 
      array (
        'id' => '1313',
        'name' => '和田',
      ),
      1314 => 
      array (
        'id' => '1314',
        'name' => '阿勒泰',
      ),
      1315 => 
      array (
        'id' => '1315',
        'name' => '克州',
      ),
      1316 => 
      array (
        'id' => '1316',
        'name' => '博尔塔拉',
      ),
    ),
  ),
  14 => 
  array (
    'province' => 
    array (
      'id' => '14',
      'name' => '西藏',
    ),
    'list' => 
    array (
      1401 => 
      array (
        'id' => '1401',
        'name' => '拉萨',
      ),
      1402 => 
      array (
        'id' => '1402',
        'name' => '日喀则',
      ),
      1403 => 
      array (
        'id' => '1403',
        'name' => '山南',
      ),
      1404 => 
      array (
        'id' => '1404',
        'name' => '林芝',
      ),
      1405 => 
      array (
        'id' => '1405',
        'name' => '昌都',
      ),
      1406 => 
      array (
        'id' => '1406',
        'name' => '那曲',
      ),
      1407 => 
      array (
        'id' => '1407',
        'name' => '阿里',
      ),
    ),
  ),
  15 => 
  array (
    'province' => 
    array (
      'id' => '15',
      'name' => '青海',
    ),
    'list' => 
    array (
      1501 => 
      array (
        'id' => '1501',
        'name' => '西宁',
      ),
      1502 => 
      array (
        'id' => '1502',
        'name' => '海东',
      ),
      1503 => 
      array (
        'id' => '1503',
        'name' => '黄南',
      ),
      1504 => 
      array (
        'id' => '1504',
        'name' => '海南',
      ),
      1505 => 
      array (
        'id' => '1505',
        'name' => '果洛',
      ),
      1506 => 
      array (
        'id' => '1506',
        'name' => '玉树',
      ),
      1507 => 
      array (
        'id' => '1507',
        'name' => '海西',
      ),
      1508 => 
      array (
        'id' => '1508',
        'name' => '海北',
      ),
      1509 => 
      array (
        'id' => '1509',
        'name' => '格尔木',
      ),
    ),
  ),
  16 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'list' => 
    array (
      1601 => 
      array (
        'id' => '1601',
        'name' => '兰州',
      ),
      1602 => 
      array (
        'id' => '1602',
        'name' => '定西',
      ),
      1603 => 
      array (
        'id' => '1603',
        'name' => '平凉',
      ),
      1604 => 
      array (
        'id' => '1604',
        'name' => '庆阳',
      ),
      1605 => 
      array (
        'id' => '1605',
        'name' => '武威',
      ),
      1606 => 
      array (
        'id' => '1606',
        'name' => '金昌',
      ),
      1607 => 
      array (
        'id' => '1607',
        'name' => '张掖',
      ),
      1608 => 
      array (
        'id' => '1608',
        'name' => '酒泉',
      ),
      1609 => 
      array (
        'id' => '1609',
        'name' => '天水',
      ),
      1610 => 
      array (
        'id' => '1610',
        'name' => '陇南',
      ),
      1611 => 
      array (
        'id' => '1611',
        'name' => '临夏',
      ),
      1612 => 
      array (
        'id' => '1612',
        'name' => '甘南',
      ),
      1613 => 
      array (
        'id' => '1613',
        'name' => '白银',
      ),
      1614 => 
      array (
        'id' => '1614',
        'name' => '嘉峪关',
      ),
    ),
  ),
  17 => 
  array (
    'province' => 
    array (
      'id' => '17',
      'name' => '宁夏',
    ),
    'list' => 
    array (
      1701 => 
      array (
        'id' => '1701',
        'name' => '银川',
      ),
      1702 => 
      array (
        'id' => '1702',
        'name' => '石嘴山',
      ),
      1703 => 
      array (
        'id' => '1703',
        'name' => '吴忠',
      ),
      1704 => 
      array (
        'id' => '1704',
        'name' => '固原',
      ),
      1705 => 
      array (
        'id' => '1705',
        'name' => '中卫',
      ),
    ),
  ),
  18 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'list' => 
    array (
      1801 => 
      array (
        'id' => '1801',
        'name' => '郑州',
      ),
      1802 => 
      array (
        'id' => '1802',
        'name' => '安阳',
      ),
      1803 => 
      array (
        'id' => '1803',
        'name' => '新乡',
      ),
      1804 => 
      array (
        'id' => '1804',
        'name' => '许昌',
      ),
      1805 => 
      array (
        'id' => '1805',
        'name' => '平顶山',
      ),
      1806 => 
      array (
        'id' => '1806',
        'name' => '信阳',
      ),
      1807 => 
      array (
        'id' => '1807',
        'name' => '南阳',
      ),
      1808 => 
      array (
        'id' => '1808',
        'name' => '开封',
      ),
      1809 => 
      array (
        'id' => '1809',
        'name' => '洛阳',
      ),
      1810 => 
      array (
        'id' => '1810',
        'name' => '商丘',
      ),
      1811 => 
      array (
        'id' => '1811',
        'name' => '焦作',
      ),
      1812 => 
      array (
        'id' => '1812',
        'name' => '鹤壁',
      ),
      1813 => 
      array (
        'id' => '1813',
        'name' => '濮阳',
      ),
      1814 => 
      array (
        'id' => '1814',
        'name' => '周口',
      ),
      1815 => 
      array (
        'id' => '1815',
        'name' => '漯河',
      ),
      1816 => 
      array (
        'id' => '1816',
        'name' => '驻马店',
      ),
      1817 => 
      array (
        'id' => '1817',
        'name' => '三门峡',
      ),
      1818 => 
      array (
        'id' => '1818',
        'name' => '济源',
      ),
    ),
  ),
  19 => 
  array (
    'province' => 
    array (
      'id' => '19',
      'name' => '江苏',
    ),
    'list' => 
    array (
      1901 => 
      array (
        'id' => '1901',
        'name' => '南京',
      ),
      1902 => 
      array (
        'id' => '1902',
        'name' => '无锡',
      ),
      1903 => 
      array (
        'id' => '1903',
        'name' => '镇江',
      ),
      1904 => 
      array (
        'id' => '1904',
        'name' => '苏州',
      ),
      1905 => 
      array (
        'id' => '1905',
        'name' => '南通',
      ),
      1906 => 
      array (
        'id' => '1906',
        'name' => '扬州',
      ),
      1907 => 
      array (
        'id' => '1907',
        'name' => '盐城',
      ),
      1908 => 
      array (
        'id' => '1908',
        'name' => '徐州',
      ),
      1909 => 
      array (
        'id' => '1909',
        'name' => '淮安',
      ),
      1910 => 
      array (
        'id' => '1910',
        'name' => '连云港',
      ),
      1911 => 
      array (
        'id' => '1911',
        'name' => '常州',
      ),
      1912 => 
      array (
        'id' => '1912',
        'name' => '泰州',
      ),
      1913 => 
      array (
        'id' => '1913',
        'name' => '宿迁',
      ),
    ),
  ),
  20 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'list' => 
    array (
      2001 => 
      array (
        'id' => '2001',
        'name' => '武汉',
      ),
      2002 => 
      array (
        'id' => '2002',
        'name' => '襄阳',
      ),
      2003 => 
      array (
        'id' => '2003',
        'name' => '鄂州',
      ),
      2004 => 
      array (
        'id' => '2004',
        'name' => '孝感',
      ),
      2005 => 
      array (
        'id' => '2005',
        'name' => '黄冈',
      ),
      2006 => 
      array (
        'id' => '2006',
        'name' => '黄石',
      ),
      2007 => 
      array (
        'id' => '2007',
        'name' => '咸宁',
      ),
      2008 => 
      array (
        'id' => '2008',
        'name' => '荆州',
      ),
      2009 => 
      array (
        'id' => '2009',
        'name' => '宜昌',
      ),
      2010 => 
      array (
        'id' => '2010',
        'name' => '恩施',
      ),
      2011 => 
      array (
        'id' => '2011',
        'name' => '十堰',
      ),
      2012 => 
      array (
        'id' => '2012',
        'name' => '神农架',
      ),
      2013 => 
      array (
        'id' => '2013',
        'name' => '随州',
      ),
      2014 => 
      array (
        'id' => '2014',
        'name' => '荆门',
      ),
      2015 => 
      array (
        'id' => '2015',
        'name' => '天门',
      ),
      2016 => 
      array (
        'id' => '2016',
        'name' => '仙桃',
      ),
      2017 => 
      array (
        'id' => '2017',
        'name' => '潜江',
      ),
    ),
  ),
  21 => 
  array (
    'province' => 
    array (
      'id' => '21',
      'name' => '浙江',
    ),
    'list' => 
    array (
      2101 => 
      array (
        'id' => '2101',
        'name' => '杭州',
      ),
      2102 => 
      array (
        'id' => '2102',
        'name' => '湖州',
      ),
      2103 => 
      array (
        'id' => '2103',
        'name' => '嘉兴',
      ),
      2104 => 
      array (
        'id' => '2104',
        'name' => '宁波',
      ),
      2105 => 
      array (
        'id' => '2105',
        'name' => '绍兴',
      ),
      2106 => 
      array (
        'id' => '2106',
        'name' => '台州',
      ),
      2107 => 
      array (
        'id' => '2107',
        'name' => '温州',
      ),
      2108 => 
      array (
        'id' => '2108',
        'name' => '丽水',
      ),
      2109 => 
      array (
        'id' => '2109',
        'name' => '金华',
      ),
      2110 => 
      array (
        'id' => '2110',
        'name' => '衢州',
      ),
      2111 => 
      array (
        'id' => '2111',
        'name' => '舟山',
      ),
    ),
  ),
  22 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'list' => 
    array (
      2201 => 
      array (
        'id' => '2201',
        'name' => '合肥',
      ),
      2202 => 
      array (
        'id' => '2202',
        'name' => '蚌埠',
      ),
      2203 => 
      array (
        'id' => '2203',
        'name' => '芜湖',
      ),
      2204 => 
      array (
        'id' => '2204',
        'name' => '淮南',
      ),
      2205 => 
      array (
        'id' => '2205',
        'name' => '马鞍山',
      ),
      2206 => 
      array (
        'id' => '2206',
        'name' => '安庆',
      ),
      2207 => 
      array (
        'id' => '2207',
        'name' => '宿州',
      ),
      2208 => 
      array (
        'id' => '2208',
        'name' => '阜阳',
      ),
      2209 => 
      array (
        'id' => '2209',
        'name' => '亳州',
      ),
      2210 => 
      array (
        'id' => '2210',
        'name' => '黄山',
      ),
      2211 => 
      array (
        'id' => '2211',
        'name' => '滁州',
      ),
      2212 => 
      array (
        'id' => '2212',
        'name' => '淮北',
      ),
      2213 => 
      array (
        'id' => '2213',
        'name' => '铜陵',
      ),
      2214 => 
      array (
        'id' => '2214',
        'name' => '宣城',
      ),
      2215 => 
      array (
        'id' => '2215',
        'name' => '六安',
      ),
      2216 => 
      array (
        'id' => '2216',
        'name' => '巢湖',
      ),
      2217 => 
      array (
        'id' => '2217',
        'name' => '池州',
      ),
    ),
  ),
  23 => 
  array (
    'province' => 
    array (
      'id' => '23',
      'name' => '福建',
    ),
    'list' => 
    array (
      2301 => 
      array (
        'id' => '2301',
        'name' => '福州',
      ),
      2302 => 
      array (
        'id' => '2302',
        'name' => '厦门',
      ),
      2303 => 
      array (
        'id' => '2303',
        'name' => '宁德',
      ),
      2304 => 
      array (
        'id' => '2304',
        'name' => '莆田',
      ),
      2305 => 
      array (
        'id' => '2305',
        'name' => '泉州',
      ),
      2306 => 
      array (
        'id' => '2306',
        'name' => '漳州',
      ),
      2307 => 
      array (
        'id' => '2307',
        'name' => '龙岩',
      ),
      2308 => 
      array (
        'id' => '2308',
        'name' => '三明',
      ),
      2309 => 
      array (
        'id' => '2309',
        'name' => '南平',
      ),
    ),
  ),
  24 => 
  array (
    'province' => 
    array (
      'id' => '24',
      'name' => '江西',
    ),
    'list' => 
    array (
      2401 => 
      array (
        'id' => '2401',
        'name' => '南昌',
      ),
      2402 => 
      array (
        'id' => '2402',
        'name' => '九江',
      ),
      2403 => 
      array (
        'id' => '2403',
        'name' => '上饶',
      ),
      2404 => 
      array (
        'id' => '2404',
        'name' => '抚州',
      ),
      2405 => 
      array (
        'id' => '2405',
        'name' => '宜春',
      ),
      2406 => 
      array (
        'id' => '2406',
        'name' => '吉安',
      ),
      2407 => 
      array (
        'id' => '2407',
        'name' => '赣州',
      ),
      2408 => 
      array (
        'id' => '2408',
        'name' => '景德镇',
      ),
      2409 => 
      array (
        'id' => '2409',
        'name' => '萍乡',
      ),
      2410 => 
      array (
        'id' => '2410',
        'name' => '新余',
      ),
      2411 => 
      array (
        'id' => '2411',
        'name' => '鹰潭',
      ),
    ),
  ),
  25 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'list' => 
    array (
      2501 => 
      array (
        'id' => '2501',
        'name' => '长沙',
      ),
      2502 => 
      array (
        'id' => '2502',
        'name' => '湘潭',
      ),
      2503 => 
      array (
        'id' => '2503',
        'name' => '株洲',
      ),
      2504 => 
      array (
        'id' => '2504',
        'name' => '衡阳',
      ),
      2505 => 
      array (
        'id' => '2505',
        'name' => '郴州',
      ),
      2506 => 
      array (
        'id' => '2506',
        'name' => '常德',
      ),
      2507 => 
      array (
        'id' => '2507',
        'name' => '益阳',
      ),
      2508 => 
      array (
        'id' => '2508',
        'name' => '娄底',
      ),
      2509 => 
      array (
        'id' => '2509',
        'name' => '邵阳',
      ),
      2510 => 
      array (
        'id' => '2510',
        'name' => '岳阳',
      ),
      2511 => 
      array (
        'id' => '2511',
        'name' => '张家界',
      ),
      2512 => 
      array (
        'id' => '2512',
        'name' => '怀化',
      ),
      2513 => 
      array (
        'id' => '2513',
        'name' => '永州',
      ),
      2514 => 
      array (
        'id' => '2514',
        'name' => '湘西',
      ),
    ),
  ),
  26 => 
  array (
    'province' => 
    array (
      'id' => '26',
      'name' => '贵州',
    ),
    'list' => 
    array (
      2601 => 
      array (
        'id' => '2601',
        'name' => '贵阳',
      ),
      2602 => 
      array (
        'id' => '2602',
        'name' => '遵义',
      ),
      2603 => 
      array (
        'id' => '2603',
        'name' => '安顺',
      ),
      2604 => 
      array (
        'id' => '2604',
        'name' => '黔南',
      ),
      2605 => 
      array (
        'id' => '2605',
        'name' => '黔东南',
      ),
      2606 => 
      array (
        'id' => '2606',
        'name' => '铜仁',
      ),
      2607 => 
      array (
        'id' => '2607',
        'name' => '毕节',
      ),
      2608 => 
      array (
        'id' => '2608',
        'name' => '六盘水',
      ),
      2609 => 
      array (
        'id' => '2609',
        'name' => '黔西南',
      ),
    ),
  ),
  27 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'list' => 
    array (
      2701 => 
      array (
        'id' => '2701',
        'name' => '成都',
      ),
      2702 => 
      array (
        'id' => '2702',
        'name' => '攀枝花',
      ),
      2703 => 
      array (
        'id' => '2703',
        'name' => '自贡',
      ),
      2704 => 
      array (
        'id' => '2704',
        'name' => '绵阳',
      ),
      2705 => 
      array (
        'id' => '2705',
        'name' => '南充',
      ),
      2706 => 
      array (
        'id' => '2706',
        'name' => '达州',
      ),
      2707 => 
      array (
        'id' => '2707',
        'name' => '遂宁',
      ),
      2708 => 
      array (
        'id' => '2708',
        'name' => '广安',
      ),
      2709 => 
      array (
        'id' => '2709',
        'name' => '巴中',
      ),
      2710 => 
      array (
        'id' => '2710',
        'name' => '泸州',
      ),
      2711 => 
      array (
        'id' => '2711',
        'name' => '宜宾',
      ),
      2712 => 
      array (
        'id' => '2712',
        'name' => '内江',
      ),
      2713 => 
      array (
        'id' => '2713',
        'name' => '资阳',
      ),
      2714 => 
      array (
        'id' => '2714',
        'name' => '乐山',
      ),
      2715 => 
      array (
        'id' => '2715',
        'name' => '眉山',
      ),
      2716 => 
      array (
        'id' => '2716',
        'name' => '凉山',
      ),
      2717 => 
      array (
        'id' => '2717',
        'name' => '雅安',
      ),
      2718 => 
      array (
        'id' => '2718',
        'name' => '甘孜',
      ),
      2719 => 
      array (
        'id' => '2719',
        'name' => '阿坝',
      ),
      2720 => 
      array (
        'id' => '2720',
        'name' => '德阳',
      ),
      2721 => 
      array (
        'id' => '2721',
        'name' => '广元',
      ),
    ),
  ),
  28 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'list' => 
    array (
      2801 => 
      array (
        'id' => '2801',
        'name' => '广州',
      ),
      2802 => 
      array (
        'id' => '2802',
        'name' => '韶关',
      ),
      2803 => 
      array (
        'id' => '2803',
        'name' => '惠州',
      ),
      2804 => 
      array (
        'id' => '2804',
        'name' => '梅州',
      ),
      2805 => 
      array (
        'id' => '2805',
        'name' => '汕头',
      ),
      2806 => 
      array (
        'id' => '2806',
        'name' => '深圳',
      ),
      2807 => 
      array (
        'id' => '2807',
        'name' => '珠海',
      ),
      2808 => 
      array (
        'id' => '2808',
        'name' => '佛山',
      ),
      2809 => 
      array (
        'id' => '2809',
        'name' => '肇庆',
      ),
      2810 => 
      array (
        'id' => '2810',
        'name' => '湛江',
      ),
      2811 => 
      array (
        'id' => '2811',
        'name' => '江门',
      ),
      2812 => 
      array (
        'id' => '2812',
        'name' => '河源',
      ),
      2813 => 
      array (
        'id' => '2813',
        'name' => '清远',
      ),
      2814 => 
      array (
        'id' => '2814',
        'name' => '云浮',
      ),
      2815 => 
      array (
        'id' => '2815',
        'name' => '潮州',
      ),
      2816 => 
      array (
        'id' => '2816',
        'name' => '东莞',
      ),
      2817 => 
      array (
        'id' => '2817',
        'name' => '中山',
      ),
      2818 => 
      array (
        'id' => '2818',
        'name' => '阳江',
      ),
      2819 => 
      array (
        'id' => '2819',
        'name' => '揭阳',
      ),
      2820 => 
      array (
        'id' => '2820',
        'name' => '茂名',
      ),
      2821 => 
      array (
        'id' => '2821',
        'name' => '汕尾',
      ),
    ),
  ),
  29 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'list' => 
    array (
      2901 => 
      array (
        'id' => '2901',
        'name' => '昆明',
      ),
      2902 => 
      array (
        'id' => '2902',
        'name' => '大理',
      ),
      2903 => 
      array (
        'id' => '2903',
        'name' => '红河',
      ),
      2904 => 
      array (
        'id' => '2904',
        'name' => '曲靖',
      ),
      2905 => 
      array (
        'id' => '2905',
        'name' => '保山',
      ),
      2906 => 
      array (
        'id' => '2906',
        'name' => '文山',
      ),
      2907 => 
      array (
        'id' => '2907',
        'name' => '玉溪',
      ),
      2908 => 
      array (
        'id' => '2908',
        'name' => '楚雄',
      ),
      2909 => 
      array (
        'id' => '2909',
        'name' => '普洱',
      ),
      2910 => 
      array (
        'id' => '2910',
        'name' => '昭通',
      ),
      2911 => 
      array (
        'id' => '2911',
        'name' => '临沧',
      ),
      2912 => 
      array (
        'id' => '2912',
        'name' => '怒江',
      ),
      2913 => 
      array (
        'id' => '2913',
        'name' => '迪庆',
      ),
      2914 => 
      array (
        'id' => '2914',
        'name' => '丽江',
      ),
      2915 => 
      array (
        'id' => '2915',
        'name' => '德宏',
      ),
      2916 => 
      array (
        'id' => '2916',
        'name' => '西双版纳',
      ),
    ),
  ),
  30 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'list' => 
    array (
      3001 => 
      array (
        'id' => '3001',
        'name' => '南宁',
      ),
      3002 => 
      array (
        'id' => '3002',
        'name' => '崇左',
      ),
      3003 => 
      array (
        'id' => '3003',
        'name' => '柳州',
      ),
      3004 => 
      array (
        'id' => '3004',
        'name' => '来宾',
      ),
      3005 => 
      array (
        'id' => '3005',
        'name' => '桂林',
      ),
      3006 => 
      array (
        'id' => '3006',
        'name' => '梧州',
      ),
      3007 => 
      array (
        'id' => '3007',
        'name' => '贺州',
      ),
      3008 => 
      array (
        'id' => '3008',
        'name' => '贵港',
      ),
      3009 => 
      array (
        'id' => '3009',
        'name' => '玉林',
      ),
      3010 => 
      array (
        'id' => '3010',
        'name' => '百色',
      ),
      3011 => 
      array (
        'id' => '3011',
        'name' => '钦州',
      ),
      3012 => 
      array (
        'id' => '3012',
        'name' => '河池',
      ),
      3013 => 
      array (
        'id' => '3013',
        'name' => '北海',
      ),
      3014 => 
      array (
        'id' => '3014',
        'name' => '防城港',
      ),
    ),
  ),
  31 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'list' => 
    array (
      3101 => 
      array (
        'id' => '3101',
        'name' => '海口',
      ),
      3102 => 
      array (
        'id' => '3102',
        'name' => '三亚',
      ),
      3103 => 
      array (
        'id' => '3103',
        'name' => '东方',
      ),
      3104 => 
      array (
        'id' => '3104',
        'name' => '临高',
      ),
      3105 => 
      array (
        'id' => '3105',
        'name' => '澄迈',
      ),
      3106 => 
      array (
        'id' => '3106',
        'name' => '儋州',
      ),
      3107 => 
      array (
        'id' => '3107',
        'name' => '昌江',
      ),
      3108 => 
      array (
        'id' => '3108',
        'name' => '白沙',
      ),
      3109 => 
      array (
        'id' => '3109',
        'name' => '琼中',
      ),
      3110 => 
      array (
        'id' => '3110',
        'name' => '定安',
      ),
      3111 => 
      array (
        'id' => '3111',
        'name' => '屯昌',
      ),
      3112 => 
      array (
        'id' => '3112',
        'name' => '琼海',
      ),
      3113 => 
      array (
        'id' => '3113',
        'name' => '文昌',
      ),
      3114 => 
      array (
        'id' => '3114',
        'name' => '保亭',
      ),
      3115 => 
      array (
        'id' => '3115',
        'name' => '万宁',
      ),
      3116 => 
      array (
        'id' => '3116',
        'name' => '陵水',
      ),
      3117 => 
      array (
        'id' => '3117',
        'name' => '西沙',
      ),
      3118 => 
      array (
        'id' => '3118',
        'name' => '南沙',
      ),
      3119 => 
      array (
        'id' => '3119',
        'name' => '乐东',
      ),
      3120 => 
      array (
        'id' => '3120',
        'name' => '五指山',
      ),
    ),
  ),
  32 => 
  array (
    'province' => 
    array (
      'id' => '32',
      'name' => '香港',
    ),
    'list' => 
    array (
      3201 => 
      array (
        'id' => '3201',
        'name' => '香港',
      ),
    ),
  ),
  33 => 
  array (
    'province' => 
    array (
      'id' => '33',
      'name' => '澳门',
    ),
    'list' => 
    array (
      3301 => 
      array (
        'id' => '3301',
        'name' => '澳门',
      ),
    ),
  ),
  34 => 
  array (
    'province' => 
    array (
      'id' => '34',
      'name' => '台湾',
    ),
    'list' => 
    array (
      3401 => 
      array (
        'id' => '3401',
        'name' => '台北',
      ),
      3402 => 
      array (
        'id' => '3402',
        'name' => '高雄',
      ),
      3403 => 
      array (
        'id' => '3403',
        'name' => '台中',
      ),
    ),
  ),
);