<?php
$data = array (
  '0101' => 
  array (
    'province' => 
    array (
      'id' => '01',
      'name' => '北京',
    ),
    'city' => 
    array (
      'id' => '0101',
      'name' => '北京',
    ),
    'list' => 
    array (
      '010101' => 
      array (
        'id' => '010101',
        'name' => '北京',
      ),
      '010102' => 
      array (
        'id' => '010102',
        'name' => '海淀',
      ),
      '010103' => 
      array (
        'id' => '010103',
        'name' => '朝阳',
      ),
      '010104' => 
      array (
        'id' => '010104',
        'name' => '顺义',
      ),
      '010105' => 
      array (
        'id' => '010105',
        'name' => '怀柔',
      ),
      '010106' => 
      array (
        'id' => '010106',
        'name' => '通州',
      ),
      '010107' => 
      array (
        'id' => '010107',
        'name' => '昌平',
      ),
      '010108' => 
      array (
        'id' => '010108',
        'name' => '延庆',
      ),
      '010109' => 
      array (
        'id' => '010109',
        'name' => '丰台',
      ),
      '010110' => 
      array (
        'id' => '010110',
        'name' => '石景山',
      ),
      '010111' => 
      array (
        'id' => '010111',
        'name' => '大兴',
      ),
      '010112' => 
      array (
        'id' => '010112',
        'name' => '房山',
      ),
      '010113' => 
      array (
        'id' => '010113',
        'name' => '密云',
      ),
      '010114' => 
      array (
        'id' => '010114',
        'name' => '门头沟',
      ),
      '010115' => 
      array (
        'id' => '010115',
        'name' => '平谷',
      ),
    ),
  ),
  '0201' => 
  array (
    'province' => 
    array (
      'id' => '02',
      'name' => '上海',
    ),
    'city' => 
    array (
      'id' => '0201',
      'name' => '上海',
    ),
    'list' => 
    array (
      '020101' => 
      array (
        'id' => '020101',
        'name' => '上海',
      ),
      '020102' => 
      array (
        'id' => '020102',
        'name' => '闵行',
      ),
      '020103' => 
      array (
        'id' => '020103',
        'name' => '宝山',
      ),
      '020104' => 
      array (
        'id' => '020104',
        'name' => '嘉定',
      ),
      '020105' => 
      array (
        'id' => '020105',
        'name' => '浦东南汇',
      ),
      '020106' => 
      array (
        'id' => '020106',
        'name' => '金山',
      ),
      '020107' => 
      array (
        'id' => '020107',
        'name' => '青浦',
      ),
      '020108' => 
      array (
        'id' => '020108',
        'name' => '松江',
      ),
      '020109' => 
      array (
        'id' => '020109',
        'name' => '奉贤',
      ),
      '020110' => 
      array (
        'id' => '020110',
        'name' => '崇明',
      ),
      '020111' => 
      array (
        'id' => '020111',
        'name' => '徐家汇',
      ),
      '020112' => 
      array (
        'id' => '020112',
        'name' => '浦东',
      ),
    ),
  ),
  '0301' => 
  array (
    'province' => 
    array (
      'id' => '03',
      'name' => '天津',
    ),
    'city' => 
    array (
      'id' => '0301',
      'name' => '天津',
    ),
    'list' => 
    array (
      '030101' => 
      array (
        'id' => '030101',
        'name' => '天津',
      ),
      '030102' => 
      array (
        'id' => '030102',
        'name' => '武清',
      ),
      '030103' => 
      array (
        'id' => '030103',
        'name' => '宝坻',
      ),
      '030104' => 
      array (
        'id' => '030104',
        'name' => '东丽',
      ),
      '030105' => 
      array (
        'id' => '030105',
        'name' => '西青',
      ),
      '030106' => 
      array (
        'id' => '030106',
        'name' => '北辰',
      ),
      '030107' => 
      array (
        'id' => '030107',
        'name' => '宁河',
      ),
      '030108' => 
      array (
        'id' => '030108',
        'name' => '汉沽',
      ),
      '030109' => 
      array (
        'id' => '030109',
        'name' => '静海',
      ),
      '030110' => 
      array (
        'id' => '030110',
        'name' => '津南',
      ),
      '030111' => 
      array (
        'id' => '030111',
        'name' => '塘沽',
      ),
      '030112' => 
      array (
        'id' => '030112',
        'name' => '大港',
      ),
      '030113' => 
      array (
        'id' => '030113',
        'name' => '蓟县',
      ),
    ),
  ),
  '0401' => 
  array (
    'province' => 
    array (
      'id' => '04',
      'name' => '重庆',
    ),
    'city' => 
    array (
      'id' => '0401',
      'name' => '重庆',
    ),
    'list' => 
    array (
      '040101' => 
      array (
        'id' => '040101',
        'name' => '重庆',
      ),
      '040102' => 
      array (
        'id' => '040102',
        'name' => '永川',
      ),
      '040103' => 
      array (
        'id' => '040103',
        'name' => '合川',
      ),
      '040104' => 
      array (
        'id' => '040104',
        'name' => '南川',
      ),
      '040105' => 
      array (
        'id' => '040105',
        'name' => '江津',
      ),
      '040106' => 
      array (
        'id' => '040106',
        'name' => '万盛',
      ),
      '040107' => 
      array (
        'id' => '040107',
        'name' => '渝北',
      ),
      '040108' => 
      array (
        'id' => '040108',
        'name' => '北碚',
      ),
      '040109' => 
      array (
        'id' => '040109',
        'name' => '巴南',
      ),
      '040110' => 
      array (
        'id' => '040110',
        'name' => '长寿',
      ),
      '040111' => 
      array (
        'id' => '040111',
        'name' => '黔江',
      ),
      '040112' => 
      array (
        'id' => '040112',
        'name' => '万州',
      ),
      '040113' => 
      array (
        'id' => '040113',
        'name' => '涪陵',
      ),
      '040114' => 
      array (
        'id' => '040114',
        'name' => '开县',
      ),
      '040115' => 
      array (
        'id' => '040115',
        'name' => '城口',
      ),
      '040116' => 
      array (
        'id' => '040116',
        'name' => '云阳',
      ),
      '040117' => 
      array (
        'id' => '040117',
        'name' => '巫溪',
      ),
      '040118' => 
      array (
        'id' => '040118',
        'name' => '奉节',
      ),
      '040119' => 
      array (
        'id' => '040119',
        'name' => '巫山',
      ),
      '040120' => 
      array (
        'id' => '040120',
        'name' => '潼南',
      ),
      '040121' => 
      array (
        'id' => '040121',
        'name' => '垫江',
      ),
      '040122' => 
      array (
        'id' => '040122',
        'name' => '梁平',
      ),
      '040123' => 
      array (
        'id' => '040123',
        'name' => '忠县',
      ),
      '040124' => 
      array (
        'id' => '040124',
        'name' => '石柱',
      ),
      '040125' => 
      array (
        'id' => '040125',
        'name' => '大足',
      ),
      '040126' => 
      array (
        'id' => '040126',
        'name' => '荣昌',
      ),
      '040127' => 
      array (
        'id' => '040127',
        'name' => '铜梁',
      ),
      '040128' => 
      array (
        'id' => '040128',
        'name' => '璧山',
      ),
      '040129' => 
      array (
        'id' => '040129',
        'name' => '丰都',
      ),
      '040130' => 
      array (
        'id' => '040130',
        'name' => '武隆',
      ),
      '040131' => 
      array (
        'id' => '040131',
        'name' => '彭水',
      ),
      '040132' => 
      array (
        'id' => '040132',
        'name' => '綦江',
      ),
      '040133' => 
      array (
        'id' => '040133',
        'name' => '酉阳',
      ),
      '040134' => 
      array (
        'id' => '040134',
        'name' => '秀山',
      ),
    ),
  ),
  '0501' => 
  array (
    'province' => 
    array (
      'id' => '05',
      'name' => '黑龙江',
    ),
    'city' => 
    array (
      'id' => '0501',
      'name' => '哈尔滨',
    ),
    'list' => 
    array (
      '050101' => 
      array (
        'id' => '050101',
        'name' => '哈尔滨',
      ),
      '050102' => 
      array (
        'id' => '050102',
        'name' => '双城',
      ),
      '050103' => 
      array (
        'id' => '050103',
        'name' => '呼兰',
      ),
      '050104' => 
      array (
        'id' => '050104',
        'name' => '阿城',
      ),
      '050105' => 
      array (
        'id' => '050105',
        'name' => '宾县',
      ),
      '050106' => 
      array (
        'id' => '050106',
        'name' => '依兰',
      ),
      '050107' => 
      array (
        'id' => '050107',
        'name' => '巴彦',
      ),
      '050108' => 
      array (
        'id' => '050108',
        'name' => '通河',
      ),
      '050109' => 
      array (
        'id' => '050109',
        'name' => '方正',
      ),
      '050110' => 
      array (
        'id' => '050110',
        'name' => '延寿',
      ),
      '050111' => 
      array (
        'id' => '050111',
        'name' => '尚志',
      ),
      '050112' => 
      array (
        'id' => '050112',
        'name' => '五常',
      ),
      '050113' => 
      array (
        'id' => '050113',
        'name' => '木兰',
      ),
    ),
  ),
  '0502' => 
  array (
    'province' => 
    array (
      'id' => '05',
      'name' => '黑龙江',
    ),
    'city' => 
    array (
      'id' => '0502',
      'name' => '齐齐哈尔',
    ),
    'list' => 
    array (
      '050201' => 
      array (
        'id' => '050201',
        'name' => '齐齐哈尔',
      ),
      '050202' => 
      array (
        'id' => '050202',
        'name' => '讷河',
      ),
      '050203' => 
      array (
        'id' => '050203',
        'name' => '龙江',
      ),
      '050204' => 
      array (
        'id' => '050204',
        'name' => '甘南',
      ),
      '050205' => 
      array (
        'id' => '050205',
        'name' => '富裕',
      ),
      '050206' => 
      array (
        'id' => '050206',
        'name' => '依安',
      ),
      '050207' => 
      array (
        'id' => '050207',
        'name' => '拜泉',
      ),
      '050208' => 
      array (
        'id' => '050208',
        'name' => '克山',
      ),
      '050209' => 
      array (
        'id' => '050209',
        'name' => '克东',
      ),
      '050210' => 
      array (
        'id' => '050210',
        'name' => '泰来',
      ),
    ),
  ),
  '0503' => 
  array (
    'province' => 
    array (
      'id' => '05',
      'name' => '黑龙江',
    ),
    'city' => 
    array (
      'id' => '0503',
      'name' => '牡丹江',
    ),
    'list' => 
    array (
      '050301' => 
      array (
        'id' => '050301',
        'name' => '牡丹江',
      ),
      '050302' => 
      array (
        'id' => '050302',
        'name' => '海林',
      ),
      '050303' => 
      array (
        'id' => '050303',
        'name' => '穆棱',
      ),
      '050304' => 
      array (
        'id' => '050304',
        'name' => '林口',
      ),
      '050305' => 
      array (
        'id' => '050305',
        'name' => '绥芬河',
      ),
      '050306' => 
      array (
        'id' => '050306',
        'name' => '宁安',
      ),
      '050307' => 
      array (
        'id' => '050307',
        'name' => '东宁',
      ),
    ),
  ),
  '0504' => 
  array (
    'province' => 
    array (
      'id' => '05',
      'name' => '黑龙江',
    ),
    'city' => 
    array (
      'id' => '0504',
      'name' => '佳木斯',
    ),
    'list' => 
    array (
      '050401' => 
      array (
        'id' => '050401',
        'name' => '佳木斯',
      ),
      '050402' => 
      array (
        'id' => '050402',
        'name' => '汤原',
      ),
      '050403' => 
      array (
        'id' => '050403',
        'name' => '抚远',
      ),
      '050404' => 
      array (
        'id' => '050404',
        'name' => '桦川',
      ),
      '050405' => 
      array (
        'id' => '050405',
        'name' => '桦南',
      ),
      '050406' => 
      array (
        'id' => '050406',
        'name' => '同江',
      ),
      '050407' => 
      array (
        'id' => '050407',
        'name' => '富锦',
      ),
    ),
  ),
  '0505' => 
  array (
    'province' => 
    array (
      'id' => '05',
      'name' => '黑龙江',
    ),
    'city' => 
    array (
      'id' => '0505',
      'name' => '绥化',
    ),
    'list' => 
    array (
      '050501' => 
      array (
        'id' => '050501',
        'name' => '绥化',
      ),
      '050502' => 
      array (
        'id' => '050502',
        'name' => '肇东',
      ),
      '050503' => 
      array (
        'id' => '050503',
        'name' => '安达',
      ),
      '050504' => 
      array (
        'id' => '050504',
        'name' => '海伦',
      ),
      '050505' => 
      array (
        'id' => '050505',
        'name' => '明水',
      ),
      '050506' => 
      array (
        'id' => '050506',
        'name' => '望奎',
      ),
      '050507' => 
      array (
        'id' => '050507',
        'name' => '兰西',
      ),
      '050508' => 
      array (
        'id' => '050508',
        'name' => '青冈',
      ),
      '050509' => 
      array (
        'id' => '050509',
        'name' => '庆安',
      ),
      '050510' => 
      array (
        'id' => '050510',
        'name' => '绥棱',
      ),
    ),
  ),
  '0506' => 
  array (
    'province' => 
    array (
      'id' => '05',
      'name' => '黑龙江',
    ),
    'city' => 
    array (
      'id' => '0506',
      'name' => '黑河',
    ),
    'list' => 
    array (
      '050601' => 
      array (
        'id' => '050601',
        'name' => '黑河',
      ),
      '050602' => 
      array (
        'id' => '050602',
        'name' => '嫩江',
      ),
      '050603' => 
      array (
        'id' => '050603',
        'name' => '孙吴',
      ),
      '050604' => 
      array (
        'id' => '050604',
        'name' => '逊克',
      ),
      '050605' => 
      array (
        'id' => '050605',
        'name' => '五大连池',
      ),
      '050606' => 
      array (
        'id' => '050606',
        'name' => '北安',
      ),
    ),
  ),
  '0507' => 
  array (
    'province' => 
    array (
      'id' => '05',
      'name' => '黑龙江',
    ),
    'city' => 
    array (
      'id' => '0507',
      'name' => '大兴安岭',
    ),
    'list' => 
    array (
      '050701' => 
      array (
        'id' => '050701',
        'name' => '大兴安岭',
      ),
      '050702' => 
      array (
        'id' => '050702',
        'name' => '塔河',
      ),
      '050703' => 
      array (
        'id' => '050703',
        'name' => '漠河',
      ),
      '050704' => 
      array (
        'id' => '050704',
        'name' => '呼玛',
      ),
      '050705' => 
      array (
        'id' => '050705',
        'name' => '呼中',
      ),
      '050706' => 
      array (
        'id' => '050706',
        'name' => '新林',
      ),
      '050707' => 
      array (
        'id' => '050707',
        'name' => '加格达奇',
      ),
    ),
  ),
  '0508' => 
  array (
    'province' => 
    array (
      'id' => '05',
      'name' => '黑龙江',
    ),
    'city' => 
    array (
      'id' => '0508',
      'name' => '伊春',
    ),
    'list' => 
    array (
      '050801' => 
      array (
        'id' => '050801',
        'name' => '伊春',
      ),
      '050802' => 
      array (
        'id' => '050802',
        'name' => '乌伊岭',
      ),
      '050803' => 
      array (
        'id' => '050803',
        'name' => '五营',
      ),
      '050804' => 
      array (
        'id' => '050804',
        'name' => '铁力',
      ),
      '050805' => 
      array (
        'id' => '050805',
        'name' => '嘉荫',
      ),
    ),
  ),
  '0509' => 
  array (
    'province' => 
    array (
      'id' => '05',
      'name' => '黑龙江',
    ),
    'city' => 
    array (
      'id' => '0509',
      'name' => '大庆',
    ),
    'list' => 
    array (
      '050901' => 
      array (
        'id' => '050901',
        'name' => '大庆',
      ),
      '050902' => 
      array (
        'id' => '050902',
        'name' => '林甸',
      ),
      '050903' => 
      array (
        'id' => '050903',
        'name' => '肇州',
      ),
      '050904' => 
      array (
        'id' => '050904',
        'name' => '肇源',
      ),
      '050905' => 
      array (
        'id' => '050905',
        'name' => '杜尔伯特',
      ),
    ),
  ),
  '0510' => 
  array (
    'province' => 
    array (
      'id' => '05',
      'name' => '黑龙江',
    ),
    'city' => 
    array (
      'id' => '0510',
      'name' => '七台河',
    ),
    'list' => 
    array (
      '051001' => 
      array (
        'id' => '051001',
        'name' => '七台河',
      ),
      '051002' => 
      array (
        'id' => '051002',
        'name' => '勃利',
      ),
    ),
  ),
  '0511' => 
  array (
    'province' => 
    array (
      'id' => '05',
      'name' => '黑龙江',
    ),
    'city' => 
    array (
      'id' => '0511',
      'name' => '鸡西',
    ),
    'list' => 
    array (
      '051101' => 
      array (
        'id' => '051101',
        'name' => '鸡西',
      ),
      '051102' => 
      array (
        'id' => '051102',
        'name' => '虎林',
      ),
      '051103' => 
      array (
        'id' => '051103',
        'name' => '密山',
      ),
      '051104' => 
      array (
        'id' => '051104',
        'name' => '鸡东',
      ),
    ),
  ),
  '0512' => 
  array (
    'province' => 
    array (
      'id' => '05',
      'name' => '黑龙江',
    ),
    'city' => 
    array (
      'id' => '0512',
      'name' => '鹤岗',
    ),
    'list' => 
    array (
      '051201' => 
      array (
        'id' => '051201',
        'name' => '鹤岗',
      ),
      '051202' => 
      array (
        'id' => '051202',
        'name' => '绥滨',
      ),
      '051203' => 
      array (
        'id' => '051203',
        'name' => '萝北',
      ),
    ),
  ),
  '0513' => 
  array (
    'province' => 
    array (
      'id' => '05',
      'name' => '黑龙江',
    ),
    'city' => 
    array (
      'id' => '0513',
      'name' => '双鸭山',
    ),
    'list' => 
    array (
      '051301' => 
      array (
        'id' => '051301',
        'name' => '双鸭山',
      ),
      '051302' => 
      array (
        'id' => '051302',
        'name' => '集贤',
      ),
      '051303' => 
      array (
        'id' => '051303',
        'name' => '宝清',
      ),
      '051304' => 
      array (
        'id' => '051304',
        'name' => '饶河',
      ),
      '051305' => 
      array (
        'id' => '051305',
        'name' => '友谊',
      ),
    ),
  ),
  '0601' => 
  array (
    'province' => 
    array (
      'id' => '06',
      'name' => '吉林',
    ),
    'city' => 
    array (
      'id' => '0601',
      'name' => '长春',
    ),
    'list' => 
    array (
      '060101' => 
      array (
        'id' => '060101',
        'name' => '长春',
      ),
      '060102' => 
      array (
        'id' => '060102',
        'name' => '农安',
      ),
      '060103' => 
      array (
        'id' => '060103',
        'name' => '德惠',
      ),
      '060104' => 
      array (
        'id' => '060104',
        'name' => '九台',
      ),
      '060105' => 
      array (
        'id' => '060105',
        'name' => '榆树',
      ),
      '060106' => 
      array (
        'id' => '060106',
        'name' => '双阳',
      ),
    ),
  ),
  '0602' => 
  array (
    'province' => 
    array (
      'id' => '06',
      'name' => '吉林',
    ),
    'city' => 
    array (
      'id' => '0602',
      'name' => '吉林',
    ),
    'list' => 
    array (
      '060201' => 
      array (
        'id' => '060201',
        'name' => '吉林',
      ),
      '060202' => 
      array (
        'id' => '060202',
        'name' => '舒兰',
      ),
      '060203' => 
      array (
        'id' => '060203',
        'name' => '永吉',
      ),
      '060204' => 
      array (
        'id' => '060204',
        'name' => '蛟河',
      ),
      '060205' => 
      array (
        'id' => '060205',
        'name' => '磐石',
      ),
      '060206' => 
      array (
        'id' => '060206',
        'name' => '桦甸',
      ),
    ),
  ),
  '0603' => 
  array (
    'province' => 
    array (
      'id' => '06',
      'name' => '吉林',
    ),
    'city' => 
    array (
      'id' => '0603',
      'name' => '延边',
    ),
    'list' => 
    array (
      '060301' => 
      array (
        'id' => '060301',
        'name' => '延吉',
      ),
      '060302' => 
      array (
        'id' => '060302',
        'name' => '敦化',
      ),
      '060303' => 
      array (
        'id' => '060303',
        'name' => '安图',
      ),
      '060304' => 
      array (
        'id' => '060304',
        'name' => '汪清',
      ),
      '060305' => 
      array (
        'id' => '060305',
        'name' => '和龙',
      ),
      '060306' => 
      array (
        'id' => '060306',
        'name' => '龙井',
      ),
      '060307' => 
      array (
        'id' => '060307',
        'name' => '珲春',
      ),
      '060308' => 
      array (
        'id' => '060308',
        'name' => '图们',
      ),
    ),
  ),
  '0604' => 
  array (
    'province' => 
    array (
      'id' => '06',
      'name' => '吉林',
    ),
    'city' => 
    array (
      'id' => '0604',
      'name' => '四平',
    ),
    'list' => 
    array (
      '060401' => 
      array (
        'id' => '060401',
        'name' => '四平',
      ),
      '060402' => 
      array (
        'id' => '060402',
        'name' => '双辽',
      ),
      '060403' => 
      array (
        'id' => '060403',
        'name' => '梨树',
      ),
      '060404' => 
      array (
        'id' => '060404',
        'name' => '公主岭',
      ),
      '060405' => 
      array (
        'id' => '060405',
        'name' => '伊通',
      ),
    ),
  ),
  '0605' => 
  array (
    'province' => 
    array (
      'id' => '06',
      'name' => '吉林',
    ),
    'city' => 
    array (
      'id' => '0605',
      'name' => '通化',
    ),
    'list' => 
    array (
      '060501' => 
      array (
        'id' => '060501',
        'name' => '通化',
      ),
      '060502' => 
      array (
        'id' => '060502',
        'name' => '梅河口',
      ),
      '060503' => 
      array (
        'id' => '060503',
        'name' => '柳河',
      ),
      '060504' => 
      array (
        'id' => '060504',
        'name' => '辉南',
      ),
      '060505' => 
      array (
        'id' => '060505',
        'name' => '集安',
      ),
      '060506' => 
      array (
        'id' => '060506',
        'name' => '通化县',
      ),
    ),
  ),
  '0606' => 
  array (
    'province' => 
    array (
      'id' => '06',
      'name' => '吉林',
    ),
    'city' => 
    array (
      'id' => '0606',
      'name' => '白城',
    ),
    'list' => 
    array (
      '060601' => 
      array (
        'id' => '060601',
        'name' => '白城',
      ),
      '060602' => 
      array (
        'id' => '060602',
        'name' => '洮南',
      ),
      '060603' => 
      array (
        'id' => '060603',
        'name' => '大安',
      ),
      '060604' => 
      array (
        'id' => '060604',
        'name' => '镇赉',
      ),
      '060605' => 
      array (
        'id' => '060605',
        'name' => '通榆',
      ),
    ),
  ),
  '0607' => 
  array (
    'province' => 
    array (
      'id' => '06',
      'name' => '吉林',
    ),
    'city' => 
    array (
      'id' => '0607',
      'name' => '辽源',
    ),
    'list' => 
    array (
      '060701' => 
      array (
        'id' => '060701',
        'name' => '辽源',
      ),
      '060702' => 
      array (
        'id' => '060702',
        'name' => '东丰',
      ),
      '060703' => 
      array (
        'id' => '060703',
        'name' => '东辽',
      ),
    ),
  ),
  '0608' => 
  array (
    'province' => 
    array (
      'id' => '06',
      'name' => '吉林',
    ),
    'city' => 
    array (
      'id' => '0608',
      'name' => '松原',
    ),
    'list' => 
    array (
      '060801' => 
      array (
        'id' => '060801',
        'name' => '松原',
      ),
      '060802' => 
      array (
        'id' => '060802',
        'name' => '乾安',
      ),
      '060803' => 
      array (
        'id' => '060803',
        'name' => '前郭',
      ),
      '060804' => 
      array (
        'id' => '060804',
        'name' => '长岭',
      ),
      '060805' => 
      array (
        'id' => '060805',
        'name' => '扶余',
      ),
    ),
  ),
  '0609' => 
  array (
    'province' => 
    array (
      'id' => '06',
      'name' => '吉林',
    ),
    'city' => 
    array (
      'id' => '0609',
      'name' => '白山',
    ),
    'list' => 
    array (
      '060901' => 
      array (
        'id' => '060901',
        'name' => '白山',
      ),
      '060902' => 
      array (
        'id' => '060902',
        'name' => '靖宇',
      ),
      '060903' => 
      array (
        'id' => '060903',
        'name' => '临江',
      ),
      '060904' => 
      array (
        'id' => '060904',
        'name' => '东岗',
      ),
      '060905' => 
      array (
        'id' => '060905',
        'name' => '长白',
      ),
      '060906' => 
      array (
        'id' => '060906',
        'name' => '抚松',
      ),
      '060907' => 
      array (
        'id' => '060907',
        'name' => '江源',
      ),
    ),
  ),
  '0701' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'city' => 
    array (
      'id' => '0701',
      'name' => '沈阳',
    ),
    'list' => 
    array (
      '070101' => 
      array (
        'id' => '070101',
        'name' => '沈阳',
      ),
      '070102' => 
      array (
        'id' => '070102',
        'name' => '辽中',
      ),
      '070103' => 
      array (
        'id' => '070103',
        'name' => '康平',
      ),
      '070104' => 
      array (
        'id' => '070104',
        'name' => '法库',
      ),
      '070105' => 
      array (
        'id' => '070105',
        'name' => '新民',
      ),
    ),
  ),
  '0702' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'city' => 
    array (
      'id' => '0702',
      'name' => '大连',
    ),
    'list' => 
    array (
      '070201' => 
      array (
        'id' => '070201',
        'name' => '大连',
      ),
      '070202' => 
      array (
        'id' => '070202',
        'name' => '瓦房店',
      ),
      '070203' => 
      array (
        'id' => '070203',
        'name' => '金州',
      ),
      '070204' => 
      array (
        'id' => '070204',
        'name' => '普兰店',
      ),
      '070205' => 
      array (
        'id' => '070205',
        'name' => '旅顺',
      ),
      '070206' => 
      array (
        'id' => '070206',
        'name' => '长海',
      ),
      '070207' => 
      array (
        'id' => '070207',
        'name' => '庄河',
      ),
    ),
  ),
  '0703' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'city' => 
    array (
      'id' => '0703',
      'name' => '鞍山',
    ),
    'list' => 
    array (
      '070301' => 
      array (
        'id' => '070301',
        'name' => '鞍山',
      ),
      '070302' => 
      array (
        'id' => '070302',
        'name' => '台安',
      ),
      '070303' => 
      array (
        'id' => '070303',
        'name' => '岫岩',
      ),
      '070304' => 
      array (
        'id' => '070304',
        'name' => '海城',
      ),
    ),
  ),
  '0704' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'city' => 
    array (
      'id' => '0704',
      'name' => '抚顺',
    ),
    'list' => 
    array (
      '070401' => 
      array (
        'id' => '070401',
        'name' => '抚顺',
      ),
      '070402' => 
      array (
        'id' => '070402',
        'name' => '新宾',
      ),
      '070403' => 
      array (
        'id' => '070403',
        'name' => '清原',
      ),
      '070404' => 
      array (
        'id' => '070404',
        'name' => '章党',
      ),
    ),
  ),
  '0705' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'city' => 
    array (
      'id' => '0705',
      'name' => '本溪',
    ),
    'list' => 
    array (
      '070501' => 
      array (
        'id' => '070501',
        'name' => '本溪',
      ),
      '070502' => 
      array (
        'id' => '070502',
        'name' => '本溪县',
      ),
      '070503' => 
      array (
        'id' => '070503',
        'name' => '桓仁',
      ),
    ),
  ),
  '0706' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'city' => 
    array (
      'id' => '0706',
      'name' => '丹东',
    ),
    'list' => 
    array (
      '070601' => 
      array (
        'id' => '070601',
        'name' => '丹东',
      ),
      '070602' => 
      array (
        'id' => '070602',
        'name' => '凤城',
      ),
      '070603' => 
      array (
        'id' => '070603',
        'name' => '宽甸',
      ),
      '070604' => 
      array (
        'id' => '070604',
        'name' => '东港',
      ),
    ),
  ),
  '0707' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'city' => 
    array (
      'id' => '0707',
      'name' => '锦州',
    ),
    'list' => 
    array (
      '070701' => 
      array (
        'id' => '070701',
        'name' => '锦州',
      ),
      '070702' => 
      array (
        'id' => '070702',
        'name' => '凌海',
      ),
      '070703' => 
      array (
        'id' => '070703',
        'name' => '义县',
      ),
      '070704' => 
      array (
        'id' => '070704',
        'name' => '黑山',
      ),
      '070705' => 
      array (
        'id' => '070705',
        'name' => '北镇',
      ),
    ),
  ),
  '0708' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'city' => 
    array (
      'id' => '0708',
      'name' => '营口',
    ),
    'list' => 
    array (
      '070801' => 
      array (
        'id' => '070801',
        'name' => '营口',
      ),
      '070802' => 
      array (
        'id' => '070802',
        'name' => '大石桥',
      ),
      '070803' => 
      array (
        'id' => '070803',
        'name' => '盖州',
      ),
    ),
  ),
  '0709' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'city' => 
    array (
      'id' => '0709',
      'name' => '阜新',
    ),
    'list' => 
    array (
      '070901' => 
      array (
        'id' => '070901',
        'name' => '阜新',
      ),
      '070902' => 
      array (
        'id' => '070902',
        'name' => '彰武',
      ),
    ),
  ),
  '0710' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'city' => 
    array (
      'id' => '0710',
      'name' => '辽阳',
    ),
    'list' => 
    array (
      '071001' => 
      array (
        'id' => '071001',
        'name' => '辽阳',
      ),
      '071002' => 
      array (
        'id' => '071002',
        'name' => '辽阳县',
      ),
      '071003' => 
      array (
        'id' => '071003',
        'name' => '灯塔',
      ),
      '071004' => 
      array (
        'id' => '071004',
        'name' => '弓长岭',
      ),
    ),
  ),
  '0711' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'city' => 
    array (
      'id' => '0711',
      'name' => '铁岭',
    ),
    'list' => 
    array (
      '071101' => 
      array (
        'id' => '071101',
        'name' => '铁岭',
      ),
      '071102' => 
      array (
        'id' => '071102',
        'name' => '开原',
      ),
      '071103' => 
      array (
        'id' => '071103',
        'name' => '昌图',
      ),
      '071104' => 
      array (
        'id' => '071104',
        'name' => '西丰',
      ),
      '071105' => 
      array (
        'id' => '071105',
        'name' => '调兵山',
      ),
    ),
  ),
  '0712' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'city' => 
    array (
      'id' => '0712',
      'name' => '朝阳',
    ),
    'list' => 
    array (
      '071201' => 
      array (
        'id' => '071201',
        'name' => '朝阳',
      ),
      '071202' => 
      array (
        'id' => '071202',
        'name' => '凌源',
      ),
      '071203' => 
      array (
        'id' => '071203',
        'name' => '喀左',
      ),
      '071204' => 
      array (
        'id' => '071204',
        'name' => '北票',
      ),
      '071205' => 
      array (
        'id' => '071205',
        'name' => '建平县',
      ),
    ),
  ),
  '0713' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'city' => 
    array (
      'id' => '0713',
      'name' => '盘锦',
    ),
    'list' => 
    array (
      '071301' => 
      array (
        'id' => '071301',
        'name' => '盘锦',
      ),
      '071302' => 
      array (
        'id' => '071302',
        'name' => '大洼',
      ),
      '071303' => 
      array (
        'id' => '071303',
        'name' => '盘山',
      ),
    ),
  ),
  '0714' => 
  array (
    'province' => 
    array (
      'id' => '07',
      'name' => '辽宁',
    ),
    'city' => 
    array (
      'id' => '0714',
      'name' => '葫芦岛',
    ),
    'list' => 
    array (
      '071401' => 
      array (
        'id' => '071401',
        'name' => '葫芦岛',
      ),
      '071402' => 
      array (
        'id' => '071402',
        'name' => '建昌',
      ),
      '071403' => 
      array (
        'id' => '071403',
        'name' => '绥中',
      ),
      '071404' => 
      array (
        'id' => '071404',
        'name' => '兴城',
      ),
    ),
  ),
  '0801' => 
  array (
    'province' => 
    array (
      'id' => '08',
      'name' => '内蒙古',
    ),
    'city' => 
    array (
      'id' => '0801',
      'name' => '呼和浩特',
    ),
    'list' => 
    array (
      '080101' => 
      array (
        'id' => '080101',
        'name' => '呼和浩特',
      ),
      '080102' => 
      array (
        'id' => '080102',
        'name' => '土左旗',
      ),
      '080103' => 
      array (
        'id' => '080103',
        'name' => '托县',
      ),
      '080104' => 
      array (
        'id' => '080104',
        'name' => '和林',
      ),
      '080105' => 
      array (
        'id' => '080105',
        'name' => '清水河',
      ),
      '080106' => 
      array (
        'id' => '080106',
        'name' => '呼市郊区',
      ),
      '080107' => 
      array (
        'id' => '080107',
        'name' => '武川',
      ),
    ),
  ),
  '0802' => 
  array (
    'province' => 
    array (
      'id' => '08',
      'name' => '内蒙古',
    ),
    'city' => 
    array (
      'id' => '0802',
      'name' => '包头',
    ),
    'list' => 
    array (
      '080201' => 
      array (
        'id' => '080201',
        'name' => '包头',
      ),
      '080202' => 
      array (
        'id' => '080202',
        'name' => '白云鄂博',
      ),
      '080203' => 
      array (
        'id' => '080203',
        'name' => '满都拉',
      ),
      '080204' => 
      array (
        'id' => '080204',
        'name' => '土右旗',
      ),
      '080205' => 
      array (
        'id' => '080205',
        'name' => '固阳',
      ),
      '080206' => 
      array (
        'id' => '080206',
        'name' => '达茂旗',
      ),
      '080207' => 
      array (
        'id' => '080207',
        'name' => '希拉穆仁',
      ),
    ),
  ),
  '0803' => 
  array (
    'province' => 
    array (
      'id' => '08',
      'name' => '内蒙古',
    ),
    'city' => 
    array (
      'id' => '0803',
      'name' => '乌海',
    ),
    'list' => 
    array (
      '080301' => 
      array (
        'id' => '080301',
        'name' => '乌海',
      ),
    ),
  ),
  '0804' => 
  array (
    'province' => 
    array (
      'id' => '08',
      'name' => '内蒙古',
    ),
    'city' => 
    array (
      'id' => '0804',
      'name' => '乌兰察布',
    ),
    'list' => 
    array (
      '080401' => 
      array (
        'id' => '080401',
        'name' => '集宁',
      ),
      '080402' => 
      array (
        'id' => '080402',
        'name' => '卓资',
      ),
      '080403' => 
      array (
        'id' => '080403',
        'name' => '化德',
      ),
      '080404' => 
      array (
        'id' => '080404',
        'name' => '商都',
      ),
      '080405' => 
      array (
        'id' => '080405',
        'name' => '兴和',
      ),
      '080406' => 
      array (
        'id' => '080406',
        'name' => '凉城',
      ),
      '080407' => 
      array (
        'id' => '080407',
        'name' => '察右前旗',
      ),
      '080408' => 
      array (
        'id' => '080408',
        'name' => '察右中旗',
      ),
      '080409' => 
      array (
        'id' => '080409',
        'name' => '察右后旗',
      ),
      '080410' => 
      array (
        'id' => '080410',
        'name' => '四子王旗',
      ),
      '080411' => 
      array (
        'id' => '080411',
        'name' => '丰镇',
      ),
    ),
  ),
  '0805' => 
  array (
    'province' => 
    array (
      'id' => '08',
      'name' => '内蒙古',
    ),
    'city' => 
    array (
      'id' => '0805',
      'name' => '通辽',
    ),
    'list' => 
    array (
      '080501' => 
      array (
        'id' => '080501',
        'name' => '通辽',
      ),
      '080502' => 
      array (
        'id' => '080502',
        'name' => '舍伯吐',
      ),
      '080503' => 
      array (
        'id' => '080503',
        'name' => '科左中旗',
      ),
      '080504' => 
      array (
        'id' => '080504',
        'name' => '科左后旗',
      ),
      '080505' => 
      array (
        'id' => '080505',
        'name' => '青龙山',
      ),
      '080506' => 
      array (
        'id' => '080506',
        'name' => '开鲁',
      ),
      '080507' => 
      array (
        'id' => '080507',
        'name' => '库伦',
      ),
      '080508' => 
      array (
        'id' => '080508',
        'name' => '奈曼',
      ),
      '080509' => 
      array (
        'id' => '080509',
        'name' => '扎鲁特',
      ),
      '080510' => 
      array (
        'id' => '080510',
        'name' => '巴雅尔吐胡硕',
      ),
      '080511' => 
      array (
        'id' => '080511',
        'name' => '霍林郭勒',
      ),
    ),
  ),
  '0806' => 
  array (
    'province' => 
    array (
      'id' => '08',
      'name' => '内蒙古',
    ),
    'city' => 
    array (
      'id' => '0806',
      'name' => '赤峰',
    ),
    'list' => 
    array (
      '080601' => 
      array (
        'id' => '080601',
        'name' => '赤峰',
      ),
      '080602' => 
      array (
        'id' => '080602',
        'name' => '阿鲁旗',
      ),
      '080603' => 
      array (
        'id' => '080603',
        'name' => '浩尔吐',
      ),
      '080604' => 
      array (
        'id' => '080604',
        'name' => '巴林左旗',
      ),
      '080605' => 
      array (
        'id' => '080605',
        'name' => '巴林右旗',
      ),
      '080606' => 
      array (
        'id' => '080606',
        'name' => '林西',
      ),
      '080607' => 
      array (
        'id' => '080607',
        'name' => '克什克腾',
      ),
      '080608' => 
      array (
        'id' => '080608',
        'name' => '翁牛特',
      ),
      '080609' => 
      array (
        'id' => '080609',
        'name' => '岗子',
      ),
      '080610' => 
      array (
        'id' => '080610',
        'name' => '喀喇沁',
      ),
      '080611' => 
      array (
        'id' => '080611',
        'name' => '八里罕',
      ),
      '080612' => 
      array (
        'id' => '080612',
        'name' => '宁城',
      ),
      '080613' => 
      array (
        'id' => '080613',
        'name' => '敖汉',
      ),
      '080614' => 
      array (
        'id' => '080614',
        'name' => '宝国吐',
      ),
    ),
  ),
  '0807' => 
  array (
    'province' => 
    array (
      'id' => '08',
      'name' => '内蒙古',
    ),
    'city' => 
    array (
      'id' => '0807',
      'name' => '鄂尔多斯',
    ),
    'list' => 
    array (
      '080701' => 
      array (
        'id' => '080701',
        'name' => '鄂尔多斯',
      ),
      '080702' => 
      array (
        'id' => '080702',
        'name' => '达拉特',
      ),
      '080703' => 
      array (
        'id' => '080703',
        'name' => '准格尔',
      ),
      '080704' => 
      array (
        'id' => '080704',
        'name' => '鄂前旗',
      ),
      '080705' => 
      array (
        'id' => '080705',
        'name' => '河南',
      ),
      '080706' => 
      array (
        'id' => '080706',
        'name' => '伊克乌素',
      ),
      '080707' => 
      array (
        'id' => '080707',
        'name' => '鄂托克',
      ),
      '080708' => 
      array (
        'id' => '080708',
        'name' => '杭锦旗',
      ),
      '080709' => 
      array (
        'id' => '080709',
        'name' => '乌审旗',
      ),
      '080710' => 
      array (
        'id' => '080710',
        'name' => '伊金霍洛',
      ),
      '080711' => 
      array (
        'id' => '080711',
        'name' => '乌审召',
      ),
      '080712' => 
      array (
        'id' => '080712',
        'name' => '东胜',
      ),
    ),
  ),
  '0808' => 
  array (
    'province' => 
    array (
      'id' => '08',
      'name' => '内蒙古',
    ),
    'city' => 
    array (
      'id' => '0808',
      'name' => '巴彦淖尔',
    ),
    'list' => 
    array (
      '080801' => 
      array (
        'id' => '080801',
        'name' => '临河',
      ),
      '080802' => 
      array (
        'id' => '080802',
        'name' => '五原',
      ),
      '080803' => 
      array (
        'id' => '080803',
        'name' => '磴口',
      ),
      '080804' => 
      array (
        'id' => '080804',
        'name' => '乌前旗',
      ),
      '080805' => 
      array (
        'id' => '080805',
        'name' => '大佘太',
      ),
      '080806' => 
      array (
        'id' => '080806',
        'name' => '乌中旗',
      ),
      '080807' => 
      array (
        'id' => '080807',
        'name' => '乌后旗',
      ),
      '080808' => 
      array (
        'id' => '080808',
        'name' => '海力素',
      ),
      '080809' => 
      array (
        'id' => '080809',
        'name' => '那仁宝力格',
      ),
      '080810' => 
      array (
        'id' => '080810',
        'name' => '杭锦后旗',
      ),
    ),
  ),
  '0809' => 
  array (
    'province' => 
    array (
      'id' => '08',
      'name' => '内蒙古',
    ),
    'city' => 
    array (
      'id' => '0809',
      'name' => '锡林郭勒',
    ),
    'list' => 
    array (
      '080901' => 
      array (
        'id' => '080901',
        'name' => '锡林浩特',
      ),
      '080902' => 
      array (
        'id' => '080902',
        'name' => '二连浩特',
      ),
      '080903' => 
      array (
        'id' => '080903',
        'name' => '阿巴嘎',
      ),
      '080904' => 
      array (
        'id' => '080904',
        'name' => '苏左旗',
      ),
      '080905' => 
      array (
        'id' => '080905',
        'name' => '苏右旗',
      ),
      '080906' => 
      array (
        'id' => '080906',
        'name' => '朱日和',
      ),
      '080907' => 
      array (
        'id' => '080907',
        'name' => '东乌旗',
      ),
      '080908' => 
      array (
        'id' => '080908',
        'name' => '西乌旗',
      ),
      '080909' => 
      array (
        'id' => '080909',
        'name' => '太仆寺',
      ),
      '080910' => 
      array (
        'id' => '080910',
        'name' => '镶黄旗',
      ),
      '080911' => 
      array (
        'id' => '080911',
        'name' => '正镶白旗',
      ),
      '080912' => 
      array (
        'id' => '080912',
        'name' => '正蓝旗',
      ),
      '080913' => 
      array (
        'id' => '080913',
        'name' => '多伦',
      ),
      '080914' => 
      array (
        'id' => '080914',
        'name' => '博克图',
      ),
      '080915' => 
      array (
        'id' => '080915',
        'name' => '乌拉盖',
      ),
    ),
  ),
  '0810' => 
  array (
    'province' => 
    array (
      'id' => '08',
      'name' => '内蒙古',
    ),
    'city' => 
    array (
      'id' => '0810',
      'name' => '呼伦贝尔',
    ),
    'list' => 
    array (
      '081001' => 
      array (
        'id' => '081001',
        'name' => '海拉尔',
      ),
      '081002' => 
      array (
        'id' => '081002',
        'name' => '小二沟',
      ),
      '081003' => 
      array (
        'id' => '081003',
        'name' => '阿荣旗',
      ),
      '081004' => 
      array (
        'id' => '081004',
        'name' => '莫力达瓦',
      ),
      '081005' => 
      array (
        'id' => '081005',
        'name' => '鄂伦春旗',
      ),
      '081006' => 
      array (
        'id' => '081006',
        'name' => '鄂温克旗',
      ),
      '081007' => 
      array (
        'id' => '081007',
        'name' => '陈旗',
      ),
      '081008' => 
      array (
        'id' => '081008',
        'name' => '新左旗',
      ),
      '081009' => 
      array (
        'id' => '081009',
        'name' => '新右旗',
      ),
      '081010' => 
      array (
        'id' => '081010',
        'name' => '满洲里',
      ),
      '081011' => 
      array (
        'id' => '081011',
        'name' => '牙克石',
      ),
      '081012' => 
      array (
        'id' => '081012',
        'name' => '扎兰屯',
      ),
      '081013' => 
      array (
        'id' => '081013',
        'name' => '额尔古纳',
      ),
      '081014' => 
      array (
        'id' => '081014',
        'name' => '根河',
      ),
      '081015' => 
      array (
        'id' => '081015',
        'name' => '图里河',
      ),
    ),
  ),
  '0811' => 
  array (
    'province' => 
    array (
      'id' => '08',
      'name' => '内蒙古',
    ),
    'city' => 
    array (
      'id' => '0811',
      'name' => '兴安盟',
    ),
    'list' => 
    array (
      '081101' => 
      array (
        'id' => '081101',
        'name' => '高力板',
      ),
      '081102' => 
      array (
        'id' => '081102',
        'name' => '乌兰浩特',
      ),
      '081103' => 
      array (
        'id' => '081103',
        'name' => '阿尔山',
      ),
      '081104' => 
      array (
        'id' => '081104',
        'name' => '科右中旗',
      ),
      '081105' => 
      array (
        'id' => '081105',
        'name' => '胡尔勒',
      ),
      '081106' => 
      array (
        'id' => '081106',
        'name' => '扎赉特',
      ),
      '081107' => 
      array (
        'id' => '081107',
        'name' => '索伦',
      ),
      '081108' => 
      array (
        'id' => '081108',
        'name' => '突泉',
      ),
      '081109' => 
      array (
        'id' => '081109',
        'name' => '科右前旗',
      ),
    ),
  ),
  '0812' => 
  array (
    'province' => 
    array (
      'id' => '08',
      'name' => '内蒙古',
    ),
    'city' => 
    array (
      'id' => '0812',
      'name' => '阿拉善盟',
    ),
    'list' => 
    array (
      '081201' => 
      array (
        'id' => '081201',
        'name' => '阿左旗',
      ),
      '081202' => 
      array (
        'id' => '081202',
        'name' => '阿右旗',
      ),
      '081203' => 
      array (
        'id' => '081203',
        'name' => '额济纳',
      ),
      '081204' => 
      array (
        'id' => '081204',
        'name' => '拐子湖',
      ),
      '081205' => 
      array (
        'id' => '081205',
        'name' => '吉兰太',
      ),
      '081206' => 
      array (
        'id' => '081206',
        'name' => '锡林高勒',
      ),
      '081207' => 
      array (
        'id' => '081207',
        'name' => '头道湖',
      ),
      '081208' => 
      array (
        'id' => '081208',
        'name' => '中泉子',
      ),
      '081209' => 
      array (
        'id' => '081209',
        'name' => '诺尔公',
      ),
      '081210' => 
      array (
        'id' => '081210',
        'name' => '雅布赖',
      ),
      '081211' => 
      array (
        'id' => '081211',
        'name' => '乌斯泰',
      ),
      '081212' => 
      array (
        'id' => '081212',
        'name' => '孪井滩',
      ),
    ),
  ),
  '0901' => 
  array (
    'province' => 
    array (
      'id' => '09',
      'name' => '河北',
    ),
    'city' => 
    array (
      'id' => '0901',
      'name' => '石家庄',
    ),
    'list' => 
    array (
      '090101' => 
      array (
        'id' => '090101',
        'name' => '石家庄',
      ),
      '090102' => 
      array (
        'id' => '090102',
        'name' => '井陉',
      ),
      '090103' => 
      array (
        'id' => '090103',
        'name' => '正定',
      ),
      '090104' => 
      array (
        'id' => '090104',
        'name' => '栾城',
      ),
      '090105' => 
      array (
        'id' => '090105',
        'name' => '行唐',
      ),
      '090106' => 
      array (
        'id' => '090106',
        'name' => '灵寿',
      ),
      '090107' => 
      array (
        'id' => '090107',
        'name' => '高邑',
      ),
      '090108' => 
      array (
        'id' => '090108',
        'name' => '深泽',
      ),
      '090109' => 
      array (
        'id' => '090109',
        'name' => '赞皇',
      ),
      '090110' => 
      array (
        'id' => '090110',
        'name' => '无极',
      ),
      '090111' => 
      array (
        'id' => '090111',
        'name' => '平山',
      ),
      '090112' => 
      array (
        'id' => '090112',
        'name' => '元氏',
      ),
      '090113' => 
      array (
        'id' => '090113',
        'name' => '赵县',
      ),
      '090114' => 
      array (
        'id' => '090114',
        'name' => '辛集',
      ),
      '090115' => 
      array (
        'id' => '090115',
        'name' => '藁城',
      ),
      '090116' => 
      array (
        'id' => '090116',
        'name' => '晋州',
      ),
      '090117' => 
      array (
        'id' => '090117',
        'name' => '新乐',
      ),
      '090118' => 
      array (
        'id' => '090118',
        'name' => '鹿泉',
      ),
    ),
  ),
  '0902' => 
  array (
    'province' => 
    array (
      'id' => '09',
      'name' => '河北',
    ),
    'city' => 
    array (
      'id' => '0902',
      'name' => '保定',
    ),
    'list' => 
    array (
      '090201' => 
      array (
        'id' => '090201',
        'name' => '保定',
      ),
      '090202' => 
      array (
        'id' => '090202',
        'name' => '满城',
      ),
      '090203' => 
      array (
        'id' => '090203',
        'name' => '阜平',
      ),
      '090204' => 
      array (
        'id' => '090204',
        'name' => '徐水',
      ),
      '090205' => 
      array (
        'id' => '090205',
        'name' => '唐县',
      ),
      '090206' => 
      array (
        'id' => '090206',
        'name' => '高阳',
      ),
      '090207' => 
      array (
        'id' => '090207',
        'name' => '容城',
      ),
      '090208' => 
      array (
        'id' => '090208',
        'name' => '涞源',
      ),
      '090209' => 
      array (
        'id' => '090209',
        'name' => '望都',
      ),
      '090210' => 
      array (
        'id' => '090210',
        'name' => '安新',
      ),
      '090211' => 
      array (
        'id' => '090211',
        'name' => '易县',
      ),
      '090212' => 
      array (
        'id' => '090212',
        'name' => '曲阳',
      ),
      '090213' => 
      array (
        'id' => '090213',
        'name' => '蠡县',
      ),
      '090214' => 
      array (
        'id' => '090214',
        'name' => '顺平',
      ),
      '090215' => 
      array (
        'id' => '090215',
        'name' => '雄县',
      ),
      '090216' => 
      array (
        'id' => '090216',
        'name' => '涿州',
      ),
      '090217' => 
      array (
        'id' => '090217',
        'name' => '定州',
      ),
      '090218' => 
      array (
        'id' => '090218',
        'name' => '安国',
      ),
      '090219' => 
      array (
        'id' => '090219',
        'name' => '高碑店',
      ),
      '090220' => 
      array (
        'id' => '090220',
        'name' => '涞水',
      ),
      '090221' => 
      array (
        'id' => '090221',
        'name' => '定兴',
      ),
      '090222' => 
      array (
        'id' => '090222',
        'name' => '清苑',
      ),
      '090223' => 
      array (
        'id' => '090223',
        'name' => '博野',
      ),
    ),
  ),
  '0903' => 
  array (
    'province' => 
    array (
      'id' => '09',
      'name' => '河北',
    ),
    'city' => 
    array (
      'id' => '0903',
      'name' => '张家口',
    ),
    'list' => 
    array (
      '090301' => 
      array (
        'id' => '090301',
        'name' => '张家口',
      ),
      '090302' => 
      array (
        'id' => '090302',
        'name' => '宣化',
      ),
      '090303' => 
      array (
        'id' => '090303',
        'name' => '张北',
      ),
      '090304' => 
      array (
        'id' => '090304',
        'name' => '康保',
      ),
      '090305' => 
      array (
        'id' => '090305',
        'name' => '沽源',
      ),
      '090306' => 
      array (
        'id' => '090306',
        'name' => '尚义',
      ),
      '090307' => 
      array (
        'id' => '090307',
        'name' => '蔚县',
      ),
      '090308' => 
      array (
        'id' => '090308',
        'name' => '阳原',
      ),
      '090309' => 
      array (
        'id' => '090309',
        'name' => '怀安',
      ),
      '090310' => 
      array (
        'id' => '090310',
        'name' => '万全',
      ),
      '090311' => 
      array (
        'id' => '090311',
        'name' => '怀来',
      ),
      '090312' => 
      array (
        'id' => '090312',
        'name' => '涿鹿',
      ),
      '090313' => 
      array (
        'id' => '090313',
        'name' => '赤城',
      ),
      '090314' => 
      array (
        'id' => '090314',
        'name' => '崇礼',
      ),
    ),
  ),
  '0904' => 
  array (
    'province' => 
    array (
      'id' => '09',
      'name' => '河北',
    ),
    'city' => 
    array (
      'id' => '0904',
      'name' => '承德',
    ),
    'list' => 
    array (
      '090401' => 
      array (
        'id' => '090401',
        'name' => '承德',
      ),
      '090402' => 
      array (
        'id' => '090402',
        'name' => '承德县',
      ),
      '090403' => 
      array (
        'id' => '090403',
        'name' => '兴隆',
      ),
      '090404' => 
      array (
        'id' => '090404',
        'name' => '平泉',
      ),
      '090405' => 
      array (
        'id' => '090405',
        'name' => '滦平',
      ),
      '090406' => 
      array (
        'id' => '090406',
        'name' => '隆化',
      ),
      '090407' => 
      array (
        'id' => '090407',
        'name' => '丰宁',
      ),
      '090408' => 
      array (
        'id' => '090408',
        'name' => '宽城',
      ),
      '090409' => 
      array (
        'id' => '090409',
        'name' => '围场',
      ),
    ),
  ),
  '0905' => 
  array (
    'province' => 
    array (
      'id' => '09',
      'name' => '河北',
    ),
    'city' => 
    array (
      'id' => '0905',
      'name' => '唐山',
    ),
    'list' => 
    array (
      '090501' => 
      array (
        'id' => '090501',
        'name' => '唐山',
      ),
      '090502' => 
      array (
        'id' => '090502',
        'name' => '丰南',
      ),
      '090503' => 
      array (
        'id' => '090503',
        'name' => '丰润',
      ),
      '090504' => 
      array (
        'id' => '090504',
        'name' => '滦县',
      ),
      '090505' => 
      array (
        'id' => '090505',
        'name' => '滦南',
      ),
      '090506' => 
      array (
        'id' => '090506',
        'name' => '乐亭',
      ),
      '090507' => 
      array (
        'id' => '090507',
        'name' => '迁西',
      ),
      '090508' => 
      array (
        'id' => '090508',
        'name' => '玉田',
      ),
      '090509' => 
      array (
        'id' => '090509',
        'name' => '唐海',
      ),
      '090510' => 
      array (
        'id' => '090510',
        'name' => '遵化',
      ),
      '090511' => 
      array (
        'id' => '090511',
        'name' => '迁安',
      ),
      '090512' => 
      array (
        'id' => '090512',
        'name' => '曹妃甸',
      ),
    ),
  ),
  '0906' => 
  array (
    'province' => 
    array (
      'id' => '09',
      'name' => '河北',
    ),
    'city' => 
    array (
      'id' => '0906',
      'name' => '廊坊',
    ),
    'list' => 
    array (
      '090601' => 
      array (
        'id' => '090601',
        'name' => '廊坊',
      ),
      '090602' => 
      array (
        'id' => '090602',
        'name' => '固安',
      ),
      '090603' => 
      array (
        'id' => '090603',
        'name' => '永清',
      ),
      '090604' => 
      array (
        'id' => '090604',
        'name' => '香河',
      ),
      '090605' => 
      array (
        'id' => '090605',
        'name' => '大城',
      ),
      '090606' => 
      array (
        'id' => '090606',
        'name' => '文安',
      ),
      '090607' => 
      array (
        'id' => '090607',
        'name' => '大厂',
      ),
      '090608' => 
      array (
        'id' => '090608',
        'name' => '霸州',
      ),
      '090609' => 
      array (
        'id' => '090609',
        'name' => '三河',
      ),
    ),
  ),
  '0907' => 
  array (
    'province' => 
    array (
      'id' => '09',
      'name' => '河北',
    ),
    'city' => 
    array (
      'id' => '0907',
      'name' => '沧州',
    ),
    'list' => 
    array (
      '090701' => 
      array (
        'id' => '090701',
        'name' => '沧州',
      ),
      '090702' => 
      array (
        'id' => '090702',
        'name' => '青县',
      ),
      '090703' => 
      array (
        'id' => '090703',
        'name' => '东光',
      ),
      '090704' => 
      array (
        'id' => '090704',
        'name' => '海兴',
      ),
      '090705' => 
      array (
        'id' => '090705',
        'name' => '盐山',
      ),
      '090706' => 
      array (
        'id' => '090706',
        'name' => '肃宁',
      ),
      '090707' => 
      array (
        'id' => '090707',
        'name' => '南皮',
      ),
      '090708' => 
      array (
        'id' => '090708',
        'name' => '吴桥',
      ),
      '090709' => 
      array (
        'id' => '090709',
        'name' => '献县',
      ),
      '090710' => 
      array (
        'id' => '090710',
        'name' => '孟村',
      ),
      '090711' => 
      array (
        'id' => '090711',
        'name' => '泊头',
      ),
      '090712' => 
      array (
        'id' => '090712',
        'name' => '任丘',
      ),
      '090713' => 
      array (
        'id' => '090713',
        'name' => '黄骅',
      ),
      '090714' => 
      array (
        'id' => '090714',
        'name' => '河间',
      ),
      '090715' => 
      array (
        'id' => '090715',
        'name' => '沧县',
      ),
    ),
  ),
  '0908' => 
  array (
    'province' => 
    array (
      'id' => '09',
      'name' => '河北',
    ),
    'city' => 
    array (
      'id' => '0908',
      'name' => '衡水',
    ),
    'list' => 
    array (
      '090801' => 
      array (
        'id' => '090801',
        'name' => '衡水',
      ),
      '090802' => 
      array (
        'id' => '090802',
        'name' => '枣强',
      ),
      '090803' => 
      array (
        'id' => '090803',
        'name' => '武邑',
      ),
      '090804' => 
      array (
        'id' => '090804',
        'name' => '武强',
      ),
      '090805' => 
      array (
        'id' => '090805',
        'name' => '饶阳',
      ),
      '090806' => 
      array (
        'id' => '090806',
        'name' => '安平',
      ),
      '090807' => 
      array (
        'id' => '090807',
        'name' => '故城',
      ),
      '090808' => 
      array (
        'id' => '090808',
        'name' => '景县',
      ),
      '090809' => 
      array (
        'id' => '090809',
        'name' => '阜城',
      ),
      '090810' => 
      array (
        'id' => '090810',
        'name' => '冀州',
      ),
      '090811' => 
      array (
        'id' => '090811',
        'name' => '深州',
      ),
    ),
  ),
  '0909' => 
  array (
    'province' => 
    array (
      'id' => '09',
      'name' => '河北',
    ),
    'city' => 
    array (
      'id' => '0909',
      'name' => '邢台',
    ),
    'list' => 
    array (
      '090901' => 
      array (
        'id' => '090901',
        'name' => '邢台',
      ),
      '090902' => 
      array (
        'id' => '090902',
        'name' => '临城',
      ),
      '090903' => 
      array (
        'id' => '090903',
        'name' => '内丘',
      ),
      '090904' => 
      array (
        'id' => '090904',
        'name' => '柏乡',
      ),
      '090905' => 
      array (
        'id' => '090905',
        'name' => '隆尧',
      ),
      '090906' => 
      array (
        'id' => '090906',
        'name' => '南和',
      ),
      '090907' => 
      array (
        'id' => '090907',
        'name' => '宁晋',
      ),
      '090908' => 
      array (
        'id' => '090908',
        'name' => '巨鹿',
      ),
      '090909' => 
      array (
        'id' => '090909',
        'name' => '新河',
      ),
      '090910' => 
      array (
        'id' => '090910',
        'name' => '广宗',
      ),
      '090911' => 
      array (
        'id' => '090911',
        'name' => '平乡',
      ),
      '090912' => 
      array (
        'id' => '090912',
        'name' => '威县',
      ),
      '090913' => 
      array (
        'id' => '090913',
        'name' => '清河',
      ),
      '090914' => 
      array (
        'id' => '090914',
        'name' => '临西',
      ),
      '090915' => 
      array (
        'id' => '090915',
        'name' => '南宫',
      ),
      '090916' => 
      array (
        'id' => '090916',
        'name' => '沙河',
      ),
      '090917' => 
      array (
        'id' => '090917',
        'name' => '任县',
      ),
    ),
  ),
  '0910' => 
  array (
    'province' => 
    array (
      'id' => '09',
      'name' => '河北',
    ),
    'city' => 
    array (
      'id' => '0910',
      'name' => '邯郸',
    ),
    'list' => 
    array (
      '091001' => 
      array (
        'id' => '091001',
        'name' => '邯郸',
      ),
      '091002' => 
      array (
        'id' => '091002',
        'name' => '峰峰',
      ),
      '091003' => 
      array (
        'id' => '091003',
        'name' => '临漳',
      ),
      '091004' => 
      array (
        'id' => '091004',
        'name' => '成安',
      ),
      '091005' => 
      array (
        'id' => '091005',
        'name' => '大名',
      ),
      '091006' => 
      array (
        'id' => '091006',
        'name' => '涉县',
      ),
      '091007' => 
      array (
        'id' => '091007',
        'name' => '磁县',
      ),
      '091008' => 
      array (
        'id' => '091008',
        'name' => '肥乡',
      ),
      '091009' => 
      array (
        'id' => '091009',
        'name' => '永年',
      ),
      '091010' => 
      array (
        'id' => '091010',
        'name' => '邱县',
      ),
      '091011' => 
      array (
        'id' => '091011',
        'name' => '鸡泽',
      ),
      '091012' => 
      array (
        'id' => '091012',
        'name' => '广平',
      ),
      '091013' => 
      array (
        'id' => '091013',
        'name' => '馆陶',
      ),
      '091014' => 
      array (
        'id' => '091014',
        'name' => '魏县',
      ),
      '091015' => 
      array (
        'id' => '091015',
        'name' => '曲周',
      ),
      '091016' => 
      array (
        'id' => '091016',
        'name' => '武安',
      ),
    ),
  ),
  '0911' => 
  array (
    'province' => 
    array (
      'id' => '09',
      'name' => '河北',
    ),
    'city' => 
    array (
      'id' => '0911',
      'name' => '秦皇岛',
    ),
    'list' => 
    array (
      '091101' => 
      array (
        'id' => '091101',
        'name' => '秦皇岛',
      ),
      '091102' => 
      array (
        'id' => '091102',
        'name' => '青龙',
      ),
      '091103' => 
      array (
        'id' => '091103',
        'name' => '昌黎',
      ),
      '091104' => 
      array (
        'id' => '091104',
        'name' => '抚宁',
      ),
      '091105' => 
      array (
        'id' => '091105',
        'name' => '卢龙',
      ),
      '091106' => 
      array (
        'id' => '091106',
        'name' => '北戴河',
      ),
    ),
  ),
  1001 => 
  array (
    'province' => 
    array (
      'id' => '10',
      'name' => '山西',
    ),
    'city' => 
    array (
      'id' => '1001',
      'name' => '太原',
    ),
    'list' => 
    array (
      100101 => 
      array (
        'id' => '100101',
        'name' => '太原',
      ),
      100102 => 
      array (
        'id' => '100102',
        'name' => '清徐',
      ),
      100103 => 
      array (
        'id' => '100103',
        'name' => '阳曲',
      ),
      100104 => 
      array (
        'id' => '100104',
        'name' => '娄烦',
      ),
      100105 => 
      array (
        'id' => '100105',
        'name' => '古交',
      ),
      100106 => 
      array (
        'id' => '100106',
        'name' => '尖草坪区',
      ),
      100107 => 
      array (
        'id' => '100107',
        'name' => '小店区',
      ),
    ),
  ),
  1002 => 
  array (
    'province' => 
    array (
      'id' => '10',
      'name' => '山西',
    ),
    'city' => 
    array (
      'id' => '1002',
      'name' => '大同',
    ),
    'list' => 
    array (
      100201 => 
      array (
        'id' => '100201',
        'name' => '大同',
      ),
      100202 => 
      array (
        'id' => '100202',
        'name' => '阳高',
      ),
      100203 => 
      array (
        'id' => '100203',
        'name' => '大同县',
      ),
      100204 => 
      array (
        'id' => '100204',
        'name' => '天镇',
      ),
      100205 => 
      array (
        'id' => '100205',
        'name' => '广灵',
      ),
      100206 => 
      array (
        'id' => '100206',
        'name' => '灵丘',
      ),
      100207 => 
      array (
        'id' => '100207',
        'name' => '浑源',
      ),
      100208 => 
      array (
        'id' => '100208',
        'name' => '左云',
      ),
    ),
  ),
  1003 => 
  array (
    'province' => 
    array (
      'id' => '10',
      'name' => '山西',
    ),
    'city' => 
    array (
      'id' => '1003',
      'name' => '阳泉',
    ),
    'list' => 
    array (
      100301 => 
      array (
        'id' => '100301',
        'name' => '阳泉',
      ),
      100302 => 
      array (
        'id' => '100302',
        'name' => '盂县',
      ),
      100303 => 
      array (
        'id' => '100303',
        'name' => '平定',
      ),
    ),
  ),
  1004 => 
  array (
    'province' => 
    array (
      'id' => '10',
      'name' => '山西',
    ),
    'city' => 
    array (
      'id' => '1004',
      'name' => '晋中',
    ),
    'list' => 
    array (
      100401 => 
      array (
        'id' => '100401',
        'name' => '晋中',
      ),
      100402 => 
      array (
        'id' => '100402',
        'name' => '榆次',
      ),
      100403 => 
      array (
        'id' => '100403',
        'name' => '榆社',
      ),
      100404 => 
      array (
        'id' => '100404',
        'name' => '左权',
      ),
      100405 => 
      array (
        'id' => '100405',
        'name' => '和顺',
      ),
      100406 => 
      array (
        'id' => '100406',
        'name' => '昔阳',
      ),
      100407 => 
      array (
        'id' => '100407',
        'name' => '寿阳',
      ),
      100408 => 
      array (
        'id' => '100408',
        'name' => '太谷',
      ),
      100409 => 
      array (
        'id' => '100409',
        'name' => '祁县',
      ),
      100410 => 
      array (
        'id' => '100410',
        'name' => '平遥',
      ),
      100411 => 
      array (
        'id' => '100411',
        'name' => '灵石',
      ),
      100412 => 
      array (
        'id' => '100412',
        'name' => '介休',
      ),
    ),
  ),
  1005 => 
  array (
    'province' => 
    array (
      'id' => '10',
      'name' => '山西',
    ),
    'city' => 
    array (
      'id' => '1005',
      'name' => '长治',
    ),
    'list' => 
    array (
      100501 => 
      array (
        'id' => '100501',
        'name' => '长治',
      ),
      100502 => 
      array (
        'id' => '100502',
        'name' => '黎城',
      ),
      100503 => 
      array (
        'id' => '100503',
        'name' => '屯留',
      ),
      100504 => 
      array (
        'id' => '100504',
        'name' => '潞城',
      ),
      100505 => 
      array (
        'id' => '100505',
        'name' => '襄垣',
      ),
      100506 => 
      array (
        'id' => '100506',
        'name' => '平顺',
      ),
      100507 => 
      array (
        'id' => '100507',
        'name' => '武乡',
      ),
      100508 => 
      array (
        'id' => '100508',
        'name' => '沁县',
      ),
      100509 => 
      array (
        'id' => '100509',
        'name' => '长子',
      ),
      100510 => 
      array (
        'id' => '100510',
        'name' => '沁源',
      ),
      100511 => 
      array (
        'id' => '100511',
        'name' => '壶关',
      ),
    ),
  ),
  1006 => 
  array (
    'province' => 
    array (
      'id' => '10',
      'name' => '山西',
    ),
    'city' => 
    array (
      'id' => '1006',
      'name' => '晋城',
    ),
    'list' => 
    array (
      100601 => 
      array (
        'id' => '100601',
        'name' => '晋城',
      ),
      100602 => 
      array (
        'id' => '100602',
        'name' => '沁水',
      ),
      100603 => 
      array (
        'id' => '100603',
        'name' => '阳城',
      ),
      100604 => 
      array (
        'id' => '100604',
        'name' => '陵川',
      ),
      100605 => 
      array (
        'id' => '100605',
        'name' => '高平',
      ),
      100606 => 
      array (
        'id' => '100606',
        'name' => '泽州',
      ),
    ),
  ),
  1007 => 
  array (
    'province' => 
    array (
      'id' => '10',
      'name' => '山西',
    ),
    'city' => 
    array (
      'id' => '1007',
      'name' => '临汾',
    ),
    'list' => 
    array (
      100701 => 
      array (
        'id' => '100701',
        'name' => '临汾',
      ),
      100702 => 
      array (
        'id' => '100702',
        'name' => '曲沃',
      ),
      100703 => 
      array (
        'id' => '100703',
        'name' => '永和',
      ),
      100704 => 
      array (
        'id' => '100704',
        'name' => '隰县',
      ),
      100705 => 
      array (
        'id' => '100705',
        'name' => '大宁',
      ),
      100706 => 
      array (
        'id' => '100706',
        'name' => '吉县',
      ),
      100707 => 
      array (
        'id' => '100707',
        'name' => '襄汾',
      ),
      100708 => 
      array (
        'id' => '100708',
        'name' => '蒲县',
      ),
      100709 => 
      array (
        'id' => '100709',
        'name' => '汾西',
      ),
      100710 => 
      array (
        'id' => '100710',
        'name' => '洪洞',
      ),
      100711 => 
      array (
        'id' => '100711',
        'name' => '霍州',
      ),
      100712 => 
      array (
        'id' => '100712',
        'name' => '乡宁',
      ),
      100713 => 
      array (
        'id' => '100713',
        'name' => '翼城',
      ),
      100714 => 
      array (
        'id' => '100714',
        'name' => '侯马',
      ),
      100715 => 
      array (
        'id' => '100715',
        'name' => '浮山',
      ),
      100716 => 
      array (
        'id' => '100716',
        'name' => '安泽',
      ),
      100717 => 
      array (
        'id' => '100717',
        'name' => '古县',
      ),
    ),
  ),
  1008 => 
  array (
    'province' => 
    array (
      'id' => '10',
      'name' => '山西',
    ),
    'city' => 
    array (
      'id' => '1008',
      'name' => '运城',
    ),
    'list' => 
    array (
      100801 => 
      array (
        'id' => '100801',
        'name' => '运城',
      ),
      100802 => 
      array (
        'id' => '100802',
        'name' => '临猗',
      ),
      100803 => 
      array (
        'id' => '100803',
        'name' => '稷山',
      ),
      100804 => 
      array (
        'id' => '100804',
        'name' => '万荣',
      ),
      100805 => 
      array (
        'id' => '100805',
        'name' => '河津',
      ),
      100806 => 
      array (
        'id' => '100806',
        'name' => '新绛',
      ),
      100807 => 
      array (
        'id' => '100807',
        'name' => '绛县',
      ),
      100808 => 
      array (
        'id' => '100808',
        'name' => '闻喜',
      ),
      100809 => 
      array (
        'id' => '100809',
        'name' => '垣曲',
      ),
      100810 => 
      array (
        'id' => '100810',
        'name' => '永济',
      ),
      100811 => 
      array (
        'id' => '100811',
        'name' => '芮城',
      ),
      100812 => 
      array (
        'id' => '100812',
        'name' => '夏县',
      ),
      100813 => 
      array (
        'id' => '100813',
        'name' => '平陆',
      ),
    ),
  ),
  1009 => 
  array (
    'province' => 
    array (
      'id' => '10',
      'name' => '山西',
    ),
    'city' => 
    array (
      'id' => '1009',
      'name' => '朔州',
    ),
    'list' => 
    array (
      100901 => 
      array (
        'id' => '100901',
        'name' => '朔州',
      ),
      100902 => 
      array (
        'id' => '100902',
        'name' => '平鲁',
      ),
      100903 => 
      array (
        'id' => '100903',
        'name' => '山阴',
      ),
      100904 => 
      array (
        'id' => '100904',
        'name' => '右玉',
      ),
      100905 => 
      array (
        'id' => '100905',
        'name' => '应县',
      ),
      100906 => 
      array (
        'id' => '100906',
        'name' => '怀仁',
      ),
    ),
  ),
  1010 => 
  array (
    'province' => 
    array (
      'id' => '10',
      'name' => '山西',
    ),
    'city' => 
    array (
      'id' => '1010',
      'name' => '忻州',
    ),
    'list' => 
    array (
      101001 => 
      array (
        'id' => '101001',
        'name' => '忻州',
      ),
      101002 => 
      array (
        'id' => '101002',
        'name' => '定襄',
      ),
      101003 => 
      array (
        'id' => '101003',
        'name' => '五台县',
      ),
      101004 => 
      array (
        'id' => '101004',
        'name' => '河曲',
      ),
      101005 => 
      array (
        'id' => '101005',
        'name' => '偏关',
      ),
      101006 => 
      array (
        'id' => '101006',
        'name' => '神池',
      ),
      101007 => 
      array (
        'id' => '101007',
        'name' => '宁武',
      ),
      101008 => 
      array (
        'id' => '101008',
        'name' => '代县',
      ),
      101009 => 
      array (
        'id' => '101009',
        'name' => '繁峙',
      ),
      101010 => 
      array (
        'id' => '101010',
        'name' => '五台山',
      ),
      101011 => 
      array (
        'id' => '101011',
        'name' => '保德',
      ),
      101012 => 
      array (
        'id' => '101012',
        'name' => '静乐',
      ),
      101013 => 
      array (
        'id' => '101013',
        'name' => '岢岚',
      ),
      101014 => 
      array (
        'id' => '101014',
        'name' => '五寨',
      ),
      101015 => 
      array (
        'id' => '101015',
        'name' => '原平',
      ),
    ),
  ),
  1011 => 
  array (
    'province' => 
    array (
      'id' => '10',
      'name' => '山西',
    ),
    'city' => 
    array (
      'id' => '1011',
      'name' => '吕梁',
    ),
    'list' => 
    array (
      101101 => 
      array (
        'id' => '101101',
        'name' => '吕梁',
      ),
      101102 => 
      array (
        'id' => '101102',
        'name' => '离石',
      ),
      101103 => 
      array (
        'id' => '101103',
        'name' => '临县',
      ),
      101104 => 
      array (
        'id' => '101104',
        'name' => '兴县',
      ),
      101105 => 
      array (
        'id' => '101105',
        'name' => '岚县',
      ),
      101106 => 
      array (
        'id' => '101106',
        'name' => '柳林',
      ),
      101107 => 
      array (
        'id' => '101107',
        'name' => '石楼',
      ),
      101108 => 
      array (
        'id' => '101108',
        'name' => '方山',
      ),
      101109 => 
      array (
        'id' => '101109',
        'name' => '交口',
      ),
      101110 => 
      array (
        'id' => '101110',
        'name' => '中阳',
      ),
      101111 => 
      array (
        'id' => '101111',
        'name' => '孝义',
      ),
      101112 => 
      array (
        'id' => '101112',
        'name' => '汾阳',
      ),
      101113 => 
      array (
        'id' => '101113',
        'name' => '文水',
      ),
      101114 => 
      array (
        'id' => '101114',
        'name' => '交城',
      ),
    ),
  ),
  1101 => 
  array (
    'province' => 
    array (
      'id' => '11',
      'name' => '陕西',
    ),
    'city' => 
    array (
      'id' => '1101',
      'name' => '西安',
    ),
    'list' => 
    array (
      110101 => 
      array (
        'id' => '110101',
        'name' => '西安',
      ),
      110102 => 
      array (
        'id' => '110102',
        'name' => '长安',
      ),
      110103 => 
      array (
        'id' => '110103',
        'name' => '临潼',
      ),
      110104 => 
      array (
        'id' => '110104',
        'name' => '蓝田',
      ),
      110105 => 
      array (
        'id' => '110105',
        'name' => '周至',
      ),
      110106 => 
      array (
        'id' => '110106',
        'name' => '户县',
      ),
      110107 => 
      array (
        'id' => '110107',
        'name' => '高陵',
      ),
    ),
  ),
  1102 => 
  array (
    'province' => 
    array (
      'id' => '11',
      'name' => '陕西',
    ),
    'city' => 
    array (
      'id' => '1102',
      'name' => '咸阳',
    ),
    'list' => 
    array (
      110201 => 
      array (
        'id' => '110201',
        'name' => '咸阳',
      ),
      110202 => 
      array (
        'id' => '110202',
        'name' => '三原',
      ),
      110203 => 
      array (
        'id' => '110203',
        'name' => '礼泉',
      ),
      110204 => 
      array (
        'id' => '110204',
        'name' => '永寿',
      ),
      110205 => 
      array (
        'id' => '110205',
        'name' => '淳化',
      ),
      110206 => 
      array (
        'id' => '110206',
        'name' => '泾阳',
      ),
      110207 => 
      array (
        'id' => '110207',
        'name' => '武功',
      ),
      110208 => 
      array (
        'id' => '110208',
        'name' => '乾县',
      ),
      110209 => 
      array (
        'id' => '110209',
        'name' => '彬县',
      ),
      110210 => 
      array (
        'id' => '110210',
        'name' => '长武',
      ),
      110211 => 
      array (
        'id' => '110211',
        'name' => '旬邑',
      ),
      110212 => 
      array (
        'id' => '110212',
        'name' => '兴平',
      ),
    ),
  ),
  1103 => 
  array (
    'province' => 
    array (
      'id' => '11',
      'name' => '陕西',
    ),
    'city' => 
    array (
      'id' => '1103',
      'name' => '延安',
    ),
    'list' => 
    array (
      110301 => 
      array (
        'id' => '110301',
        'name' => '延安',
      ),
      110302 => 
      array (
        'id' => '110302',
        'name' => '延长',
      ),
      110303 => 
      array (
        'id' => '110303',
        'name' => '延川',
      ),
      110304 => 
      array (
        'id' => '110304',
        'name' => '子长',
      ),
      110305 => 
      array (
        'id' => '110305',
        'name' => '宜川',
      ),
      110306 => 
      array (
        'id' => '110306',
        'name' => '富县',
      ),
      110307 => 
      array (
        'id' => '110307',
        'name' => '志丹',
      ),
      110308 => 
      array (
        'id' => '110308',
        'name' => '安塞',
      ),
      110309 => 
      array (
        'id' => '110309',
        'name' => '甘泉',
      ),
      110310 => 
      array (
        'id' => '110310',
        'name' => '洛川',
      ),
      110311 => 
      array (
        'id' => '110311',
        'name' => '黄陵',
      ),
      110312 => 
      array (
        'id' => '110312',
        'name' => '黄龙',
      ),
      110313 => 
      array (
        'id' => '110313',
        'name' => '吴起',
      ),
    ),
  ),
  1104 => 
  array (
    'province' => 
    array (
      'id' => '11',
      'name' => '陕西',
    ),
    'city' => 
    array (
      'id' => '1104',
      'name' => '榆林',
    ),
    'list' => 
    array (
      110401 => 
      array (
        'id' => '110401',
        'name' => '榆林',
      ),
      110402 => 
      array (
        'id' => '110402',
        'name' => '府谷',
      ),
      110403 => 
      array (
        'id' => '110403',
        'name' => '神木',
      ),
      110404 => 
      array (
        'id' => '110404',
        'name' => '佳县',
      ),
      110405 => 
      array (
        'id' => '110405',
        'name' => '定边',
      ),
      110406 => 
      array (
        'id' => '110406',
        'name' => '靖边',
      ),
      110407 => 
      array (
        'id' => '110407',
        'name' => '横山',
      ),
      110408 => 
      array (
        'id' => '110408',
        'name' => '米脂',
      ),
      110409 => 
      array (
        'id' => '110409',
        'name' => '子洲',
      ),
      110410 => 
      array (
        'id' => '110410',
        'name' => '绥德',
      ),
      110411 => 
      array (
        'id' => '110411',
        'name' => '吴堡',
      ),
      110412 => 
      array (
        'id' => '110412',
        'name' => '清涧',
      ),
      110413 => 
      array (
        'id' => '110413',
        'name' => '榆阳',
      ),
    ),
  ),
  1105 => 
  array (
    'province' => 
    array (
      'id' => '11',
      'name' => '陕西',
    ),
    'city' => 
    array (
      'id' => '1105',
      'name' => '渭南',
    ),
    'list' => 
    array (
      110501 => 
      array (
        'id' => '110501',
        'name' => '渭南',
      ),
      110502 => 
      array (
        'id' => '110502',
        'name' => '华县',
      ),
      110503 => 
      array (
        'id' => '110503',
        'name' => '潼关',
      ),
      110504 => 
      array (
        'id' => '110504',
        'name' => '大荔',
      ),
      110505 => 
      array (
        'id' => '110505',
        'name' => '白水',
      ),
      110506 => 
      array (
        'id' => '110506',
        'name' => '富平',
      ),
      110507 => 
      array (
        'id' => '110507',
        'name' => '蒲城',
      ),
      110508 => 
      array (
        'id' => '110508',
        'name' => '澄城',
      ),
      110509 => 
      array (
        'id' => '110509',
        'name' => '合阳',
      ),
      110510 => 
      array (
        'id' => '110510',
        'name' => '韩城',
      ),
      110511 => 
      array (
        'id' => '110511',
        'name' => '华阴',
      ),
    ),
  ),
  1106 => 
  array (
    'province' => 
    array (
      'id' => '11',
      'name' => '陕西',
    ),
    'city' => 
    array (
      'id' => '1106',
      'name' => '商洛',
    ),
    'list' => 
    array (
      110601 => 
      array (
        'id' => '110601',
        'name' => '商洛',
      ),
      110602 => 
      array (
        'id' => '110602',
        'name' => '洛南',
      ),
      110603 => 
      array (
        'id' => '110603',
        'name' => '柞水',
      ),
      110604 => 
      array (
        'id' => '110604',
        'name' => '商州',
      ),
      110605 => 
      array (
        'id' => '110605',
        'name' => '镇安',
      ),
      110606 => 
      array (
        'id' => '110606',
        'name' => '丹凤',
      ),
      110607 => 
      array (
        'id' => '110607',
        'name' => '商南',
      ),
      110608 => 
      array (
        'id' => '110608',
        'name' => '山阳',
      ),
    ),
  ),
  1107 => 
  array (
    'province' => 
    array (
      'id' => '11',
      'name' => '陕西',
    ),
    'city' => 
    array (
      'id' => '1107',
      'name' => '安康',
    ),
    'list' => 
    array (
      110701 => 
      array (
        'id' => '110701',
        'name' => '安康',
      ),
      110702 => 
      array (
        'id' => '110702',
        'name' => '紫阳',
      ),
      110703 => 
      array (
        'id' => '110703',
        'name' => '石泉',
      ),
      110704 => 
      array (
        'id' => '110704',
        'name' => '汉阴',
      ),
      110705 => 
      array (
        'id' => '110705',
        'name' => '旬阳',
      ),
      110706 => 
      array (
        'id' => '110706',
        'name' => '岚皋',
      ),
      110707 => 
      array (
        'id' => '110707',
        'name' => '平利',
      ),
      110708 => 
      array (
        'id' => '110708',
        'name' => '白河',
      ),
      110709 => 
      array (
        'id' => '110709',
        'name' => '镇坪',
      ),
      110710 => 
      array (
        'id' => '110710',
        'name' => '宁陕',
      ),
    ),
  ),
  1108 => 
  array (
    'province' => 
    array (
      'id' => '11',
      'name' => '陕西',
    ),
    'city' => 
    array (
      'id' => '1108',
      'name' => '汉中',
    ),
    'list' => 
    array (
      110801 => 
      array (
        'id' => '110801',
        'name' => '汉中',
      ),
      110802 => 
      array (
        'id' => '110802',
        'name' => '略阳',
      ),
      110803 => 
      array (
        'id' => '110803',
        'name' => '勉县',
      ),
      110804 => 
      array (
        'id' => '110804',
        'name' => '留坝',
      ),
      110805 => 
      array (
        'id' => '110805',
        'name' => '洋县',
      ),
      110806 => 
      array (
        'id' => '110806',
        'name' => '城固',
      ),
      110807 => 
      array (
        'id' => '110807',
        'name' => '西乡',
      ),
      110808 => 
      array (
        'id' => '110808',
        'name' => '佛坪',
      ),
      110809 => 
      array (
        'id' => '110809',
        'name' => '宁强',
      ),
      110810 => 
      array (
        'id' => '110810',
        'name' => '南郑',
      ),
      110811 => 
      array (
        'id' => '110811',
        'name' => '镇巴',
      ),
    ),
  ),
  1109 => 
  array (
    'province' => 
    array (
      'id' => '11',
      'name' => '陕西',
    ),
    'city' => 
    array (
      'id' => '1109',
      'name' => '宝鸡',
    ),
    'list' => 
    array (
      110901 => 
      array (
        'id' => '110901',
        'name' => '宝鸡',
      ),
      110902 => 
      array (
        'id' => '110902',
        'name' => '千阳',
      ),
      110903 => 
      array (
        'id' => '110903',
        'name' => '麟游',
      ),
      110904 => 
      array (
        'id' => '110904',
        'name' => '岐山',
      ),
      110905 => 
      array (
        'id' => '110905',
        'name' => '凤翔',
      ),
      110906 => 
      array (
        'id' => '110906',
        'name' => '扶风',
      ),
      110907 => 
      array (
        'id' => '110907',
        'name' => '眉县',
      ),
      110908 => 
      array (
        'id' => '110908',
        'name' => '太白',
      ),
      110909 => 
      array (
        'id' => '110909',
        'name' => '凤县',
      ),
      110910 => 
      array (
        'id' => '110910',
        'name' => '陇县',
      ),
      110911 => 
      array (
        'id' => '110911',
        'name' => '陈仓',
      ),
    ),
  ),
  1110 => 
  array (
    'province' => 
    array (
      'id' => '11',
      'name' => '陕西',
    ),
    'city' => 
    array (
      'id' => '1110',
      'name' => '铜川',
    ),
    'list' => 
    array (
      111001 => 
      array (
        'id' => '111001',
        'name' => '铜川',
      ),
      111002 => 
      array (
        'id' => '111002',
        'name' => '耀县',
      ),
      111003 => 
      array (
        'id' => '111003',
        'name' => '宜君',
      ),
      111004 => 
      array (
        'id' => '111004',
        'name' => '耀州',
      ),
    ),
  ),
  1111 => 
  array (
    'province' => 
    array (
      'id' => '11',
      'name' => '陕西',
    ),
    'city' => 
    array (
      'id' => '1111',
      'name' => '杨凌',
    ),
    'list' => 
    array (
      111101 => 
      array (
        'id' => '111101',
        'name' => '杨凌',
      ),
    ),
  ),
  1201 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1201',
      'name' => '济南',
    ),
    'list' => 
    array (
      120101 => 
      array (
        'id' => '120101',
        'name' => '济南',
      ),
      120102 => 
      array (
        'id' => '120102',
        'name' => '长清',
      ),
      120103 => 
      array (
        'id' => '120103',
        'name' => '商河',
      ),
      120104 => 
      array (
        'id' => '120104',
        'name' => '章丘',
      ),
      120105 => 
      array (
        'id' => '120105',
        'name' => '平阴',
      ),
      120106 => 
      array (
        'id' => '120106',
        'name' => '济阳',
      ),
    ),
  ),
  1202 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1202',
      'name' => '青岛',
    ),
    'list' => 
    array (
      120201 => 
      array (
        'id' => '120201',
        'name' => '青岛',
      ),
      120202 => 
      array (
        'id' => '120202',
        'name' => '崂山',
      ),
      120203 => 
      array (
        'id' => '120203',
        'name' => '即墨',
      ),
      120204 => 
      array (
        'id' => '120204',
        'name' => '胶州',
      ),
      120205 => 
      array (
        'id' => '120205',
        'name' => '胶南',
      ),
      120206 => 
      array (
        'id' => '120206',
        'name' => '莱西',
      ),
      120207 => 
      array (
        'id' => '120207',
        'name' => '平度',
      ),
    ),
  ),
  1203 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1203',
      'name' => '淄博',
    ),
    'list' => 
    array (
      120301 => 
      array (
        'id' => '120301',
        'name' => '淄博',
      ),
      120302 => 
      array (
        'id' => '120302',
        'name' => '淄川',
      ),
      120303 => 
      array (
        'id' => '120303',
        'name' => '博山',
      ),
      120304 => 
      array (
        'id' => '120304',
        'name' => '高青',
      ),
      120305 => 
      array (
        'id' => '120305',
        'name' => '周村',
      ),
      120306 => 
      array (
        'id' => '120306',
        'name' => '沂源',
      ),
      120307 => 
      array (
        'id' => '120307',
        'name' => '桓台',
      ),
      120308 => 
      array (
        'id' => '120308',
        'name' => '临淄',
      ),
    ),
  ),
  1204 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1204',
      'name' => '德州',
    ),
    'list' => 
    array (
      120401 => 
      array (
        'id' => '120401',
        'name' => '德州',
      ),
      120402 => 
      array (
        'id' => '120402',
        'name' => '武城',
      ),
      120403 => 
      array (
        'id' => '120403',
        'name' => '临邑',
      ),
      120404 => 
      array (
        'id' => '120404',
        'name' => '陵县',
      ),
      120405 => 
      array (
        'id' => '120405',
        'name' => '齐河',
      ),
      120406 => 
      array (
        'id' => '120406',
        'name' => '乐陵',
      ),
      120407 => 
      array (
        'id' => '120407',
        'name' => '庆云',
      ),
      120408 => 
      array (
        'id' => '120408',
        'name' => '平原',
      ),
      120409 => 
      array (
        'id' => '120409',
        'name' => '宁津',
      ),
      120410 => 
      array (
        'id' => '120410',
        'name' => '夏津',
      ),
      120411 => 
      array (
        'id' => '120411',
        'name' => '禹城',
      ),
    ),
  ),
  1205 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1205',
      'name' => '烟台',
    ),
    'list' => 
    array (
      120501 => 
      array (
        'id' => '120501',
        'name' => '烟台',
      ),
      120502 => 
      array (
        'id' => '120502',
        'name' => '莱州',
      ),
      120503 => 
      array (
        'id' => '120503',
        'name' => '长岛',
      ),
      120504 => 
      array (
        'id' => '120504',
        'name' => '蓬莱',
      ),
      120505 => 
      array (
        'id' => '120505',
        'name' => '龙口',
      ),
      120506 => 
      array (
        'id' => '120506',
        'name' => '招远',
      ),
      120507 => 
      array (
        'id' => '120507',
        'name' => '栖霞',
      ),
      120508 => 
      array (
        'id' => '120508',
        'name' => '福山',
      ),
      120509 => 
      array (
        'id' => '120509',
        'name' => '牟平',
      ),
      120510 => 
      array (
        'id' => '120510',
        'name' => '莱阳',
      ),
      120511 => 
      array (
        'id' => '120511',
        'name' => '海阳',
      ),
    ),
  ),
  1206 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1206',
      'name' => '潍坊',
    ),
    'list' => 
    array (
      120601 => 
      array (
        'id' => '120601',
        'name' => '潍坊',
      ),
      120602 => 
      array (
        'id' => '120602',
        'name' => '青州',
      ),
      120603 => 
      array (
        'id' => '120603',
        'name' => '寿光',
      ),
      120604 => 
      array (
        'id' => '120604',
        'name' => '临朐',
      ),
      120605 => 
      array (
        'id' => '120605',
        'name' => '昌乐',
      ),
      120606 => 
      array (
        'id' => '120606',
        'name' => '昌邑',
      ),
      120607 => 
      array (
        'id' => '120607',
        'name' => '安丘',
      ),
      120608 => 
      array (
        'id' => '120608',
        'name' => '高密',
      ),
      120609 => 
      array (
        'id' => '120609',
        'name' => '诸城',
      ),
    ),
  ),
  1207 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1207',
      'name' => '济宁',
    ),
    'list' => 
    array (
      120701 => 
      array (
        'id' => '120701',
        'name' => '济宁',
      ),
      120702 => 
      array (
        'id' => '120702',
        'name' => '嘉祥',
      ),
      120703 => 
      array (
        'id' => '120703',
        'name' => '微山',
      ),
      120704 => 
      array (
        'id' => '120704',
        'name' => '鱼台',
      ),
      120705 => 
      array (
        'id' => '120705',
        'name' => '兖州',
      ),
      120706 => 
      array (
        'id' => '120706',
        'name' => '金乡',
      ),
      120707 => 
      array (
        'id' => '120707',
        'name' => '汶上',
      ),
      120708 => 
      array (
        'id' => '120708',
        'name' => '泗水',
      ),
      120709 => 
      array (
        'id' => '120709',
        'name' => '梁山',
      ),
      120710 => 
      array (
        'id' => '120710',
        'name' => '曲阜',
      ),
      120711 => 
      array (
        'id' => '120711',
        'name' => '邹城',
      ),
    ),
  ),
  1208 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1208',
      'name' => '泰安',
    ),
    'list' => 
    array (
      120801 => 
      array (
        'id' => '120801',
        'name' => '泰安',
      ),
      120802 => 
      array (
        'id' => '120802',
        'name' => '新泰',
      ),
      120803 => 
      array (
        'id' => '120803',
        'name' => '肥城',
      ),
      120804 => 
      array (
        'id' => '120804',
        'name' => '东平',
      ),
      120805 => 
      array (
        'id' => '120805',
        'name' => '宁阳',
      ),
    ),
  ),
  1209 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1209',
      'name' => '临沂',
    ),
    'list' => 
    array (
      120901 => 
      array (
        'id' => '120901',
        'name' => '临沂',
      ),
      120902 => 
      array (
        'id' => '120902',
        'name' => '莒南',
      ),
      120903 => 
      array (
        'id' => '120903',
        'name' => '沂南',
      ),
      120904 => 
      array (
        'id' => '120904',
        'name' => '苍山',
      ),
      120905 => 
      array (
        'id' => '120905',
        'name' => '临沭',
      ),
      120906 => 
      array (
        'id' => '120906',
        'name' => '郯城',
      ),
      120907 => 
      array (
        'id' => '120907',
        'name' => '蒙阴',
      ),
      120908 => 
      array (
        'id' => '120908',
        'name' => '平邑',
      ),
      120909 => 
      array (
        'id' => '120909',
        'name' => '费县',
      ),
      120910 => 
      array (
        'id' => '120910',
        'name' => '沂水',
      ),
    ),
  ),
  1210 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1210',
      'name' => '菏泽',
    ),
    'list' => 
    array (
      121001 => 
      array (
        'id' => '121001',
        'name' => '菏泽',
      ),
      121002 => 
      array (
        'id' => '121002',
        'name' => '鄄城',
      ),
      121003 => 
      array (
        'id' => '121003',
        'name' => '郓城',
      ),
      121004 => 
      array (
        'id' => '121004',
        'name' => '东明',
      ),
      121005 => 
      array (
        'id' => '121005',
        'name' => '定陶',
      ),
      121006 => 
      array (
        'id' => '121006',
        'name' => '巨野',
      ),
      121007 => 
      array (
        'id' => '121007',
        'name' => '曹县',
      ),
      121008 => 
      array (
        'id' => '121008',
        'name' => '成武',
      ),
      121009 => 
      array (
        'id' => '121009',
        'name' => '单县',
      ),
    ),
  ),
  1211 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1211',
      'name' => '滨州',
    ),
    'list' => 
    array (
      121101 => 
      array (
        'id' => '121101',
        'name' => '滨州',
      ),
      121102 => 
      array (
        'id' => '121102',
        'name' => '博兴',
      ),
      121103 => 
      array (
        'id' => '121103',
        'name' => '无棣',
      ),
      121104 => 
      array (
        'id' => '121104',
        'name' => '阳信',
      ),
      121105 => 
      array (
        'id' => '121105',
        'name' => '惠民',
      ),
      121106 => 
      array (
        'id' => '121106',
        'name' => '沾化',
      ),
      121107 => 
      array (
        'id' => '121107',
        'name' => '邹平',
      ),
    ),
  ),
  1212 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1212',
      'name' => '东营',
    ),
    'list' => 
    array (
      121201 => 
      array (
        'id' => '121201',
        'name' => '东营',
      ),
      121202 => 
      array (
        'id' => '121202',
        'name' => '河口',
      ),
      121203 => 
      array (
        'id' => '121203',
        'name' => '垦利',
      ),
      121204 => 
      array (
        'id' => '121204',
        'name' => '利津',
      ),
      121205 => 
      array (
        'id' => '121205',
        'name' => '广饶',
      ),
    ),
  ),
  1213 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1213',
      'name' => '威海',
    ),
    'list' => 
    array (
      121301 => 
      array (
        'id' => '121301',
        'name' => '威海',
      ),
      121302 => 
      array (
        'id' => '121302',
        'name' => '文登',
      ),
      121303 => 
      array (
        'id' => '121303',
        'name' => '荣成',
      ),
      121304 => 
      array (
        'id' => '121304',
        'name' => '乳山',
      ),
      121305 => 
      array (
        'id' => '121305',
        'name' => '成山头',
      ),
      121306 => 
      array (
        'id' => '121306',
        'name' => '石岛',
      ),
    ),
  ),
  1214 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1214',
      'name' => '枣庄',
    ),
    'list' => 
    array (
      121401 => 
      array (
        'id' => '121401',
        'name' => '枣庄',
      ),
      121402 => 
      array (
        'id' => '121402',
        'name' => '薛城',
      ),
      121403 => 
      array (
        'id' => '121403',
        'name' => '峄城',
      ),
      121404 => 
      array (
        'id' => '121404',
        'name' => '台儿庄',
      ),
      121405 => 
      array (
        'id' => '121405',
        'name' => '滕州',
      ),
    ),
  ),
  1215 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1215',
      'name' => '日照',
    ),
    'list' => 
    array (
      121501 => 
      array (
        'id' => '121501',
        'name' => '日照',
      ),
      121502 => 
      array (
        'id' => '121502',
        'name' => '五莲',
      ),
      121503 => 
      array (
        'id' => '121503',
        'name' => '莒县',
      ),
    ),
  ),
  1216 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1216',
      'name' => '莱芜',
    ),
    'list' => 
    array (
      121601 => 
      array (
        'id' => '121601',
        'name' => '莱芜',
      ),
    ),
  ),
  1217 => 
  array (
    'province' => 
    array (
      'id' => '12',
      'name' => '山东',
    ),
    'city' => 
    array (
      'id' => '1217',
      'name' => '聊城',
    ),
    'list' => 
    array (
      121701 => 
      array (
        'id' => '121701',
        'name' => '聊城',
      ),
      121702 => 
      array (
        'id' => '121702',
        'name' => '冠县',
      ),
      121703 => 
      array (
        'id' => '121703',
        'name' => '阳谷',
      ),
      121704 => 
      array (
        'id' => '121704',
        'name' => '高唐',
      ),
      121705 => 
      array (
        'id' => '121705',
        'name' => '茌平',
      ),
      121706 => 
      array (
        'id' => '121706',
        'name' => '东阿',
      ),
      121707 => 
      array (
        'id' => '121707',
        'name' => '临清',
      ),
      121708 => 
      array (
        'id' => '121708',
        'name' => '莘县',
      ),
    ),
  ),
  1301 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1301',
      'name' => '乌鲁木齐',
    ),
    'list' => 
    array (
      130101 => 
      array (
        'id' => '130101',
        'name' => '乌鲁木齐',
      ),
      130102 => 
      array (
        'id' => '130102',
        'name' => '小渠子',
      ),
      130103 => 
      array (
        'id' => '130103',
        'name' => '达坂城',
      ),
      130104 => 
      array (
        'id' => '130104',
        'name' => '乌鲁木齐牧试站',
      ),
      130105 => 
      array (
        'id' => '130105',
        'name' => '天池',
      ),
      130106 => 
      array (
        'id' => '130106',
        'name' => '白杨沟',
      ),
    ),
  ),
  1302 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1302',
      'name' => '克拉玛依',
    ),
    'list' => 
    array (
      130201 => 
      array (
        'id' => '130201',
        'name' => '克拉玛依',
      ),
      130202 => 
      array (
        'id' => '130202',
        'name' => '乌尔禾',
      ),
      130203 => 
      array (
        'id' => '130203',
        'name' => '白碱滩',
      ),
    ),
  ),
  1303 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1303',
      'name' => '石河子',
    ),
    'list' => 
    array (
      130301 => 
      array (
        'id' => '130301',
        'name' => '石河子',
      ),
      130302 => 
      array (
        'id' => '130302',
        'name' => '炮台',
      ),
      130303 => 
      array (
        'id' => '130303',
        'name' => '莫索湾',
      ),
    ),
  ),
  1304 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1304',
      'name' => '昌吉',
    ),
    'list' => 
    array (
      130401 => 
      array (
        'id' => '130401',
        'name' => '昌吉',
      ),
      130402 => 
      array (
        'id' => '130402',
        'name' => '呼图壁',
      ),
      130403 => 
      array (
        'id' => '130403',
        'name' => '米泉',
      ),
      130404 => 
      array (
        'id' => '130404',
        'name' => '阜康',
      ),
      130405 => 
      array (
        'id' => '130405',
        'name' => '吉木萨尔',
      ),
      130406 => 
      array (
        'id' => '130406',
        'name' => '奇台',
      ),
      130407 => 
      array (
        'id' => '130407',
        'name' => '玛纳斯',
      ),
      130408 => 
      array (
        'id' => '130408',
        'name' => '木垒',
      ),
      130409 => 
      array (
        'id' => '130409',
        'name' => '蔡家湖',
      ),
    ),
  ),
  1305 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1305',
      'name' => '吐鲁番',
    ),
    'list' => 
    array (
      130501 => 
      array (
        'id' => '130501',
        'name' => '吐鲁番',
      ),
      130502 => 
      array (
        'id' => '130502',
        'name' => '托克逊',
      ),
      130503 => 
      array (
        'id' => '130503',
        'name' => '鄯善',
      ),
    ),
  ),
  1306 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1306',
      'name' => '巴音郭楞',
    ),
    'list' => 
    array (
      130601 => 
      array (
        'id' => '130601',
        'name' => '库尔勒',
      ),
      130602 => 
      array (
        'id' => '130602',
        'name' => '轮台',
      ),
      130603 => 
      array (
        'id' => '130603',
        'name' => '尉犁',
      ),
      130604 => 
      array (
        'id' => '130604',
        'name' => '若羌',
      ),
      130605 => 
      array (
        'id' => '130605',
        'name' => '且末',
      ),
      130606 => 
      array (
        'id' => '130606',
        'name' => '和静',
      ),
      130607 => 
      array (
        'id' => '130607',
        'name' => '焉耆',
      ),
      130608 => 
      array (
        'id' => '130608',
        'name' => '和硕',
      ),
      130609 => 
      array (
        'id' => '130609',
        'name' => '巴音布鲁克',
      ),
      130610 => 
      array (
        'id' => '130610',
        'name' => '铁干里克',
      ),
      130611 => 
      array (
        'id' => '130611',
        'name' => '博湖',
      ),
      130612 => 
      array (
        'id' => '130612',
        'name' => '塔中',
      ),
      130613 => 
      array (
        'id' => '130613',
        'name' => '巴仑台',
      ),
    ),
  ),
  1307 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1307',
      'name' => '阿拉尔',
    ),
    'list' => 
    array (
      130701 => 
      array (
        'id' => '130701',
        'name' => '阿拉尔',
      ),
    ),
  ),
  1308 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1308',
      'name' => '阿克苏',
    ),
    'list' => 
    array (
      130801 => 
      array (
        'id' => '130801',
        'name' => '阿克苏',
      ),
      130802 => 
      array (
        'id' => '130802',
        'name' => '乌什',
      ),
      130803 => 
      array (
        'id' => '130803',
        'name' => '温宿',
      ),
      130804 => 
      array (
        'id' => '130804',
        'name' => '拜城',
      ),
      130805 => 
      array (
        'id' => '130805',
        'name' => '新和',
      ),
      130806 => 
      array (
        'id' => '130806',
        'name' => '沙雅',
      ),
      130807 => 
      array (
        'id' => '130807',
        'name' => '库车',
      ),
      130808 => 
      array (
        'id' => '130808',
        'name' => '柯坪',
      ),
      130809 => 
      array (
        'id' => '130809',
        'name' => '阿瓦提',
      ),
    ),
  ),
  1309 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1309',
      'name' => '喀什',
    ),
    'list' => 
    array (
      130901 => 
      array (
        'id' => '130901',
        'name' => '喀什',
      ),
      130902 => 
      array (
        'id' => '130902',
        'name' => '英吉沙',
      ),
      130903 => 
      array (
        'id' => '130903',
        'name' => '塔什库尔干',
      ),
      130904 => 
      array (
        'id' => '130904',
        'name' => '麦盖提',
      ),
      130905 => 
      array (
        'id' => '130905',
        'name' => '莎车',
      ),
      130906 => 
      array (
        'id' => '130906',
        'name' => '叶城',
      ),
      130907 => 
      array (
        'id' => '130907',
        'name' => '泽普',
      ),
      130908 => 
      array (
        'id' => '130908',
        'name' => '巴楚',
      ),
      130909 => 
      array (
        'id' => '130909',
        'name' => '岳普湖',
      ),
      130910 => 
      array (
        'id' => '130910',
        'name' => '伽师',
      ),
      130911 => 
      array (
        'id' => '130911',
        'name' => '疏附',
      ),
      130912 => 
      array (
        'id' => '130912',
        'name' => '疏勒',
      ),
    ),
  ),
  1310 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1310',
      'name' => '伊犁',
    ),
    'list' => 
    array (
      131001 => 
      array (
        'id' => '131001',
        'name' => '伊宁',
      ),
      131002 => 
      array (
        'id' => '131002',
        'name' => '察布查尔',
      ),
      131003 => 
      array (
        'id' => '131003',
        'name' => '尼勒克',
      ),
      131004 => 
      array (
        'id' => '131004',
        'name' => '伊宁县',
      ),
      131005 => 
      array (
        'id' => '131005',
        'name' => '巩留',
      ),
      131006 => 
      array (
        'id' => '131006',
        'name' => '新源',
      ),
      131007 => 
      array (
        'id' => '131007',
        'name' => '昭苏',
      ),
      131008 => 
      array (
        'id' => '131008',
        'name' => '特克斯',
      ),
      131009 => 
      array (
        'id' => '131009',
        'name' => '霍城',
      ),
      131010 => 
      array (
        'id' => '131010',
        'name' => '霍尔果斯',
      ),
      131011 => 
      array (
        'id' => '131011',
        'name' => '奎屯',
      ),
    ),
  ),
  1311 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1311',
      'name' => '塔城',
    ),
    'list' => 
    array (
      131101 => 
      array (
        'id' => '131101',
        'name' => '塔城',
      ),
      131102 => 
      array (
        'id' => '131102',
        'name' => '裕民',
      ),
      131103 => 
      array (
        'id' => '131103',
        'name' => '额敏',
      ),
      131104 => 
      array (
        'id' => '131104',
        'name' => '和布克赛尔',
      ),
      131105 => 
      array (
        'id' => '131105',
        'name' => '托里',
      ),
      131106 => 
      array (
        'id' => '131106',
        'name' => '乌苏',
      ),
      131107 => 
      array (
        'id' => '131107',
        'name' => '沙湾',
      ),
    ),
  ),
  1312 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1312',
      'name' => '哈密',
    ),
    'list' => 
    array (
      131201 => 
      array (
        'id' => '131201',
        'name' => '哈密',
      ),
      131202 => 
      array (
        'id' => '131202',
        'name' => '巴里坤',
      ),
      131203 => 
      array (
        'id' => '131203',
        'name' => '伊吾',
      ),
    ),
  ),
  1313 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1313',
      'name' => '和田',
    ),
    'list' => 
    array (
      131301 => 
      array (
        'id' => '131301',
        'name' => '和田',
      ),
      131302 => 
      array (
        'id' => '131302',
        'name' => '皮山',
      ),
      131303 => 
      array (
        'id' => '131303',
        'name' => '策勒',
      ),
      131304 => 
      array (
        'id' => '131304',
        'name' => '墨玉',
      ),
      131305 => 
      array (
        'id' => '131305',
        'name' => '洛浦',
      ),
      131306 => 
      array (
        'id' => '131306',
        'name' => '民丰',
      ),
      131307 => 
      array (
        'id' => '131307',
        'name' => '于田',
      ),
    ),
  ),
  1314 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1314',
      'name' => '阿勒泰',
    ),
    'list' => 
    array (
      131401 => 
      array (
        'id' => '131401',
        'name' => '阿勒泰',
      ),
      131402 => 
      array (
        'id' => '131402',
        'name' => '哈巴河',
      ),
      131403 => 
      array (
        'id' => '131403',
        'name' => '吉木乃',
      ),
      131404 => 
      array (
        'id' => '131404',
        'name' => '布尔津',
      ),
      131405 => 
      array (
        'id' => '131405',
        'name' => '福海',
      ),
      131406 => 
      array (
        'id' => '131406',
        'name' => '富蕴',
      ),
      131407 => 
      array (
        'id' => '131407',
        'name' => '青河',
      ),
    ),
  ),
  1315 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1315',
      'name' => '克州',
    ),
    'list' => 
    array (
      131501 => 
      array (
        'id' => '131501',
        'name' => '阿图什',
      ),
      131502 => 
      array (
        'id' => '131502',
        'name' => '乌恰',
      ),
      131503 => 
      array (
        'id' => '131503',
        'name' => '阿克陶',
      ),
      131504 => 
      array (
        'id' => '131504',
        'name' => '阿合奇',
      ),
    ),
  ),
  1316 => 
  array (
    'province' => 
    array (
      'id' => '13',
      'name' => '新疆',
    ),
    'city' => 
    array (
      'id' => '1316',
      'name' => '博尔塔拉',
    ),
    'list' => 
    array (
      131601 => 
      array (
        'id' => '131601',
        'name' => '博乐',
      ),
      131602 => 
      array (
        'id' => '131602',
        'name' => '温泉',
      ),
      131603 => 
      array (
        'id' => '131603',
        'name' => '精河',
      ),
      131604 => 
      array (
        'id' => '131604',
        'name' => '阿拉山口',
      ),
    ),
  ),
  1401 => 
  array (
    'province' => 
    array (
      'id' => '14',
      'name' => '西藏',
    ),
    'city' => 
    array (
      'id' => '1401',
      'name' => '拉萨',
    ),
    'list' => 
    array (
      140101 => 
      array (
        'id' => '140101',
        'name' => '拉萨',
      ),
      140102 => 
      array (
        'id' => '140102',
        'name' => '当雄',
      ),
      140103 => 
      array (
        'id' => '140103',
        'name' => '尼木',
      ),
      140104 => 
      array (
        'id' => '140104',
        'name' => '林周',
      ),
      140105 => 
      array (
        'id' => '140105',
        'name' => '堆龙德庆',
      ),
      140106 => 
      array (
        'id' => '140106',
        'name' => '曲水',
      ),
      140107 => 
      array (
        'id' => '140107',
        'name' => '达孜',
      ),
      140108 => 
      array (
        'id' => '140108',
        'name' => '墨竹工卡',
      ),
    ),
  ),
  1402 => 
  array (
    'province' => 
    array (
      'id' => '14',
      'name' => '西藏',
    ),
    'city' => 
    array (
      'id' => '1402',
      'name' => '日喀则',
    ),
    'list' => 
    array (
      140201 => 
      array (
        'id' => '140201',
        'name' => '日喀则',
      ),
      140202 => 
      array (
        'id' => '140202',
        'name' => '拉孜',
      ),
      140203 => 
      array (
        'id' => '140203',
        'name' => '南木林',
      ),
      140204 => 
      array (
        'id' => '140204',
        'name' => '聂拉木',
      ),
      140205 => 
      array (
        'id' => '140205',
        'name' => '定日',
      ),
      140206 => 
      array (
        'id' => '140206',
        'name' => '江孜',
      ),
      140207 => 
      array (
        'id' => '140207',
        'name' => '帕里',
      ),
      140208 => 
      array (
        'id' => '140208',
        'name' => '仲巴',
      ),
      140209 => 
      array (
        'id' => '140209',
        'name' => '萨嘎',
      ),
      140210 => 
      array (
        'id' => '140210',
        'name' => '吉隆',
      ),
      140211 => 
      array (
        'id' => '140211',
        'name' => '昂仁',
      ),
      140212 => 
      array (
        'id' => '140212',
        'name' => '定结',
      ),
      140213 => 
      array (
        'id' => '140213',
        'name' => '萨迦',
      ),
      140214 => 
      array (
        'id' => '140214',
        'name' => '谢通门',
      ),
      140215 => 
      array (
        'id' => '140215',
        'name' => '岗巴',
      ),
      140216 => 
      array (
        'id' => '140216',
        'name' => '白朗',
      ),
      140217 => 
      array (
        'id' => '140217',
        'name' => '亚东',
      ),
      140218 => 
      array (
        'id' => '140218',
        'name' => '康马',
      ),
      140219 => 
      array (
        'id' => '140219',
        'name' => '仁布',
      ),
    ),
  ),
  1403 => 
  array (
    'province' => 
    array (
      'id' => '14',
      'name' => '西藏',
    ),
    'city' => 
    array (
      'id' => '1403',
      'name' => '山南',
    ),
    'list' => 
    array (
      140301 => 
      array (
        'id' => '140301',
        'name' => '山南',
      ),
      140302 => 
      array (
        'id' => '140302',
        'name' => '贡嘎',
      ),
      140303 => 
      array (
        'id' => '140303',
        'name' => '扎囊',
      ),
      140304 => 
      array (
        'id' => '140304',
        'name' => '加查',
      ),
      140305 => 
      array (
        'id' => '140305',
        'name' => '浪卡子',
      ),
      140306 => 
      array (
        'id' => '140306',
        'name' => '错那',
      ),
      140307 => 
      array (
        'id' => '140307',
        'name' => '隆子',
      ),
      140308 => 
      array (
        'id' => '140308',
        'name' => '泽当',
      ),
      140309 => 
      array (
        'id' => '140309',
        'name' => '乃东',
      ),
      140310 => 
      array (
        'id' => '140310',
        'name' => '桑日',
      ),
      140311 => 
      array (
        'id' => '140311',
        'name' => '洛扎',
      ),
      140312 => 
      array (
        'id' => '140312',
        'name' => '措美',
      ),
      140313 => 
      array (
        'id' => '140313',
        'name' => '琼结',
      ),
      140314 => 
      array (
        'id' => '140314',
        'name' => '曲松',
      ),
    ),
  ),
  1404 => 
  array (
    'province' => 
    array (
      'id' => '14',
      'name' => '西藏',
    ),
    'city' => 
    array (
      'id' => '1404',
      'name' => '林芝',
    ),
    'list' => 
    array (
      140401 => 
      array (
        'id' => '140401',
        'name' => '林芝',
      ),
      140402 => 
      array (
        'id' => '140402',
        'name' => '波密',
      ),
      140403 => 
      array (
        'id' => '140403',
        'name' => '米林',
      ),
      140404 => 
      array (
        'id' => '140404',
        'name' => '察隅',
      ),
      140405 => 
      array (
        'id' => '140405',
        'name' => '工布江达',
      ),
      140406 => 
      array (
        'id' => '140406',
        'name' => '朗县',
      ),
      140407 => 
      array (
        'id' => '140407',
        'name' => '墨脱',
      ),
    ),
  ),
  1405 => 
  array (
    'province' => 
    array (
      'id' => '14',
      'name' => '西藏',
    ),
    'city' => 
    array (
      'id' => '1405',
      'name' => '昌都',
    ),
    'list' => 
    array (
      140501 => 
      array (
        'id' => '140501',
        'name' => '昌都',
      ),
      140502 => 
      array (
        'id' => '140502',
        'name' => '丁青',
      ),
      140503 => 
      array (
        'id' => '140503',
        'name' => '边坝',
      ),
      140504 => 
      array (
        'id' => '140504',
        'name' => '洛隆',
      ),
      140505 => 
      array (
        'id' => '140505',
        'name' => '左贡',
      ),
      140506 => 
      array (
        'id' => '140506',
        'name' => '芒康',
      ),
      140507 => 
      array (
        'id' => '140507',
        'name' => '类乌齐',
      ),
      140508 => 
      array (
        'id' => '140508',
        'name' => '八宿',
      ),
      140509 => 
      array (
        'id' => '140509',
        'name' => '江达',
      ),
      140510 => 
      array (
        'id' => '140510',
        'name' => '察雅',
      ),
      140511 => 
      array (
        'id' => '140511',
        'name' => '贡觉',
      ),
    ),
  ),
  1406 => 
  array (
    'province' => 
    array (
      'id' => '14',
      'name' => '西藏',
    ),
    'city' => 
    array (
      'id' => '1406',
      'name' => '那曲',
    ),
    'list' => 
    array (
      140601 => 
      array (
        'id' => '140601',
        'name' => '那曲',
      ),
      140602 => 
      array (
        'id' => '140602',
        'name' => '尼玛',
      ),
      140603 => 
      array (
        'id' => '140603',
        'name' => '嘉黎',
      ),
      140604 => 
      array (
        'id' => '140604',
        'name' => '班戈',
      ),
      140605 => 
      array (
        'id' => '140605',
        'name' => '安多',
      ),
      140606 => 
      array (
        'id' => '140606',
        'name' => '索县',
      ),
      140607 => 
      array (
        'id' => '140607',
        'name' => '聂荣',
      ),
      140608 => 
      array (
        'id' => '140608',
        'name' => '巴青',
      ),
      140609 => 
      array (
        'id' => '140609',
        'name' => '比如',
      ),
      140610 => 
      array (
        'id' => '140610',
        'name' => '双湖',
      ),
    ),
  ),
  1407 => 
  array (
    'province' => 
    array (
      'id' => '14',
      'name' => '西藏',
    ),
    'city' => 
    array (
      'id' => '1407',
      'name' => '阿里',
    ),
    'list' => 
    array (
      140701 => 
      array (
        'id' => '140701',
        'name' => '阿里',
      ),
      140702 => 
      array (
        'id' => '140702',
        'name' => '改则',
      ),
      140703 => 
      array (
        'id' => '140703',
        'name' => '申扎',
      ),
      140704 => 
      array (
        'id' => '140704',
        'name' => '狮泉河',
      ),
      140705 => 
      array (
        'id' => '140705',
        'name' => '普兰',
      ),
      140706 => 
      array (
        'id' => '140706',
        'name' => '札达',
      ),
      140707 => 
      array (
        'id' => '140707',
        'name' => '噶尔',
      ),
      140708 => 
      array (
        'id' => '140708',
        'name' => '日土',
      ),
      140709 => 
      array (
        'id' => '140709',
        'name' => '革吉',
      ),
      140710 => 
      array (
        'id' => '140710',
        'name' => '措勤',
      ),
    ),
  ),
  1501 => 
  array (
    'province' => 
    array (
      'id' => '15',
      'name' => '青海',
    ),
    'city' => 
    array (
      'id' => '1501',
      'name' => '西宁',
    ),
    'list' => 
    array (
      150101 => 
      array (
        'id' => '150101',
        'name' => '西宁',
      ),
      150102 => 
      array (
        'id' => '150102',
        'name' => '大通',
      ),
      150103 => 
      array (
        'id' => '150103',
        'name' => '湟源',
      ),
      150104 => 
      array (
        'id' => '150104',
        'name' => '湟中',
      ),
    ),
  ),
  1502 => 
  array (
    'province' => 
    array (
      'id' => '15',
      'name' => '青海',
    ),
    'city' => 
    array (
      'id' => '1502',
      'name' => '海东',
    ),
    'list' => 
    array (
      150201 => 
      array (
        'id' => '150201',
        'name' => '海东',
      ),
      150202 => 
      array (
        'id' => '150202',
        'name' => '乐都',
      ),
      150203 => 
      array (
        'id' => '150203',
        'name' => '民和',
      ),
      150204 => 
      array (
        'id' => '150204',
        'name' => '互助',
      ),
      150205 => 
      array (
        'id' => '150205',
        'name' => '化隆',
      ),
      150206 => 
      array (
        'id' => '150206',
        'name' => '循化',
      ),
      150207 => 
      array (
        'id' => '150207',
        'name' => '冷湖',
      ),
      150208 => 
      array (
        'id' => '150208',
        'name' => '平安',
      ),
    ),
  ),
  1503 => 
  array (
    'province' => 
    array (
      'id' => '15',
      'name' => '青海',
    ),
    'city' => 
    array (
      'id' => '1503',
      'name' => '黄南',
    ),
    'list' => 
    array (
      150301 => 
      array (
        'id' => '150301',
        'name' => '黄南',
      ),
      150302 => 
      array (
        'id' => '150302',
        'name' => '尖扎',
      ),
      150303 => 
      array (
        'id' => '150303',
        'name' => '泽库',
      ),
      150304 => 
      array (
        'id' => '150304',
        'name' => '河南',
      ),
      150305 => 
      array (
        'id' => '150305',
        'name' => '同仁',
      ),
    ),
  ),
  1504 => 
  array (
    'province' => 
    array (
      'id' => '15',
      'name' => '青海',
    ),
    'city' => 
    array (
      'id' => '1504',
      'name' => '海南',
    ),
    'list' => 
    array (
      150401 => 
      array (
        'id' => '150401',
        'name' => '海南',
      ),
      150402 => 
      array (
        'id' => '150402',
        'name' => '贵德',
      ),
      150403 => 
      array (
        'id' => '150403',
        'name' => '兴海',
      ),
      150404 => 
      array (
        'id' => '150404',
        'name' => '贵南',
      ),
      150405 => 
      array (
        'id' => '150405',
        'name' => '同德',
      ),
      150406 => 
      array (
        'id' => '150406',
        'name' => '共和',
      ),
    ),
  ),
  1505 => 
  array (
    'province' => 
    array (
      'id' => '15',
      'name' => '青海',
    ),
    'city' => 
    array (
      'id' => '1505',
      'name' => '果洛',
    ),
    'list' => 
    array (
      150501 => 
      array (
        'id' => '150501',
        'name' => '果洛',
      ),
      150502 => 
      array (
        'id' => '150502',
        'name' => '班玛',
      ),
      150503 => 
      array (
        'id' => '150503',
        'name' => '甘德',
      ),
      150504 => 
      array (
        'id' => '150504',
        'name' => '达日',
      ),
      150505 => 
      array (
        'id' => '150505',
        'name' => '久治',
      ),
      150506 => 
      array (
        'id' => '150506',
        'name' => '玛多',
      ),
      150507 => 
      array (
        'id' => '150507',
        'name' => '多县',
      ),
      150508 => 
      array (
        'id' => '150508',
        'name' => '玛沁',
      ),
    ),
  ),
  1506 => 
  array (
    'province' => 
    array (
      'id' => '15',
      'name' => '青海',
    ),
    'city' => 
    array (
      'id' => '1506',
      'name' => '玉树',
    ),
    'list' => 
    array (
      150601 => 
      array (
        'id' => '150601',
        'name' => '玉树',
      ),
      150602 => 
      array (
        'id' => '150602',
        'name' => '称多',
      ),
      150603 => 
      array (
        'id' => '150603',
        'name' => '治多',
      ),
      150604 => 
      array (
        'id' => '150604',
        'name' => '杂多',
      ),
      150605 => 
      array (
        'id' => '150605',
        'name' => '囊谦',
      ),
      150606 => 
      array (
        'id' => '150606',
        'name' => '曲麻莱',
      ),
    ),
  ),
  1507 => 
  array (
    'province' => 
    array (
      'id' => '15',
      'name' => '青海',
    ),
    'city' => 
    array (
      'id' => '1507',
      'name' => '海西',
    ),
    'list' => 
    array (
      150701 => 
      array (
        'id' => '150701',
        'name' => '海西',
      ),
      150702 => 
      array (
        'id' => '150702',
        'name' => '天峻',
      ),
      150703 => 
      array (
        'id' => '150703',
        'name' => '乌兰',
      ),
      150704 => 
      array (
        'id' => '150704',
        'name' => '茫崖',
      ),
      150705 => 
      array (
        'id' => '150705',
        'name' => '大柴旦',
      ),
      150706 => 
      array (
        'id' => '150706',
        'name' => '德令哈',
      ),
    ),
  ),
  1508 => 
  array (
    'province' => 
    array (
      'id' => '15',
      'name' => '青海',
    ),
    'city' => 
    array (
      'id' => '1508',
      'name' => '海北',
    ),
    'list' => 
    array (
      150801 => 
      array (
        'id' => '150801',
        'name' => '海北',
      ),
      150802 => 
      array (
        'id' => '150802',
        'name' => '门源',
      ),
      150803 => 
      array (
        'id' => '150803',
        'name' => '祁连',
      ),
      150804 => 
      array (
        'id' => '150804',
        'name' => '海晏',
      ),
      150805 => 
      array (
        'id' => '150805',
        'name' => '刚察',
      ),
    ),
  ),
  1509 => 
  array (
    'province' => 
    array (
      'id' => '15',
      'name' => '青海',
    ),
    'city' => 
    array (
      'id' => '1509',
      'name' => '格尔木',
    ),
    'list' => 
    array (
      150901 => 
      array (
        'id' => '150901',
        'name' => '格尔木',
      ),
      150902 => 
      array (
        'id' => '150902',
        'name' => '都兰',
      ),
    ),
  ),
  1601 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'city' => 
    array (
      'id' => '1601',
      'name' => '兰州',
    ),
    'list' => 
    array (
      160101 => 
      array (
        'id' => '160101',
        'name' => '兰州',
      ),
      160102 => 
      array (
        'id' => '160102',
        'name' => '皋兰',
      ),
      160103 => 
      array (
        'id' => '160103',
        'name' => '永登',
      ),
      160104 => 
      array (
        'id' => '160104',
        'name' => '榆中',
      ),
    ),
  ),
  1602 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'city' => 
    array (
      'id' => '1602',
      'name' => '定西',
    ),
    'list' => 
    array (
      160201 => 
      array (
        'id' => '160201',
        'name' => '定西',
      ),
      160202 => 
      array (
        'id' => '160202',
        'name' => '通渭',
      ),
      160203 => 
      array (
        'id' => '160203',
        'name' => '陇西',
      ),
      160204 => 
      array (
        'id' => '160204',
        'name' => '渭源',
      ),
      160205 => 
      array (
        'id' => '160205',
        'name' => '临洮',
      ),
      160206 => 
      array (
        'id' => '160206',
        'name' => '漳县',
      ),
      160207 => 
      array (
        'id' => '160207',
        'name' => '岷县',
      ),
      160208 => 
      array (
        'id' => '160208',
        'name' => '安定',
      ),
    ),
  ),
  1603 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'city' => 
    array (
      'id' => '1603',
      'name' => '平凉',
    ),
    'list' => 
    array (
      160301 => 
      array (
        'id' => '160301',
        'name' => '平凉',
      ),
      160302 => 
      array (
        'id' => '160302',
        'name' => '泾川',
      ),
      160303 => 
      array (
        'id' => '160303',
        'name' => '灵台',
      ),
      160304 => 
      array (
        'id' => '160304',
        'name' => '崇信',
      ),
      160305 => 
      array (
        'id' => '160305',
        'name' => '华亭',
      ),
      160306 => 
      array (
        'id' => '160306',
        'name' => '庄浪',
      ),
      160307 => 
      array (
        'id' => '160307',
        'name' => '静宁',
      ),
      160308 => 
      array (
        'id' => '160308',
        'name' => '崆峒',
      ),
    ),
  ),
  1604 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'city' => 
    array (
      'id' => '1604',
      'name' => '庆阳',
    ),
    'list' => 
    array (
      160401 => 
      array (
        'id' => '160401',
        'name' => '西峰',
      ),
      160402 => 
      array (
        'id' => '160402',
        'name' => '环县',
      ),
      160403 => 
      array (
        'id' => '160403',
        'name' => '华池',
      ),
      160404 => 
      array (
        'id' => '160404',
        'name' => '合水',
      ),
      160405 => 
      array (
        'id' => '160405',
        'name' => '正宁',
      ),
      160406 => 
      array (
        'id' => '160406',
        'name' => '宁县',
      ),
      160407 => 
      array (
        'id' => '160407',
        'name' => '镇原',
      ),
      160408 => 
      array (
        'id' => '160408',
        'name' => '庆城',
      ),
    ),
  ),
  1605 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'city' => 
    array (
      'id' => '1605',
      'name' => '武威',
    ),
    'list' => 
    array (
      160501 => 
      array (
        'id' => '160501',
        'name' => '武威',
      ),
      160502 => 
      array (
        'id' => '160502',
        'name' => '民勤',
      ),
      160503 => 
      array (
        'id' => '160503',
        'name' => '古浪',
      ),
      160504 => 
      array (
        'id' => '160504',
        'name' => '天祝',
      ),
    ),
  ),
  1606 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'city' => 
    array (
      'id' => '1606',
      'name' => '金昌',
    ),
    'list' => 
    array (
      160601 => 
      array (
        'id' => '160601',
        'name' => '金昌',
      ),
      160602 => 
      array (
        'id' => '160602',
        'name' => '永昌',
      ),
    ),
  ),
  1607 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'city' => 
    array (
      'id' => '1607',
      'name' => '张掖',
    ),
    'list' => 
    array (
      160701 => 
      array (
        'id' => '160701',
        'name' => '张掖',
      ),
      160702 => 
      array (
        'id' => '160702',
        'name' => '肃南',
      ),
      160703 => 
      array (
        'id' => '160703',
        'name' => '民乐',
      ),
      160704 => 
      array (
        'id' => '160704',
        'name' => '临泽',
      ),
      160705 => 
      array (
        'id' => '160705',
        'name' => '高台',
      ),
      160706 => 
      array (
        'id' => '160706',
        'name' => '山丹',
      ),
    ),
  ),
  1608 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'city' => 
    array (
      'id' => '1608',
      'name' => '酒泉',
    ),
    'list' => 
    array (
      160801 => 
      array (
        'id' => '160801',
        'name' => '酒泉',
      ),
      160802 => 
      array (
        'id' => '160802',
        'name' => '金塔',
      ),
      160803 => 
      array (
        'id' => '160803',
        'name' => '阿克塞',
      ),
      160804 => 
      array (
        'id' => '160804',
        'name' => '瓜州',
      ),
      160805 => 
      array (
        'id' => '160805',
        'name' => '肃北',
      ),
      160806 => 
      array (
        'id' => '160806',
        'name' => '玉门',
      ),
      160807 => 
      array (
        'id' => '160807',
        'name' => '敦煌',
      ),
    ),
  ),
  1609 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'city' => 
    array (
      'id' => '1609',
      'name' => '天水',
    ),
    'list' => 
    array (
      160901 => 
      array (
        'id' => '160901',
        'name' => '天水',
      ),
      160902 => 
      array (
        'id' => '160902',
        'name' => '清水',
      ),
      160903 => 
      array (
        'id' => '160903',
        'name' => '秦安',
      ),
      160904 => 
      array (
        'id' => '160904',
        'name' => '甘谷',
      ),
      160905 => 
      array (
        'id' => '160905',
        'name' => '武山',
      ),
      160906 => 
      array (
        'id' => '160906',
        'name' => '张家川',
      ),
      160907 => 
      array (
        'id' => '160907',
        'name' => '麦积',
      ),
    ),
  ),
  1610 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'city' => 
    array (
      'id' => '1610',
      'name' => '陇南',
    ),
    'list' => 
    array (
      161001 => 
      array (
        'id' => '161001',
        'name' => '武都',
      ),
      161002 => 
      array (
        'id' => '161002',
        'name' => '成县',
      ),
      161003 => 
      array (
        'id' => '161003',
        'name' => '文县',
      ),
      161004 => 
      array (
        'id' => '161004',
        'name' => '宕昌',
      ),
      161005 => 
      array (
        'id' => '161005',
        'name' => '康县',
      ),
      161006 => 
      array (
        'id' => '161006',
        'name' => '西和',
      ),
      161007 => 
      array (
        'id' => '161007',
        'name' => '礼县',
      ),
      161008 => 
      array (
        'id' => '161008',
        'name' => '徽县',
      ),
      161009 => 
      array (
        'id' => '161009',
        'name' => '两当',
      ),
    ),
  ),
  1611 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'city' => 
    array (
      'id' => '1611',
      'name' => '临夏',
    ),
    'list' => 
    array (
      161101 => 
      array (
        'id' => '161101',
        'name' => '临夏',
      ),
      161102 => 
      array (
        'id' => '161102',
        'name' => '康乐',
      ),
      161103 => 
      array (
        'id' => '161103',
        'name' => '永靖',
      ),
      161104 => 
      array (
        'id' => '161104',
        'name' => '广河',
      ),
      161105 => 
      array (
        'id' => '161105',
        'name' => '和政',
      ),
      161106 => 
      array (
        'id' => '161106',
        'name' => '东乡',
      ),
      161107 => 
      array (
        'id' => '161107',
        'name' => '积石山',
      ),
    ),
  ),
  1612 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'city' => 
    array (
      'id' => '1612',
      'name' => '甘南',
    ),
    'list' => 
    array (
      161201 => 
      array (
        'id' => '161201',
        'name' => '合作',
      ),
      161202 => 
      array (
        'id' => '161202',
        'name' => '临潭',
      ),
      161203 => 
      array (
        'id' => '161203',
        'name' => '卓尼',
      ),
      161204 => 
      array (
        'id' => '161204',
        'name' => '舟曲',
      ),
      161205 => 
      array (
        'id' => '161205',
        'name' => '迭部',
      ),
      161206 => 
      array (
        'id' => '161206',
        'name' => '玛曲',
      ),
      161207 => 
      array (
        'id' => '161207',
        'name' => '碌曲',
      ),
      161208 => 
      array (
        'id' => '161208',
        'name' => '夏河',
      ),
    ),
  ),
  1613 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'city' => 
    array (
      'id' => '1613',
      'name' => '白银',
    ),
    'list' => 
    array (
      161301 => 
      array (
        'id' => '161301',
        'name' => '白银',
      ),
      161302 => 
      array (
        'id' => '161302',
        'name' => '靖远',
      ),
      161303 => 
      array (
        'id' => '161303',
        'name' => '会宁',
      ),
      161304 => 
      array (
        'id' => '161304',
        'name' => '平川',
      ),
      161305 => 
      array (
        'id' => '161305',
        'name' => '景泰',
      ),
    ),
  ),
  1614 => 
  array (
    'province' => 
    array (
      'id' => '16',
      'name' => '甘肃',
    ),
    'city' => 
    array (
      'id' => '1614',
      'name' => '嘉峪关',
    ),
    'list' => 
    array (
      161401 => 
      array (
        'id' => '161401',
        'name' => '嘉峪关',
      ),
    ),
  ),
  1701 => 
  array (
    'province' => 
    array (
      'id' => '17',
      'name' => '宁夏',
    ),
    'city' => 
    array (
      'id' => '1701',
      'name' => '银川',
    ),
    'list' => 
    array (
      170101 => 
      array (
        'id' => '170101',
        'name' => '银川',
      ),
      170102 => 
      array (
        'id' => '170102',
        'name' => '永宁',
      ),
      170103 => 
      array (
        'id' => '170103',
        'name' => '灵武',
      ),
      170104 => 
      array (
        'id' => '170104',
        'name' => '贺兰',
      ),
    ),
  ),
  1702 => 
  array (
    'province' => 
    array (
      'id' => '17',
      'name' => '宁夏',
    ),
    'city' => 
    array (
      'id' => '1702',
      'name' => '石嘴山',
    ),
    'list' => 
    array (
      170201 => 
      array (
        'id' => '170201',
        'name' => '石嘴山',
      ),
      170202 => 
      array (
        'id' => '170202',
        'name' => '惠农',
      ),
      170203 => 
      array (
        'id' => '170203',
        'name' => '平罗',
      ),
      170204 => 
      array (
        'id' => '170204',
        'name' => '陶乐',
      ),
    ),
  ),
  1703 => 
  array (
    'province' => 
    array (
      'id' => '17',
      'name' => '宁夏',
    ),
    'city' => 
    array (
      'id' => '1703',
      'name' => '吴忠',
    ),
    'list' => 
    array (
      170301 => 
      array (
        'id' => '170301',
        'name' => '吴忠',
      ),
      170302 => 
      array (
        'id' => '170302',
        'name' => '同心',
      ),
      170303 => 
      array (
        'id' => '170303',
        'name' => '盐池',
      ),
      170304 => 
      array (
        'id' => '170304',
        'name' => '青铜峡',
      ),
    ),
  ),
  1704 => 
  array (
    'province' => 
    array (
      'id' => '17',
      'name' => '宁夏',
    ),
    'city' => 
    array (
      'id' => '1704',
      'name' => '固原',
    ),
    'list' => 
    array (
      170401 => 
      array (
        'id' => '170401',
        'name' => '固原',
      ),
      170402 => 
      array (
        'id' => '170402',
        'name' => '西吉',
      ),
      170403 => 
      array (
        'id' => '170403',
        'name' => '隆德',
      ),
      170404 => 
      array (
        'id' => '170404',
        'name' => '泾源',
      ),
      170405 => 
      array (
        'id' => '170405',
        'name' => '彭阳',
      ),
    ),
  ),
  1705 => 
  array (
    'province' => 
    array (
      'id' => '17',
      'name' => '宁夏',
    ),
    'city' => 
    array (
      'id' => '1705',
      'name' => '中卫',
    ),
    'list' => 
    array (
      170501 => 
      array (
        'id' => '170501',
        'name' => '中卫',
      ),
      170502 => 
      array (
        'id' => '170502',
        'name' => '中宁',
      ),
      170503 => 
      array (
        'id' => '170503',
        'name' => '海原',
      ),
    ),
  ),
  1801 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1801',
      'name' => '郑州',
    ),
    'list' => 
    array (
      180101 => 
      array (
        'id' => '180101',
        'name' => '郑州',
      ),
      180102 => 
      array (
        'id' => '180102',
        'name' => '巩义',
      ),
      180103 => 
      array (
        'id' => '180103',
        'name' => '荥阳',
      ),
      180104 => 
      array (
        'id' => '180104',
        'name' => '登封',
      ),
      180105 => 
      array (
        'id' => '180105',
        'name' => '新密',
      ),
      180106 => 
      array (
        'id' => '180106',
        'name' => '新郑',
      ),
      180107 => 
      array (
        'id' => '180107',
        'name' => '中牟',
      ),
      180108 => 
      array (
        'id' => '180108',
        'name' => '上街',
      ),
    ),
  ),
  1802 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1802',
      'name' => '安阳',
    ),
    'list' => 
    array (
      180201 => 
      array (
        'id' => '180201',
        'name' => '安阳',
      ),
      180202 => 
      array (
        'id' => '180202',
        'name' => '汤阴',
      ),
      180203 => 
      array (
        'id' => '180203',
        'name' => '滑县',
      ),
      180204 => 
      array (
        'id' => '180204',
        'name' => '内黄',
      ),
      180205 => 
      array (
        'id' => '180205',
        'name' => '林州',
      ),
    ),
  ),
  1803 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1803',
      'name' => '新乡',
    ),
    'list' => 
    array (
      180301 => 
      array (
        'id' => '180301',
        'name' => '新乡',
      ),
      180302 => 
      array (
        'id' => '180302',
        'name' => '获嘉',
      ),
      180303 => 
      array (
        'id' => '180303',
        'name' => '原阳',
      ),
      180304 => 
      array (
        'id' => '180304',
        'name' => '辉县',
      ),
      180305 => 
      array (
        'id' => '180305',
        'name' => '卫辉',
      ),
      180306 => 
      array (
        'id' => '180306',
        'name' => '延津',
      ),
      180307 => 
      array (
        'id' => '180307',
        'name' => '封丘',
      ),
      180308 => 
      array (
        'id' => '180308',
        'name' => '长垣',
      ),
    ),
  ),
  1804 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1804',
      'name' => '许昌',
    ),
    'list' => 
    array (
      180401 => 
      array (
        'id' => '180401',
        'name' => '许昌',
      ),
      180402 => 
      array (
        'id' => '180402',
        'name' => '鄢陵',
      ),
      180403 => 
      array (
        'id' => '180403',
        'name' => '襄城',
      ),
      180404 => 
      array (
        'id' => '180404',
        'name' => '长葛',
      ),
      180405 => 
      array (
        'id' => '180405',
        'name' => '禹州',
      ),
    ),
  ),
  1805 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1805',
      'name' => '平顶山',
    ),
    'list' => 
    array (
      180501 => 
      array (
        'id' => '180501',
        'name' => '平顶山',
      ),
      180502 => 
      array (
        'id' => '180502',
        'name' => '郏县',
      ),
      180503 => 
      array (
        'id' => '180503',
        'name' => '宝丰',
      ),
      180504 => 
      array (
        'id' => '180504',
        'name' => '汝州',
      ),
      180505 => 
      array (
        'id' => '180505',
        'name' => '叶县',
      ),
      180506 => 
      array (
        'id' => '180506',
        'name' => '舞钢',
      ),
      180507 => 
      array (
        'id' => '180507',
        'name' => '鲁山',
      ),
      180508 => 
      array (
        'id' => '180508',
        'name' => '石龙',
      ),
    ),
  ),
  1806 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1806',
      'name' => '信阳',
    ),
    'list' => 
    array (
      180601 => 
      array (
        'id' => '180601',
        'name' => '信阳',
      ),
      180602 => 
      array (
        'id' => '180602',
        'name' => '息县',
      ),
      180603 => 
      array (
        'id' => '180603',
        'name' => '罗山',
      ),
      180604 => 
      array (
        'id' => '180604',
        'name' => '光山',
      ),
      180605 => 
      array (
        'id' => '180605',
        'name' => '新县',
      ),
      180606 => 
      array (
        'id' => '180606',
        'name' => '淮滨',
      ),
      180607 => 
      array (
        'id' => '180607',
        'name' => '潢川',
      ),
      180608 => 
      array (
        'id' => '180608',
        'name' => '固始',
      ),
      180609 => 
      array (
        'id' => '180609',
        'name' => '商城',
      ),
    ),
  ),
  1807 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1807',
      'name' => '南阳',
    ),
    'list' => 
    array (
      180701 => 
      array (
        'id' => '180701',
        'name' => '南阳',
      ),
      180702 => 
      array (
        'id' => '180702',
        'name' => '南召',
      ),
      180703 => 
      array (
        'id' => '180703',
        'name' => '方城',
      ),
      180704 => 
      array (
        'id' => '180704',
        'name' => '社旗',
      ),
      180705 => 
      array (
        'id' => '180705',
        'name' => '西峡',
      ),
      180706 => 
      array (
        'id' => '180706',
        'name' => '内乡',
      ),
      180707 => 
      array (
        'id' => '180707',
        'name' => '镇平',
      ),
      180708 => 
      array (
        'id' => '180708',
        'name' => '淅川',
      ),
      180709 => 
      array (
        'id' => '180709',
        'name' => '新野',
      ),
      180710 => 
      array (
        'id' => '180710',
        'name' => '唐河',
      ),
      180711 => 
      array (
        'id' => '180711',
        'name' => '邓州',
      ),
      180712 => 
      array (
        'id' => '180712',
        'name' => '桐柏',
      ),
    ),
  ),
  1808 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1808',
      'name' => '开封',
    ),
    'list' => 
    array (
      180801 => 
      array (
        'id' => '180801',
        'name' => '开封',
      ),
      180802 => 
      array (
        'id' => '180802',
        'name' => '杞县',
      ),
      180803 => 
      array (
        'id' => '180803',
        'name' => '尉氏',
      ),
      180804 => 
      array (
        'id' => '180804',
        'name' => '通许',
      ),
      180805 => 
      array (
        'id' => '180805',
        'name' => '兰考',
      ),
    ),
  ),
  1809 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1809',
      'name' => '洛阳',
    ),
    'list' => 
    array (
      180901 => 
      array (
        'id' => '180901',
        'name' => '洛阳',
      ),
      180902 => 
      array (
        'id' => '180902',
        'name' => '新安',
      ),
      180903 => 
      array (
        'id' => '180903',
        'name' => '孟津',
      ),
      180904 => 
      array (
        'id' => '180904',
        'name' => '宜阳',
      ),
      180905 => 
      array (
        'id' => '180905',
        'name' => '洛宁',
      ),
      180906 => 
      array (
        'id' => '180906',
        'name' => '伊川',
      ),
      180907 => 
      array (
        'id' => '180907',
        'name' => '嵩县',
      ),
      180908 => 
      array (
        'id' => '180908',
        'name' => '偃师',
      ),
      180909 => 
      array (
        'id' => '180909',
        'name' => '栾川',
      ),
      180910 => 
      array (
        'id' => '180910',
        'name' => '汝阳',
      ),
      180911 => 
      array (
        'id' => '180911',
        'name' => '吉利',
      ),
    ),
  ),
  1810 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1810',
      'name' => '商丘',
    ),
    'list' => 
    array (
      181001 => 
      array (
        'id' => '181001',
        'name' => '商丘',
      ),
      181002 => 
      array (
        'id' => '181002',
        'name' => '睢县',
      ),
      181003 => 
      array (
        'id' => '181003',
        'name' => '民权',
      ),
      181004 => 
      array (
        'id' => '181004',
        'name' => '虞城',
      ),
      181005 => 
      array (
        'id' => '181005',
        'name' => '柘城',
      ),
      181006 => 
      array (
        'id' => '181006',
        'name' => '宁陵',
      ),
      181007 => 
      array (
        'id' => '181007',
        'name' => '夏邑',
      ),
      181008 => 
      array (
        'id' => '181008',
        'name' => '永城',
      ),
    ),
  ),
  1811 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1811',
      'name' => '焦作',
    ),
    'list' => 
    array (
      181101 => 
      array (
        'id' => '181101',
        'name' => '焦作',
      ),
      181102 => 
      array (
        'id' => '181102',
        'name' => '修武',
      ),
      181103 => 
      array (
        'id' => '181103',
        'name' => '武陟',
      ),
      181104 => 
      array (
        'id' => '181104',
        'name' => '沁阳',
      ),
      181105 => 
      array (
        'id' => '181105',
        'name' => '博爱',
      ),
      181106 => 
      array (
        'id' => '181106',
        'name' => '温县',
      ),
      181107 => 
      array (
        'id' => '181107',
        'name' => '孟州',
      ),
    ),
  ),
  1812 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1812',
      'name' => '鹤壁',
    ),
    'list' => 
    array (
      181201 => 
      array (
        'id' => '181201',
        'name' => '鹤壁',
      ),
      181202 => 
      array (
        'id' => '181202',
        'name' => '浚县',
      ),
      181203 => 
      array (
        'id' => '181203',
        'name' => '淇县',
      ),
    ),
  ),
  1813 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1813',
      'name' => '濮阳',
    ),
    'list' => 
    array (
      181301 => 
      array (
        'id' => '181301',
        'name' => '濮阳',
      ),
      181302 => 
      array (
        'id' => '181302',
        'name' => '台前',
      ),
      181303 => 
      array (
        'id' => '181303',
        'name' => '南乐',
      ),
      181304 => 
      array (
        'id' => '181304',
        'name' => '清丰',
      ),
      181305 => 
      array (
        'id' => '181305',
        'name' => '范县',
      ),
    ),
  ),
  1814 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1814',
      'name' => '周口',
    ),
    'list' => 
    array (
      181401 => 
      array (
        'id' => '181401',
        'name' => '周口',
      ),
      181402 => 
      array (
        'id' => '181402',
        'name' => '扶沟',
      ),
      181403 => 
      array (
        'id' => '181403',
        'name' => '太康',
      ),
      181404 => 
      array (
        'id' => '181404',
        'name' => '淮阳',
      ),
      181405 => 
      array (
        'id' => '181405',
        'name' => '西华',
      ),
      181406 => 
      array (
        'id' => '181406',
        'name' => '商水',
      ),
      181407 => 
      array (
        'id' => '181407',
        'name' => '项城',
      ),
      181408 => 
      array (
        'id' => '181408',
        'name' => '郸城',
      ),
      181409 => 
      array (
        'id' => '181409',
        'name' => '鹿邑',
      ),
      181410 => 
      array (
        'id' => '181410',
        'name' => '沈丘',
      ),
    ),
  ),
  1815 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1815',
      'name' => '漯河',
    ),
    'list' => 
    array (
      181501 => 
      array (
        'id' => '181501',
        'name' => '漯河',
      ),
      181502 => 
      array (
        'id' => '181502',
        'name' => '临颍',
      ),
      181503 => 
      array (
        'id' => '181503',
        'name' => '舞阳',
      ),
    ),
  ),
  1816 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1816',
      'name' => '驻马店',
    ),
    'list' => 
    array (
      181601 => 
      array (
        'id' => '181601',
        'name' => '驻马店',
      ),
      181602 => 
      array (
        'id' => '181602',
        'name' => '西平',
      ),
      181603 => 
      array (
        'id' => '181603',
        'name' => '遂平',
      ),
      181604 => 
      array (
        'id' => '181604',
        'name' => '上蔡',
      ),
      181605 => 
      array (
        'id' => '181605',
        'name' => '汝南',
      ),
      181606 => 
      array (
        'id' => '181606',
        'name' => '泌阳',
      ),
      181607 => 
      array (
        'id' => '181607',
        'name' => '平舆',
      ),
      181608 => 
      array (
        'id' => '181608',
        'name' => '新蔡',
      ),
      181609 => 
      array (
        'id' => '181609',
        'name' => '确山',
      ),
      181610 => 
      array (
        'id' => '181610',
        'name' => '正阳',
      ),
    ),
  ),
  1817 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1817',
      'name' => '三门峡',
    ),
    'list' => 
    array (
      181701 => 
      array (
        'id' => '181701',
        'name' => '三门峡',
      ),
      181702 => 
      array (
        'id' => '181702',
        'name' => '灵宝',
      ),
      181703 => 
      array (
        'id' => '181703',
        'name' => '渑池',
      ),
      181704 => 
      array (
        'id' => '181704',
        'name' => '卢氏',
      ),
      181705 => 
      array (
        'id' => '181705',
        'name' => '义马',
      ),
      181706 => 
      array (
        'id' => '181706',
        'name' => '陕县',
      ),
    ),
  ),
  1818 => 
  array (
    'province' => 
    array (
      'id' => '18',
      'name' => '河南',
    ),
    'city' => 
    array (
      'id' => '1818',
      'name' => '济源',
    ),
    'list' => 
    array (
      181801 => 
      array (
        'id' => '181801',
        'name' => '济源',
      ),
    ),
  ),
  1901 => 
  array (
    'province' => 
    array (
      'id' => '19',
      'name' => '江苏',
    ),
    'city' => 
    array (
      'id' => '1901',
      'name' => '南京',
    ),
    'list' => 
    array (
      190101 => 
      array (
        'id' => '190101',
        'name' => '南京',
      ),
      190102 => 
      array (
        'id' => '190102',
        'name' => '溧水',
      ),
      190103 => 
      array (
        'id' => '190103',
        'name' => '高淳',
      ),
      190104 => 
      array (
        'id' => '190104',
        'name' => '江宁',
      ),
      190105 => 
      array (
        'id' => '190105',
        'name' => '六合',
      ),
      190106 => 
      array (
        'id' => '190106',
        'name' => '江浦',
      ),
      190107 => 
      array (
        'id' => '190107',
        'name' => '浦口',
      ),
    ),
  ),
  1902 => 
  array (
    'province' => 
    array (
      'id' => '19',
      'name' => '江苏',
    ),
    'city' => 
    array (
      'id' => '1902',
      'name' => '无锡',
    ),
    'list' => 
    array (
      190201 => 
      array (
        'id' => '190201',
        'name' => '无锡',
      ),
      190202 => 
      array (
        'id' => '190202',
        'name' => '江阴',
      ),
      190203 => 
      array (
        'id' => '190203',
        'name' => '宜兴',
      ),
      190204 => 
      array (
        'id' => '190204',
        'name' => '锡山',
      ),
    ),
  ),
  1903 => 
  array (
    'province' => 
    array (
      'id' => '19',
      'name' => '江苏',
    ),
    'city' => 
    array (
      'id' => '1903',
      'name' => '镇江',
    ),
    'list' => 
    array (
      190301 => 
      array (
        'id' => '190301',
        'name' => '镇江',
      ),
      190302 => 
      array (
        'id' => '190302',
        'name' => '丹阳',
      ),
      190303 => 
      array (
        'id' => '190303',
        'name' => '扬中',
      ),
      190304 => 
      array (
        'id' => '190304',
        'name' => '句容',
      ),
      190305 => 
      array (
        'id' => '190305',
        'name' => '丹徒',
      ),
    ),
  ),
  1904 => 
  array (
    'province' => 
    array (
      'id' => '19',
      'name' => '江苏',
    ),
    'city' => 
    array (
      'id' => '1904',
      'name' => '苏州',
    ),
    'list' => 
    array (
      190401 => 
      array (
        'id' => '190401',
        'name' => '苏州',
      ),
      190402 => 
      array (
        'id' => '190402',
        'name' => '常熟',
      ),
      190403 => 
      array (
        'id' => '190403',
        'name' => '张家港',
      ),
      190404 => 
      array (
        'id' => '190404',
        'name' => '昆山',
      ),
      190405 => 
      array (
        'id' => '190405',
        'name' => '吴中',
      ),
      190406 => 
      array (
        'id' => '190406',
        'name' => '吴江',
      ),
      190407 => 
      array (
        'id' => '190407',
        'name' => '太仓',
      ),
    ),
  ),
  1905 => 
  array (
    'province' => 
    array (
      'id' => '19',
      'name' => '江苏',
    ),
    'city' => 
    array (
      'id' => '1905',
      'name' => '南通',
    ),
    'list' => 
    array (
      190501 => 
      array (
        'id' => '190501',
        'name' => '南通',
      ),
      190502 => 
      array (
        'id' => '190502',
        'name' => '海安',
      ),
      190503 => 
      array (
        'id' => '190503',
        'name' => '如皋',
      ),
      190504 => 
      array (
        'id' => '190504',
        'name' => '如东',
      ),
      190505 => 
      array (
        'id' => '190505',
        'name' => '启东',
      ),
      190506 => 
      array (
        'id' => '190506',
        'name' => '海门',
      ),
      190507 => 
      array (
        'id' => '190507',
        'name' => '通州',
      ),
    ),
  ),
  1906 => 
  array (
    'province' => 
    array (
      'id' => '19',
      'name' => '江苏',
    ),
    'city' => 
    array (
      'id' => '1906',
      'name' => '扬州',
    ),
    'list' => 
    array (
      190601 => 
      array (
        'id' => '190601',
        'name' => '扬州',
      ),
      190602 => 
      array (
        'id' => '190602',
        'name' => '宝应',
      ),
      190603 => 
      array (
        'id' => '190603',
        'name' => '仪征',
      ),
      190604 => 
      array (
        'id' => '190604',
        'name' => '高邮',
      ),
      190605 => 
      array (
        'id' => '190605',
        'name' => '江都',
      ),
      190606 => 
      array (
        'id' => '190606',
        'name' => '邗江',
      ),
    ),
  ),
  1907 => 
  array (
    'province' => 
    array (
      'id' => '19',
      'name' => '江苏',
    ),
    'city' => 
    array (
      'id' => '1907',
      'name' => '盐城',
    ),
    'list' => 
    array (
      190701 => 
      array (
        'id' => '190701',
        'name' => '盐城',
      ),
      190702 => 
      array (
        'id' => '190702',
        'name' => '响水',
      ),
      190703 => 
      array (
        'id' => '190703',
        'name' => '滨海',
      ),
      190704 => 
      array (
        'id' => '190704',
        'name' => '阜宁',
      ),
      190705 => 
      array (
        'id' => '190705',
        'name' => '射阳',
      ),
      190706 => 
      array (
        'id' => '190706',
        'name' => '建湖',
      ),
      190707 => 
      array (
        'id' => '190707',
        'name' => '东台',
      ),
      190708 => 
      array (
        'id' => '190708',
        'name' => '大丰',
      ),
      190709 => 
      array (
        'id' => '190709',
        'name' => '盐都',
      ),
    ),
  ),
  1908 => 
  array (
    'province' => 
    array (
      'id' => '19',
      'name' => '江苏',
    ),
    'city' => 
    array (
      'id' => '1908',
      'name' => '徐州',
    ),
    'list' => 
    array (
      190801 => 
      array (
        'id' => '190801',
        'name' => '徐州',
      ),
      190802 => 
      array (
        'id' => '190802',
        'name' => '铜山',
      ),
      190803 => 
      array (
        'id' => '190803',
        'name' => '丰县',
      ),
      190804 => 
      array (
        'id' => '190804',
        'name' => '沛县',
      ),
      190805 => 
      array (
        'id' => '190805',
        'name' => '邳州',
      ),
      190806 => 
      array (
        'id' => '190806',
        'name' => '睢宁',
      ),
      190807 => 
      array (
        'id' => '190807',
        'name' => '新沂',
      ),
    ),
  ),
  1909 => 
  array (
    'province' => 
    array (
      'id' => '19',
      'name' => '江苏',
    ),
    'city' => 
    array (
      'id' => '1909',
      'name' => '淮安',
    ),
    'list' => 
    array (
      190901 => 
      array (
        'id' => '190901',
        'name' => '淮安',
      ),
      190902 => 
      array (
        'id' => '190902',
        'name' => '金湖',
      ),
      190903 => 
      array (
        'id' => '190903',
        'name' => '盱眙',
      ),
      190904 => 
      array (
        'id' => '190904',
        'name' => '洪泽',
      ),
      190905 => 
      array (
        'id' => '190905',
        'name' => '涟水',
      ),
      190906 => 
      array (
        'id' => '190906',
        'name' => '淮阴区',
      ),
      190907 => 
      array (
        'id' => '190907',
        'name' => '淮安区',
      ),
    ),
  ),
  1910 => 
  array (
    'province' => 
    array (
      'id' => '19',
      'name' => '江苏',
    ),
    'city' => 
    array (
      'id' => '1910',
      'name' => '连云港',
    ),
    'list' => 
    array (
      191001 => 
      array (
        'id' => '191001',
        'name' => '连云港',
      ),
      191002 => 
      array (
        'id' => '191002',
        'name' => '东海',
      ),
      191003 => 
      array (
        'id' => '191003',
        'name' => '赣榆',
      ),
      191004 => 
      array (
        'id' => '191004',
        'name' => '灌云',
      ),
      191005 => 
      array (
        'id' => '191005',
        'name' => '灌南',
      ),
    ),
  ),
  1911 => 
  array (
    'province' => 
    array (
      'id' => '19',
      'name' => '江苏',
    ),
    'city' => 
    array (
      'id' => '1911',
      'name' => '常州',
    ),
    'list' => 
    array (
      191101 => 
      array (
        'id' => '191101',
        'name' => '常州',
      ),
      191102 => 
      array (
        'id' => '191102',
        'name' => '溧阳',
      ),
      191103 => 
      array (
        'id' => '191103',
        'name' => '金坛',
      ),
      191104 => 
      array (
        'id' => '191104',
        'name' => '武进',
      ),
    ),
  ),
  1912 => 
  array (
    'province' => 
    array (
      'id' => '19',
      'name' => '江苏',
    ),
    'city' => 
    array (
      'id' => '1912',
      'name' => '泰州',
    ),
    'list' => 
    array (
      191201 => 
      array (
        'id' => '191201',
        'name' => '泰州',
      ),
      191202 => 
      array (
        'id' => '191202',
        'name' => '兴化',
      ),
      191203 => 
      array (
        'id' => '191203',
        'name' => '泰兴',
      ),
      191204 => 
      array (
        'id' => '191204',
        'name' => '姜堰',
      ),
      191205 => 
      array (
        'id' => '191205',
        'name' => '靖江',
      ),
    ),
  ),
  1913 => 
  array (
    'province' => 
    array (
      'id' => '19',
      'name' => '江苏',
    ),
    'city' => 
    array (
      'id' => '1913',
      'name' => '宿迁',
    ),
    'list' => 
    array (
      191301 => 
      array (
        'id' => '191301',
        'name' => '宿迁',
      ),
      191302 => 
      array (
        'id' => '191302',
        'name' => '沭阳',
      ),
      191303 => 
      array (
        'id' => '191303',
        'name' => '泗阳',
      ),
      191304 => 
      array (
        'id' => '191304',
        'name' => '泗洪',
      ),
      191305 => 
      array (
        'id' => '191305',
        'name' => '宿豫',
      ),
    ),
  ),
  2001 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2001',
      'name' => '武汉',
    ),
    'list' => 
    array (
      200101 => 
      array (
        'id' => '200101',
        'name' => '武汉',
      ),
      200102 => 
      array (
        'id' => '200102',
        'name' => '蔡甸',
      ),
      200103 => 
      array (
        'id' => '200103',
        'name' => '黄陂',
      ),
      200104 => 
      array (
        'id' => '200104',
        'name' => '新洲',
      ),
      200105 => 
      array (
        'id' => '200105',
        'name' => '江夏',
      ),
      200106 => 
      array (
        'id' => '200106',
        'name' => '东西湖',
      ),
    ),
  ),
  2002 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2002',
      'name' => '襄阳',
    ),
    'list' => 
    array (
      200201 => 
      array (
        'id' => '200201',
        'name' => '襄阳',
      ),
      200202 => 
      array (
        'id' => '200202',
        'name' => '襄州',
      ),
      200203 => 
      array (
        'id' => '200203',
        'name' => '保康',
      ),
      200204 => 
      array (
        'id' => '200204',
        'name' => '南漳',
      ),
      200205 => 
      array (
        'id' => '200205',
        'name' => '宜城',
      ),
      200206 => 
      array (
        'id' => '200206',
        'name' => '老河口',
      ),
      200207 => 
      array (
        'id' => '200207',
        'name' => '谷城',
      ),
      200208 => 
      array (
        'id' => '200208',
        'name' => '枣阳',
      ),
    ),
  ),
  2003 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2003',
      'name' => '鄂州',
    ),
    'list' => 
    array (
      200301 => 
      array (
        'id' => '200301',
        'name' => '鄂州',
      ),
      200302 => 
      array (
        'id' => '200302',
        'name' => '梁子湖',
      ),
    ),
  ),
  2004 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2004',
      'name' => '孝感',
    ),
    'list' => 
    array (
      200401 => 
      array (
        'id' => '200401',
        'name' => '孝感',
      ),
      200402 => 
      array (
        'id' => '200402',
        'name' => '安陆',
      ),
      200403 => 
      array (
        'id' => '200403',
        'name' => '云梦',
      ),
      200404 => 
      array (
        'id' => '200404',
        'name' => '大悟',
      ),
      200405 => 
      array (
        'id' => '200405',
        'name' => '应城',
      ),
      200406 => 
      array (
        'id' => '200406',
        'name' => '汉川',
      ),
      200407 => 
      array (
        'id' => '200407',
        'name' => '孝昌',
      ),
    ),
  ),
  2005 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2005',
      'name' => '黄冈',
    ),
    'list' => 
    array (
      200501 => 
      array (
        'id' => '200501',
        'name' => '黄冈',
      ),
      200502 => 
      array (
        'id' => '200502',
        'name' => '红安',
      ),
      200503 => 
      array (
        'id' => '200503',
        'name' => '麻城',
      ),
      200504 => 
      array (
        'id' => '200504',
        'name' => '罗田',
      ),
      200505 => 
      array (
        'id' => '200505',
        'name' => '英山',
      ),
      200506 => 
      array (
        'id' => '200506',
        'name' => '浠水',
      ),
      200507 => 
      array (
        'id' => '200507',
        'name' => '蕲春',
      ),
      200508 => 
      array (
        'id' => '200508',
        'name' => '黄梅',
      ),
      200509 => 
      array (
        'id' => '200509',
        'name' => '武穴',
      ),
      200510 => 
      array (
        'id' => '200510',
        'name' => '团风',
      ),
    ),
  ),
  2006 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2006',
      'name' => '黄石',
    ),
    'list' => 
    array (
      200601 => 
      array (
        'id' => '200601',
        'name' => '黄石',
      ),
      200602 => 
      array (
        'id' => '200602',
        'name' => '大冶',
      ),
      200603 => 
      array (
        'id' => '200603',
        'name' => '阳新',
      ),
      200604 => 
      array (
        'id' => '200604',
        'name' => '铁山',
      ),
      200605 => 
      array (
        'id' => '200605',
        'name' => '下陆',
      ),
      200606 => 
      array (
        'id' => '200606',
        'name' => '西塞山',
      ),
    ),
  ),
  2007 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2007',
      'name' => '咸宁',
    ),
    'list' => 
    array (
      200701 => 
      array (
        'id' => '200701',
        'name' => '咸宁',
      ),
      200702 => 
      array (
        'id' => '200702',
        'name' => '赤壁',
      ),
      200703 => 
      array (
        'id' => '200703',
        'name' => '嘉鱼',
      ),
      200704 => 
      array (
        'id' => '200704',
        'name' => '崇阳',
      ),
      200705 => 
      array (
        'id' => '200705',
        'name' => '通城',
      ),
      200706 => 
      array (
        'id' => '200706',
        'name' => '通山',
      ),
    ),
  ),
  2008 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2008',
      'name' => '荆州',
    ),
    'list' => 
    array (
      200801 => 
      array (
        'id' => '200801',
        'name' => '荆州',
      ),
      200802 => 
      array (
        'id' => '200802',
        'name' => '江陵',
      ),
      200803 => 
      array (
        'id' => '200803',
        'name' => '公安',
      ),
      200804 => 
      array (
        'id' => '200804',
        'name' => '石首',
      ),
      200805 => 
      array (
        'id' => '200805',
        'name' => '监利',
      ),
      200806 => 
      array (
        'id' => '200806',
        'name' => '洪湖',
      ),
      200807 => 
      array (
        'id' => '200807',
        'name' => '松滋',
      ),
      200808 => 
      array (
        'id' => '200808',
        'name' => '沙市',
      ),
    ),
  ),
  2009 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2009',
      'name' => '宜昌',
    ),
    'list' => 
    array (
      200901 => 
      array (
        'id' => '200901',
        'name' => '宜昌',
      ),
      200902 => 
      array (
        'id' => '200902',
        'name' => '远安',
      ),
      200903 => 
      array (
        'id' => '200903',
        'name' => '秭归',
      ),
      200904 => 
      array (
        'id' => '200904',
        'name' => '兴山',
      ),
      200905 => 
      array (
        'id' => '200905',
        'name' => '五峰',
      ),
      200906 => 
      array (
        'id' => '200906',
        'name' => '当阳',
      ),
      200907 => 
      array (
        'id' => '200907',
        'name' => '长阳',
      ),
      200908 => 
      array (
        'id' => '200908',
        'name' => '宜都',
      ),
      200909 => 
      array (
        'id' => '200909',
        'name' => '枝江',
      ),
      200910 => 
      array (
        'id' => '200910',
        'name' => '三峡',
      ),
      200911 => 
      array (
        'id' => '200911',
        'name' => '夷陵',
      ),
    ),
  ),
  2010 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2010',
      'name' => '恩施',
    ),
    'list' => 
    array (
      201001 => 
      array (
        'id' => '201001',
        'name' => '恩施',
      ),
      201002 => 
      array (
        'id' => '201002',
        'name' => '利川',
      ),
      201003 => 
      array (
        'id' => '201003',
        'name' => '建始',
      ),
      201004 => 
      array (
        'id' => '201004',
        'name' => '咸丰',
      ),
      201005 => 
      array (
        'id' => '201005',
        'name' => '宣恩',
      ),
      201006 => 
      array (
        'id' => '201006',
        'name' => '鹤峰',
      ),
      201007 => 
      array (
        'id' => '201007',
        'name' => '来凤',
      ),
      201008 => 
      array (
        'id' => '201008',
        'name' => '巴东',
      ),
    ),
  ),
  2011 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2011',
      'name' => '十堰',
    ),
    'list' => 
    array (
      201101 => 
      array (
        'id' => '201101',
        'name' => '十堰',
      ),
      201102 => 
      array (
        'id' => '201102',
        'name' => '竹溪',
      ),
      201103 => 
      array (
        'id' => '201103',
        'name' => '郧西',
      ),
      201104 => 
      array (
        'id' => '201104',
        'name' => '郧县',
      ),
      201105 => 
      array (
        'id' => '201105',
        'name' => '竹山',
      ),
      201106 => 
      array (
        'id' => '201106',
        'name' => '房县',
      ),
      201107 => 
      array (
        'id' => '201107',
        'name' => '丹江口',
      ),
      201108 => 
      array (
        'id' => '201108',
        'name' => '茅箭',
      ),
      201109 => 
      array (
        'id' => '201109',
        'name' => '张湾',
      ),
    ),
  ),
  2012 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2012',
      'name' => '神农架',
    ),
    'list' => 
    array (
      201201 => 
      array (
        'id' => '201201',
        'name' => '神农架',
      ),
    ),
  ),
  2013 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2013',
      'name' => '随州',
    ),
    'list' => 
    array (
      201301 => 
      array (
        'id' => '201301',
        'name' => '随州',
      ),
      201302 => 
      array (
        'id' => '201302',
        'name' => '广水',
      ),
    ),
  ),
  2014 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2014',
      'name' => '荆门',
    ),
    'list' => 
    array (
      201401 => 
      array (
        'id' => '201401',
        'name' => '荆门',
      ),
      201402 => 
      array (
        'id' => '201402',
        'name' => '钟祥',
      ),
      201403 => 
      array (
        'id' => '201403',
        'name' => '京山',
      ),
      201404 => 
      array (
        'id' => '201404',
        'name' => '掇刀',
      ),
      201405 => 
      array (
        'id' => '201405',
        'name' => '沙洋',
      ),
    ),
  ),
  2015 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2015',
      'name' => '天门',
    ),
    'list' => 
    array (
      201501 => 
      array (
        'id' => '201501',
        'name' => '天门',
      ),
    ),
  ),
  2016 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2016',
      'name' => '仙桃',
    ),
    'list' => 
    array (
      201601 => 
      array (
        'id' => '201601',
        'name' => '仙桃',
      ),
    ),
  ),
  2017 => 
  array (
    'province' => 
    array (
      'id' => '20',
      'name' => '湖北',
    ),
    'city' => 
    array (
      'id' => '2017',
      'name' => '潜江',
    ),
    'list' => 
    array (
      201701 => 
      array (
        'id' => '201701',
        'name' => '潜江',
      ),
    ),
  ),
  2101 => 
  array (
    'province' => 
    array (
      'id' => '21',
      'name' => '浙江',
    ),
    'city' => 
    array (
      'id' => '2101',
      'name' => '杭州',
    ),
    'list' => 
    array (
      210101 => 
      array (
        'id' => '210101',
        'name' => '杭州',
      ),
      210102 => 
      array (
        'id' => '210102',
        'name' => '萧山',
      ),
      210103 => 
      array (
        'id' => '210103',
        'name' => '桐庐',
      ),
      210104 => 
      array (
        'id' => '210104',
        'name' => '淳安',
      ),
      210105 => 
      array (
        'id' => '210105',
        'name' => '建德',
      ),
      210106 => 
      array (
        'id' => '210106',
        'name' => '余杭',
      ),
      210107 => 
      array (
        'id' => '210107',
        'name' => '临安',
      ),
      210108 => 
      array (
        'id' => '210108',
        'name' => '富阳',
      ),
    ),
  ),
  2102 => 
  array (
    'province' => 
    array (
      'id' => '21',
      'name' => '浙江',
    ),
    'city' => 
    array (
      'id' => '2102',
      'name' => '湖州',
    ),
    'list' => 
    array (
      210201 => 
      array (
        'id' => '210201',
        'name' => '湖州',
      ),
      210202 => 
      array (
        'id' => '210202',
        'name' => '长兴',
      ),
      210203 => 
      array (
        'id' => '210203',
        'name' => '安吉',
      ),
      210204 => 
      array (
        'id' => '210204',
        'name' => '德清',
      ),
    ),
  ),
  2103 => 
  array (
    'province' => 
    array (
      'id' => '21',
      'name' => '浙江',
    ),
    'city' => 
    array (
      'id' => '2103',
      'name' => '嘉兴',
    ),
    'list' => 
    array (
      210301 => 
      array (
        'id' => '210301',
        'name' => '嘉兴',
      ),
      210302 => 
      array (
        'id' => '210302',
        'name' => '嘉善',
      ),
      210303 => 
      array (
        'id' => '210303',
        'name' => '海宁',
      ),
      210304 => 
      array (
        'id' => '210304',
        'name' => '桐乡',
      ),
      210305 => 
      array (
        'id' => '210305',
        'name' => '平湖',
      ),
      210306 => 
      array (
        'id' => '210306',
        'name' => '海盐',
      ),
    ),
  ),
  2104 => 
  array (
    'province' => 
    array (
      'id' => '21',
      'name' => '浙江',
    ),
    'city' => 
    array (
      'id' => '2104',
      'name' => '宁波',
    ),
    'list' => 
    array (
      210401 => 
      array (
        'id' => '210401',
        'name' => '宁波',
      ),
      210402 => 
      array (
        'id' => '210402',
        'name' => '慈溪',
      ),
      210403 => 
      array (
        'id' => '210403',
        'name' => '余姚',
      ),
      210404 => 
      array (
        'id' => '210404',
        'name' => '奉化',
      ),
      210405 => 
      array (
        'id' => '210405',
        'name' => '象山',
      ),
      210406 => 
      array (
        'id' => '210406',
        'name' => '宁海',
      ),
      210407 => 
      array (
        'id' => '210407',
        'name' => '北仑',
      ),
      210408 => 
      array (
        'id' => '210408',
        'name' => '鄞州',
      ),
      210409 => 
      array (
        'id' => '210409',
        'name' => '镇海',
      ),
    ),
  ),
  2105 => 
  array (
    'province' => 
    array (
      'id' => '21',
      'name' => '浙江',
    ),
    'city' => 
    array (
      'id' => '2105',
      'name' => '绍兴',
    ),
    'list' => 
    array (
      210501 => 
      array (
        'id' => '210501',
        'name' => '绍兴',
      ),
      210502 => 
      array (
        'id' => '210502',
        'name' => '诸暨',
      ),
      210503 => 
      array (
        'id' => '210503',
        'name' => '上虞',
      ),
      210504 => 
      array (
        'id' => '210504',
        'name' => '新昌',
      ),
      210505 => 
      array (
        'id' => '210505',
        'name' => '嵊州',
      ),
    ),
  ),
  2106 => 
  array (
    'province' => 
    array (
      'id' => '21',
      'name' => '浙江',
    ),
    'city' => 
    array (
      'id' => '2106',
      'name' => '台州',
    ),
    'list' => 
    array (
      210601 => 
      array (
        'id' => '210601',
        'name' => '台州',
      ),
      210602 => 
      array (
        'id' => '210602',
        'name' => '玉环',
      ),
      210603 => 
      array (
        'id' => '210603',
        'name' => '三门',
      ),
      210604 => 
      array (
        'id' => '210604',
        'name' => '天台',
      ),
      210605 => 
      array (
        'id' => '210605',
        'name' => '仙居',
      ),
      210606 => 
      array (
        'id' => '210606',
        'name' => '温岭',
      ),
      210607 => 
      array (
        'id' => '210607',
        'name' => '洪家',
      ),
      210608 => 
      array (
        'id' => '210608',
        'name' => '临海',
      ),
      210609 => 
      array (
        'id' => '210609',
        'name' => '椒江',
      ),
      210610 => 
      array (
        'id' => '210610',
        'name' => '黄岩',
      ),
      210611 => 
      array (
        'id' => '210611',
        'name' => '路桥',
      ),
    ),
  ),
  2107 => 
  array (
    'province' => 
    array (
      'id' => '21',
      'name' => '浙江',
    ),
    'city' => 
    array (
      'id' => '2107',
      'name' => '温州',
    ),
    'list' => 
    array (
      210701 => 
      array (
        'id' => '210701',
        'name' => '温州',
      ),
      210702 => 
      array (
        'id' => '210702',
        'name' => '泰顺',
      ),
      210703 => 
      array (
        'id' => '210703',
        'name' => '文成',
      ),
      210704 => 
      array (
        'id' => '210704',
        'name' => '平阳',
      ),
      210705 => 
      array (
        'id' => '210705',
        'name' => '瑞安',
      ),
      210706 => 
      array (
        'id' => '210706',
        'name' => '洞头',
      ),
      210707 => 
      array (
        'id' => '210707',
        'name' => '乐清',
      ),
      210708 => 
      array (
        'id' => '210708',
        'name' => '永嘉',
      ),
      210709 => 
      array (
        'id' => '210709',
        'name' => '苍南',
      ),
    ),
  ),
  2108 => 
  array (
    'province' => 
    array (
      'id' => '21',
      'name' => '浙江',
    ),
    'city' => 
    array (
      'id' => '2108',
      'name' => '丽水',
    ),
    'list' => 
    array (
      210801 => 
      array (
        'id' => '210801',
        'name' => '丽水',
      ),
      210802 => 
      array (
        'id' => '210802',
        'name' => '遂昌',
      ),
      210803 => 
      array (
        'id' => '210803',
        'name' => '龙泉',
      ),
      210804 => 
      array (
        'id' => '210804',
        'name' => '缙云',
      ),
      210805 => 
      array (
        'id' => '210805',
        'name' => '青田',
      ),
      210806 => 
      array (
        'id' => '210806',
        'name' => '云和',
      ),
      210807 => 
      array (
        'id' => '210807',
        'name' => '庆元',
      ),
      210808 => 
      array (
        'id' => '210808',
        'name' => '松阳',
      ),
      210809 => 
      array (
        'id' => '210809',
        'name' => '景宁',
      ),
    ),
  ),
  2109 => 
  array (
    'province' => 
    array (
      'id' => '21',
      'name' => '浙江',
    ),
    'city' => 
    array (
      'id' => '2109',
      'name' => '金华',
    ),
    'list' => 
    array (
      210901 => 
      array (
        'id' => '210901',
        'name' => '金华',
      ),
      210902 => 
      array (
        'id' => '210902',
        'name' => '浦江',
      ),
      210903 => 
      array (
        'id' => '210903',
        'name' => '兰溪',
      ),
      210904 => 
      array (
        'id' => '210904',
        'name' => '义乌',
      ),
      210905 => 
      array (
        'id' => '210905',
        'name' => '东阳',
      ),
      210906 => 
      array (
        'id' => '210906',
        'name' => '武义',
      ),
      210907 => 
      array (
        'id' => '210907',
        'name' => '永康',
      ),
      210908 => 
      array (
        'id' => '210908',
        'name' => '磐安',
      ),
    ),
  ),
  2110 => 
  array (
    'province' => 
    array (
      'id' => '21',
      'name' => '浙江',
    ),
    'city' => 
    array (
      'id' => '2110',
      'name' => '衢州',
    ),
    'list' => 
    array (
      211001 => 
      array (
        'id' => '211001',
        'name' => '衢州',
      ),
      211002 => 
      array (
        'id' => '211002',
        'name' => '常山',
      ),
      211003 => 
      array (
        'id' => '211003',
        'name' => '开化',
      ),
      211004 => 
      array (
        'id' => '211004',
        'name' => '龙游',
      ),
      211005 => 
      array (
        'id' => '211005',
        'name' => '江山',
      ),
      211006 => 
      array (
        'id' => '211006',
        'name' => '衢江',
      ),
    ),
  ),
  2111 => 
  array (
    'province' => 
    array (
      'id' => '21',
      'name' => '浙江',
    ),
    'city' => 
    array (
      'id' => '2111',
      'name' => '舟山',
    ),
    'list' => 
    array (
      211101 => 
      array (
        'id' => '211101',
        'name' => '舟山',
      ),
      211102 => 
      array (
        'id' => '211102',
        'name' => '嵊泗',
      ),
      211103 => 
      array (
        'id' => '211103',
        'name' => '岱山',
      ),
      211104 => 
      array (
        'id' => '211104',
        'name' => '普陀',
      ),
      211105 => 
      array (
        'id' => '211105',
        'name' => '定海',
      ),
    ),
  ),
  2201 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2201',
      'name' => '合肥',
    ),
    'list' => 
    array (
      220101 => 
      array (
        'id' => '220101',
        'name' => '合肥',
      ),
      220102 => 
      array (
        'id' => '220102',
        'name' => '长丰',
      ),
      220103 => 
      array (
        'id' => '220103',
        'name' => '肥东',
      ),
      220104 => 
      array (
        'id' => '220104',
        'name' => '肥西',
      ),
    ),
  ),
  2202 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2202',
      'name' => '蚌埠',
    ),
    'list' => 
    array (
      220201 => 
      array (
        'id' => '220201',
        'name' => '蚌埠',
      ),
      220202 => 
      array (
        'id' => '220202',
        'name' => '怀远',
      ),
      220203 => 
      array (
        'id' => '220203',
        'name' => '固镇',
      ),
      220204 => 
      array (
        'id' => '220204',
        'name' => '五河',
      ),
    ),
  ),
  2203 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2203',
      'name' => '芜湖',
    ),
    'list' => 
    array (
      220301 => 
      array (
        'id' => '220301',
        'name' => '芜湖',
      ),
      220302 => 
      array (
        'id' => '220302',
        'name' => '繁昌',
      ),
      220303 => 
      array (
        'id' => '220303',
        'name' => '芜湖县',
      ),
      220304 => 
      array (
        'id' => '220304',
        'name' => '南陵',
      ),
    ),
  ),
  2204 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2204',
      'name' => '淮南',
    ),
    'list' => 
    array (
      220401 => 
      array (
        'id' => '220401',
        'name' => '淮南',
      ),
      220402 => 
      array (
        'id' => '220402',
        'name' => '凤台',
      ),
      220403 => 
      array (
        'id' => '220403',
        'name' => '潘集',
      ),
    ),
  ),
  2205 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2205',
      'name' => '马鞍山',
    ),
    'list' => 
    array (
      220501 => 
      array (
        'id' => '220501',
        'name' => '马鞍山',
      ),
      220502 => 
      array (
        'id' => '220502',
        'name' => '当涂',
      ),
    ),
  ),
  2206 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2206',
      'name' => '安庆',
    ),
    'list' => 
    array (
      220601 => 
      array (
        'id' => '220601',
        'name' => '安庆',
      ),
      220602 => 
      array (
        'id' => '220602',
        'name' => '枞阳',
      ),
      220603 => 
      array (
        'id' => '220603',
        'name' => '太湖',
      ),
      220604 => 
      array (
        'id' => '220604',
        'name' => '潜山',
      ),
      220605 => 
      array (
        'id' => '220605',
        'name' => '怀宁',
      ),
      220606 => 
      array (
        'id' => '220606',
        'name' => '宿松',
      ),
      220607 => 
      array (
        'id' => '220607',
        'name' => '望江',
      ),
      220608 => 
      array (
        'id' => '220608',
        'name' => '岳西',
      ),
      220609 => 
      array (
        'id' => '220609',
        'name' => '桐城',
      ),
    ),
  ),
  2207 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2207',
      'name' => '宿州',
    ),
    'list' => 
    array (
      220701 => 
      array (
        'id' => '220701',
        'name' => '宿州',
      ),
      220702 => 
      array (
        'id' => '220702',
        'name' => '砀山',
      ),
      220703 => 
      array (
        'id' => '220703',
        'name' => '灵璧',
      ),
      220704 => 
      array (
        'id' => '220704',
        'name' => '泗县',
      ),
      220705 => 
      array (
        'id' => '220705',
        'name' => '萧县',
      ),
    ),
  ),
  2208 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2208',
      'name' => '阜阳',
    ),
    'list' => 
    array (
      220801 => 
      array (
        'id' => '220801',
        'name' => '阜阳',
      ),
      220802 => 
      array (
        'id' => '220802',
        'name' => '阜南',
      ),
      220803 => 
      array (
        'id' => '220803',
        'name' => '颍上',
      ),
      220804 => 
      array (
        'id' => '220804',
        'name' => '临泉',
      ),
      220805 => 
      array (
        'id' => '220805',
        'name' => '界首',
      ),
      220806 => 
      array (
        'id' => '220806',
        'name' => '太和',
      ),
    ),
  ),
  2209 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2209',
      'name' => '亳州',
    ),
    'list' => 
    array (
      220901 => 
      array (
        'id' => '220901',
        'name' => '亳州',
      ),
      220902 => 
      array (
        'id' => '220902',
        'name' => '涡阳',
      ),
      220903 => 
      array (
        'id' => '220903',
        'name' => '利辛',
      ),
      220904 => 
      array (
        'id' => '220904',
        'name' => '蒙城',
      ),
    ),
  ),
  2210 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2210',
      'name' => '黄山',
    ),
    'list' => 
    array (
      221001 => 
      array (
        'id' => '221001',
        'name' => '黄山市',
      ),
      221002 => 
      array (
        'id' => '221002',
        'name' => '黄山区',
      ),
      221003 => 
      array (
        'id' => '221003',
        'name' => '屯溪',
      ),
      221004 => 
      array (
        'id' => '221004',
        'name' => '祁门',
      ),
      221005 => 
      array (
        'id' => '221005',
        'name' => '黟县',
      ),
      221006 => 
      array (
        'id' => '221006',
        'name' => '歙县',
      ),
      221007 => 
      array (
        'id' => '221007',
        'name' => '休宁',
      ),
      221008 => 
      array (
        'id' => '221008',
        'name' => '黄山风景区',
      ),
    ),
  ),
  2211 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2211',
      'name' => '滁州',
    ),
    'list' => 
    array (
      221101 => 
      array (
        'id' => '221101',
        'name' => '滁州',
      ),
      221102 => 
      array (
        'id' => '221102',
        'name' => '凤阳',
      ),
      221103 => 
      array (
        'id' => '221103',
        'name' => '明光',
      ),
      221104 => 
      array (
        'id' => '221104',
        'name' => '定远',
      ),
      221105 => 
      array (
        'id' => '221105',
        'name' => '全椒',
      ),
      221106 => 
      array (
        'id' => '221106',
        'name' => '来安',
      ),
      221107 => 
      array (
        'id' => '221107',
        'name' => '天长',
      ),
    ),
  ),
  2212 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2212',
      'name' => '淮北',
    ),
    'list' => 
    array (
      221201 => 
      array (
        'id' => '221201',
        'name' => '淮北',
      ),
      221202 => 
      array (
        'id' => '221202',
        'name' => '濉溪',
      ),
    ),
  ),
  2213 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2213',
      'name' => '铜陵',
    ),
    'list' => 
    array (
      221301 => 
      array (
        'id' => '221301',
        'name' => '铜陵',
      ),
    ),
  ),
  2214 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2214',
      'name' => '宣城',
    ),
    'list' => 
    array (
      221401 => 
      array (
        'id' => '221401',
        'name' => '宣城',
      ),
      221402 => 
      array (
        'id' => '221402',
        'name' => '泾县',
      ),
      221403 => 
      array (
        'id' => '221403',
        'name' => '旌德',
      ),
      221404 => 
      array (
        'id' => '221404',
        'name' => '宁国',
      ),
      221405 => 
      array (
        'id' => '221405',
        'name' => '绩溪',
      ),
      221406 => 
      array (
        'id' => '221406',
        'name' => '广德',
      ),
      221407 => 
      array (
        'id' => '221407',
        'name' => '郎溪',
      ),
    ),
  ),
  2215 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2215',
      'name' => '六安',
    ),
    'list' => 
    array (
      221501 => 
      array (
        'id' => '221501',
        'name' => '六安',
      ),
      221502 => 
      array (
        'id' => '221502',
        'name' => '霍邱',
      ),
      221503 => 
      array (
        'id' => '221503',
        'name' => '寿县',
      ),
      221504 => 
      array (
        'id' => '221504',
        'name' => '金寨',
      ),
      221505 => 
      array (
        'id' => '221505',
        'name' => '霍山',
      ),
      221506 => 
      array (
        'id' => '221506',
        'name' => '舒城',
      ),
    ),
  ),
  2216 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2216',
      'name' => '巢湖',
    ),
    'list' => 
    array (
      221601 => 
      array (
        'id' => '221601',
        'name' => '巢湖',
      ),
      221602 => 
      array (
        'id' => '221602',
        'name' => '庐江',
      ),
      221603 => 
      array (
        'id' => '221603',
        'name' => '无为',
      ),
      221604 => 
      array (
        'id' => '221604',
        'name' => '含山',
      ),
      221605 => 
      array (
        'id' => '221605',
        'name' => '和县',
      ),
    ),
  ),
  2217 => 
  array (
    'province' => 
    array (
      'id' => '22',
      'name' => '安徽',
    ),
    'city' => 
    array (
      'id' => '2217',
      'name' => '池州',
    ),
    'list' => 
    array (
      221701 => 
      array (
        'id' => '221701',
        'name' => '池州',
      ),
      221702 => 
      array (
        'id' => '221702',
        'name' => '东至',
      ),
      221703 => 
      array (
        'id' => '221703',
        'name' => '青阳',
      ),
      221704 => 
      array (
        'id' => '221704',
        'name' => '九华山',
      ),
      221705 => 
      array (
        'id' => '221705',
        'name' => '石台',
      ),
    ),
  ),
  2301 => 
  array (
    'province' => 
    array (
      'id' => '23',
      'name' => '福建',
    ),
    'city' => 
    array (
      'id' => '2301',
      'name' => '福州',
    ),
    'list' => 
    array (
      230101 => 
      array (
        'id' => '230101',
        'name' => '福州',
      ),
      230102 => 
      array (
        'id' => '230102',
        'name' => '闽清',
      ),
      230103 => 
      array (
        'id' => '230103',
        'name' => '闽侯',
      ),
      230104 => 
      array (
        'id' => '230104',
        'name' => '罗源',
      ),
      230105 => 
      array (
        'id' => '230105',
        'name' => '连江',
      ),
      230106 => 
      array (
        'id' => '230106',
        'name' => '永泰',
      ),
      230107 => 
      array (
        'id' => '230107',
        'name' => '平潭',
      ),
      230108 => 
      array (
        'id' => '230108',
        'name' => '长乐',
      ),
      230109 => 
      array (
        'id' => '230109',
        'name' => '福清',
      ),
    ),
  ),
  2302 => 
  array (
    'province' => 
    array (
      'id' => '23',
      'name' => '福建',
    ),
    'city' => 
    array (
      'id' => '2302',
      'name' => '厦门',
    ),
    'list' => 
    array (
      230201 => 
      array (
        'id' => '230201',
        'name' => '厦门',
      ),
      230202 => 
      array (
        'id' => '230202',
        'name' => '同安',
      ),
    ),
  ),
  2303 => 
  array (
    'province' => 
    array (
      'id' => '23',
      'name' => '福建',
    ),
    'city' => 
    array (
      'id' => '2303',
      'name' => '宁德',
    ),
    'list' => 
    array (
      230301 => 
      array (
        'id' => '230301',
        'name' => '宁德',
      ),
      230302 => 
      array (
        'id' => '230302',
        'name' => '古田',
      ),
      230303 => 
      array (
        'id' => '230303',
        'name' => '霞浦',
      ),
      230304 => 
      array (
        'id' => '230304',
        'name' => '寿宁',
      ),
      230305 => 
      array (
        'id' => '230305',
        'name' => '周宁',
      ),
      230306 => 
      array (
        'id' => '230306',
        'name' => '福安',
      ),
      230307 => 
      array (
        'id' => '230307',
        'name' => '柘荣',
      ),
      230308 => 
      array (
        'id' => '230308',
        'name' => '福鼎',
      ),
      230309 => 
      array (
        'id' => '230309',
        'name' => '屏南',
      ),
    ),
  ),
  2304 => 
  array (
    'province' => 
    array (
      'id' => '23',
      'name' => '福建',
    ),
    'city' => 
    array (
      'id' => '2304',
      'name' => '莆田',
    ),
    'list' => 
    array (
      230401 => 
      array (
        'id' => '230401',
        'name' => '莆田',
      ),
      230402 => 
      array (
        'id' => '230402',
        'name' => '仙游',
      ),
      230403 => 
      array (
        'id' => '230403',
        'name' => '秀屿港',
      ),
      230404 => 
      array (
        'id' => '230404',
        'name' => '涵江',
      ),
      230405 => 
      array (
        'id' => '230405',
        'name' => '秀屿',
      ),
      230406 => 
      array (
        'id' => '230406',
        'name' => '荔城',
      ),
      230407 => 
      array (
        'id' => '230407',
        'name' => '城厢',
      ),
    ),
  ),
  2305 => 
  array (
    'province' => 
    array (
      'id' => '23',
      'name' => '福建',
    ),
    'city' => 
    array (
      'id' => '2305',
      'name' => '泉州',
    ),
    'list' => 
    array (
      230501 => 
      array (
        'id' => '230501',
        'name' => '泉州',
      ),
      230502 => 
      array (
        'id' => '230502',
        'name' => '安溪',
      ),
      230503 => 
      array (
        'id' => '230503',
        'name' => '永春',
      ),
      230504 => 
      array (
        'id' => '230504',
        'name' => '德化',
      ),
      230505 => 
      array (
        'id' => '230505',
        'name' => '南安',
      ),
      230506 => 
      array (
        'id' => '230506',
        'name' => '崇武',
      ),
      230507 => 
      array (
        'id' => '230507',
        'name' => '惠安',
      ),
      230508 => 
      array (
        'id' => '230508',
        'name' => '晋江',
      ),
      230509 => 
      array (
        'id' => '230509',
        'name' => '石狮',
      ),
    ),
  ),
  2306 => 
  array (
    'province' => 
    array (
      'id' => '23',
      'name' => '福建',
    ),
    'city' => 
    array (
      'id' => '2306',
      'name' => '漳州',
    ),
    'list' => 
    array (
      230601 => 
      array (
        'id' => '230601',
        'name' => '漳州',
      ),
      230602 => 
      array (
        'id' => '230602',
        'name' => '长泰',
      ),
      230603 => 
      array (
        'id' => '230603',
        'name' => '南靖',
      ),
      230604 => 
      array (
        'id' => '230604',
        'name' => '平和',
      ),
      230605 => 
      array (
        'id' => '230605',
        'name' => '龙海',
      ),
      230606 => 
      array (
        'id' => '230606',
        'name' => '漳浦',
      ),
      230607 => 
      array (
        'id' => '230607',
        'name' => '诏安',
      ),
      230608 => 
      array (
        'id' => '230608',
        'name' => '东山',
      ),
      230609 => 
      array (
        'id' => '230609',
        'name' => '云霄',
      ),
      230610 => 
      array (
        'id' => '230610',
        'name' => '华安',
      ),
    ),
  ),
  2307 => 
  array (
    'province' => 
    array (
      'id' => '23',
      'name' => '福建',
    ),
    'city' => 
    array (
      'id' => '2307',
      'name' => '龙岩',
    ),
    'list' => 
    array (
      230701 => 
      array (
        'id' => '230701',
        'name' => '龙岩',
      ),
      230702 => 
      array (
        'id' => '230702',
        'name' => '长汀',
      ),
      230703 => 
      array (
        'id' => '230703',
        'name' => '连城',
      ),
      230704 => 
      array (
        'id' => '230704',
        'name' => '武平',
      ),
      230705 => 
      array (
        'id' => '230705',
        'name' => '上杭',
      ),
      230706 => 
      array (
        'id' => '230706',
        'name' => '永定',
      ),
      230707 => 
      array (
        'id' => '230707',
        'name' => '漳平',
      ),
    ),
  ),
  2308 => 
  array (
    'province' => 
    array (
      'id' => '23',
      'name' => '福建',
    ),
    'city' => 
    array (
      'id' => '2308',
      'name' => '三明',
    ),
    'list' => 
    array (
      230801 => 
      array (
        'id' => '230801',
        'name' => '三明',
      ),
      230802 => 
      array (
        'id' => '230802',
        'name' => '宁化',
      ),
      230803 => 
      array (
        'id' => '230803',
        'name' => '清流',
      ),
      230804 => 
      array (
        'id' => '230804',
        'name' => '泰宁',
      ),
      230805 => 
      array (
        'id' => '230805',
        'name' => '将乐',
      ),
      230806 => 
      array (
        'id' => '230806',
        'name' => '建宁',
      ),
      230807 => 
      array (
        'id' => '230807',
        'name' => '明溪',
      ),
      230808 => 
      array (
        'id' => '230808',
        'name' => '沙县',
      ),
      230809 => 
      array (
        'id' => '230809',
        'name' => '尤溪',
      ),
      230810 => 
      array (
        'id' => '230810',
        'name' => '永安',
      ),
      230811 => 
      array (
        'id' => '230811',
        'name' => '大田',
      ),
    ),
  ),
  2309 => 
  array (
    'province' => 
    array (
      'id' => '23',
      'name' => '福建',
    ),
    'city' => 
    array (
      'id' => '2309',
      'name' => '南平',
    ),
    'list' => 
    array (
      230901 => 
      array (
        'id' => '230901',
        'name' => '南平',
      ),
      230902 => 
      array (
        'id' => '230902',
        'name' => '顺昌',
      ),
      230903 => 
      array (
        'id' => '230903',
        'name' => '光泽',
      ),
      230904 => 
      array (
        'id' => '230904',
        'name' => '邵武',
      ),
      230905 => 
      array (
        'id' => '230905',
        'name' => '武夷山',
      ),
      230906 => 
      array (
        'id' => '230906',
        'name' => '浦城',
      ),
      230907 => 
      array (
        'id' => '230907',
        'name' => '建阳',
      ),
      230908 => 
      array (
        'id' => '230908',
        'name' => '松溪',
      ),
      230909 => 
      array (
        'id' => '230909',
        'name' => '政和',
      ),
      230910 => 
      array (
        'id' => '230910',
        'name' => '建瓯',
      ),
    ),
  ),
  2401 => 
  array (
    'province' => 
    array (
      'id' => '24',
      'name' => '江西',
    ),
    'city' => 
    array (
      'id' => '2401',
      'name' => '南昌',
    ),
    'list' => 
    array (
      240101 => 
      array (
        'id' => '240101',
        'name' => '南昌',
      ),
      240102 => 
      array (
        'id' => '240102',
        'name' => '新建',
      ),
      240103 => 
      array (
        'id' => '240103',
        'name' => '南昌县',
      ),
      240104 => 
      array (
        'id' => '240104',
        'name' => '安义',
      ),
      240105 => 
      array (
        'id' => '240105',
        'name' => '进贤',
      ),
    ),
  ),
  2402 => 
  array (
    'province' => 
    array (
      'id' => '24',
      'name' => '江西',
    ),
    'city' => 
    array (
      'id' => '2402',
      'name' => '九江',
    ),
    'list' => 
    array (
      240201 => 
      array (
        'id' => '240201',
        'name' => '九江',
      ),
      240202 => 
      array (
        'id' => '240202',
        'name' => '瑞昌',
      ),
      240203 => 
      array (
        'id' => '240203',
        'name' => '庐山',
      ),
      240204 => 
      array (
        'id' => '240204',
        'name' => '武宁',
      ),
      240205 => 
      array (
        'id' => '240205',
        'name' => '德安',
      ),
      240206 => 
      array (
        'id' => '240206',
        'name' => '永修',
      ),
      240207 => 
      array (
        'id' => '240207',
        'name' => '湖口',
      ),
      240208 => 
      array (
        'id' => '240208',
        'name' => '彭泽',
      ),
      240209 => 
      array (
        'id' => '240209',
        'name' => '星子',
      ),
      240210 => 
      array (
        'id' => '240210',
        'name' => '都昌',
      ),
      240211 => 
      array (
        'id' => '240211',
        'name' => '修水',
      ),
    ),
  ),
  2403 => 
  array (
    'province' => 
    array (
      'id' => '24',
      'name' => '江西',
    ),
    'city' => 
    array (
      'id' => '2403',
      'name' => '上饶',
    ),
    'list' => 
    array (
      240301 => 
      array (
        'id' => '240301',
        'name' => '上饶',
      ),
      240302 => 
      array (
        'id' => '240302',
        'name' => '鄱阳',
      ),
      240303 => 
      array (
        'id' => '240303',
        'name' => '婺源',
      ),
      240304 => 
      array (
        'id' => '240304',
        'name' => '余干',
      ),
      240305 => 
      array (
        'id' => '240305',
        'name' => '万年',
      ),
      240306 => 
      array (
        'id' => '240306',
        'name' => '德兴',
      ),
      240307 => 
      array (
        'id' => '240307',
        'name' => '上饶县',
      ),
      240308 => 
      array (
        'id' => '240308',
        'name' => '弋阳',
      ),
      240309 => 
      array (
        'id' => '240309',
        'name' => '横峰',
      ),
      240310 => 
      array (
        'id' => '240310',
        'name' => '铅山',
      ),
      240311 => 
      array (
        'id' => '240311',
        'name' => '玉山',
      ),
      240312 => 
      array (
        'id' => '240312',
        'name' => '广丰',
      ),
    ),
  ),
  2404 => 
  array (
    'province' => 
    array (
      'id' => '24',
      'name' => '江西',
    ),
    'city' => 
    array (
      'id' => '2404',
      'name' => '抚州',
    ),
    'list' => 
    array (
      240401 => 
      array (
        'id' => '240401',
        'name' => '抚州',
      ),
      240402 => 
      array (
        'id' => '240402',
        'name' => '广昌',
      ),
      240403 => 
      array (
        'id' => '240403',
        'name' => '乐安',
      ),
      240404 => 
      array (
        'id' => '240404',
        'name' => '崇仁',
      ),
      240405 => 
      array (
        'id' => '240405',
        'name' => '金溪',
      ),
      240406 => 
      array (
        'id' => '240406',
        'name' => '资溪',
      ),
      240407 => 
      array (
        'id' => '240407',
        'name' => '宜黄',
      ),
      240408 => 
      array (
        'id' => '240408',
        'name' => '南城',
      ),
      240409 => 
      array (
        'id' => '240409',
        'name' => '南丰',
      ),
      240410 => 
      array (
        'id' => '240410',
        'name' => '黎川',
      ),
      240411 => 
      array (
        'id' => '240411',
        'name' => '东乡',
      ),
    ),
  ),
  2405 => 
  array (
    'province' => 
    array (
      'id' => '24',
      'name' => '江西',
    ),
    'city' => 
    array (
      'id' => '2405',
      'name' => '宜春',
    ),
    'list' => 
    array (
      240501 => 
      array (
        'id' => '240501',
        'name' => '宜春',
      ),
      240502 => 
      array (
        'id' => '240502',
        'name' => '铜鼓',
      ),
      240503 => 
      array (
        'id' => '240503',
        'name' => '宜丰',
      ),
      240504 => 
      array (
        'id' => '240504',
        'name' => '万载',
      ),
      240505 => 
      array (
        'id' => '240505',
        'name' => '上高',
      ),
      240506 => 
      array (
        'id' => '240506',
        'name' => '靖安',
      ),
      240507 => 
      array (
        'id' => '240507',
        'name' => '奉新',
      ),
      240508 => 
      array (
        'id' => '240508',
        'name' => '高安',
      ),
      240509 => 
      array (
        'id' => '240509',
        'name' => '樟树',
      ),
      240510 => 
      array (
        'id' => '240510',
        'name' => '丰城',
      ),
    ),
  ),
  2406 => 
  array (
    'province' => 
    array (
      'id' => '24',
      'name' => '江西',
    ),
    'city' => 
    array (
      'id' => '2406',
      'name' => '吉安',
    ),
    'list' => 
    array (
      240601 => 
      array (
        'id' => '240601',
        'name' => '吉安',
      ),
      240602 => 
      array (
        'id' => '240602',
        'name' => '吉安县',
      ),
      240603 => 
      array (
        'id' => '240603',
        'name' => '吉水',
      ),
      240604 => 
      array (
        'id' => '240604',
        'name' => '新干',
      ),
      240605 => 
      array (
        'id' => '240605',
        'name' => '峡江',
      ),
      240606 => 
      array (
        'id' => '240606',
        'name' => '永丰',
      ),
      240607 => 
      array (
        'id' => '240607',
        'name' => '永新',
      ),
      240608 => 
      array (
        'id' => '240608',
        'name' => '井冈山',
      ),
      240609 => 
      array (
        'id' => '240609',
        'name' => '万安',
      ),
      240610 => 
      array (
        'id' => '240610',
        'name' => '遂川',
      ),
      240611 => 
      array (
        'id' => '240611',
        'name' => '泰和',
      ),
      240612 => 
      array (
        'id' => '240612',
        'name' => '安福',
      ),
      240613 => 
      array (
        'id' => '240613',
        'name' => '宁冈',
      ),
    ),
  ),
  2407 => 
  array (
    'province' => 
    array (
      'id' => '24',
      'name' => '江西',
    ),
    'city' => 
    array (
      'id' => '2407',
      'name' => '赣州',
    ),
    'list' => 
    array (
      240701 => 
      array (
        'id' => '240701',
        'name' => '赣州',
      ),
      240702 => 
      array (
        'id' => '240702',
        'name' => '崇义',
      ),
      240703 => 
      array (
        'id' => '240703',
        'name' => '上犹',
      ),
      240704 => 
      array (
        'id' => '240704',
        'name' => '南康',
      ),
      240705 => 
      array (
        'id' => '240705',
        'name' => '大余',
      ),
      240706 => 
      array (
        'id' => '240706',
        'name' => '信丰',
      ),
      240707 => 
      array (
        'id' => '240707',
        'name' => '宁都',
      ),
      240708 => 
      array (
        'id' => '240708',
        'name' => '石城',
      ),
      240709 => 
      array (
        'id' => '240709',
        'name' => '瑞金',
      ),
      240710 => 
      array (
        'id' => '240710',
        'name' => '于都',
      ),
      240711 => 
      array (
        'id' => '240711',
        'name' => '会昌',
      ),
      240712 => 
      array (
        'id' => '240712',
        'name' => '安远',
      ),
      240713 => 
      array (
        'id' => '240713',
        'name' => '全南',
      ),
      240714 => 
      array (
        'id' => '240714',
        'name' => '龙南',
      ),
      240715 => 
      array (
        'id' => '240715',
        'name' => '定南',
      ),
      240716 => 
      array (
        'id' => '240716',
        'name' => '寻乌',
      ),
      240717 => 
      array (
        'id' => '240717',
        'name' => '兴国',
      ),
      240718 => 
      array (
        'id' => '240718',
        'name' => '赣县',
      ),
    ),
  ),
  2408 => 
  array (
    'province' => 
    array (
      'id' => '24',
      'name' => '江西',
    ),
    'city' => 
    array (
      'id' => '2408',
      'name' => '景德镇',
    ),
    'list' => 
    array (
      240801 => 
      array (
        'id' => '240801',
        'name' => '景德镇',
      ),
      240802 => 
      array (
        'id' => '240802',
        'name' => '乐平',
      ),
      240803 => 
      array (
        'id' => '240803',
        'name' => '浮梁',
      ),
    ),
  ),
  2409 => 
  array (
    'province' => 
    array (
      'id' => '24',
      'name' => '江西',
    ),
    'city' => 
    array (
      'id' => '2409',
      'name' => '萍乡',
    ),
    'list' => 
    array (
      240901 => 
      array (
        'id' => '240901',
        'name' => '萍乡',
      ),
      240902 => 
      array (
        'id' => '240902',
        'name' => '莲花',
      ),
      240903 => 
      array (
        'id' => '240903',
        'name' => '上栗',
      ),
      240904 => 
      array (
        'id' => '240904',
        'name' => '安源',
      ),
      240905 => 
      array (
        'id' => '240905',
        'name' => '芦溪',
      ),
      240906 => 
      array (
        'id' => '240906',
        'name' => '湘东',
      ),
    ),
  ),
  2410 => 
  array (
    'province' => 
    array (
      'id' => '24',
      'name' => '江西',
    ),
    'city' => 
    array (
      'id' => '2410',
      'name' => '新余',
    ),
    'list' => 
    array (
      241001 => 
      array (
        'id' => '241001',
        'name' => '新余',
      ),
      241002 => 
      array (
        'id' => '241002',
        'name' => '分宜',
      ),
    ),
  ),
  2411 => 
  array (
    'province' => 
    array (
      'id' => '24',
      'name' => '江西',
    ),
    'city' => 
    array (
      'id' => '2411',
      'name' => '鹰潭',
    ),
    'list' => 
    array (
      241101 => 
      array (
        'id' => '241101',
        'name' => '鹰潭',
      ),
      241102 => 
      array (
        'id' => '241102',
        'name' => '余江',
      ),
      241103 => 
      array (
        'id' => '241103',
        'name' => '贵溪',
      ),
    ),
  ),
  2501 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'city' => 
    array (
      'id' => '2501',
      'name' => '长沙',
    ),
    'list' => 
    array (
      250101 => 
      array (
        'id' => '250101',
        'name' => '长沙',
      ),
      250102 => 
      array (
        'id' => '250102',
        'name' => '宁乡',
      ),
      250103 => 
      array (
        'id' => '250103',
        'name' => '浏阳',
      ),
      250104 => 
      array (
        'id' => '250104',
        'name' => '马坡岭',
      ),
      250105 => 
      array (
        'id' => '250105',
        'name' => '望城',
      ),
    ),
  ),
  2502 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'city' => 
    array (
      'id' => '2502',
      'name' => '湘潭',
    ),
    'list' => 
    array (
      250201 => 
      array (
        'id' => '250201',
        'name' => '湘潭',
      ),
      250202 => 
      array (
        'id' => '250202',
        'name' => '韶山',
      ),
      250203 => 
      array (
        'id' => '250203',
        'name' => '湘乡',
      ),
    ),
  ),
  2503 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'city' => 
    array (
      'id' => '2503',
      'name' => '株洲',
    ),
    'list' => 
    array (
      250301 => 
      array (
        'id' => '250301',
        'name' => '株洲',
      ),
      250302 => 
      array (
        'id' => '250302',
        'name' => '攸县',
      ),
      250303 => 
      array (
        'id' => '250303',
        'name' => '醴陵',
      ),
      250304 => 
      array (
        'id' => '250304',
        'name' => '茶陵',
      ),
      250305 => 
      array (
        'id' => '250305',
        'name' => '炎陵',
      ),
    ),
  ),
  2504 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'city' => 
    array (
      'id' => '2504',
      'name' => '衡阳',
    ),
    'list' => 
    array (
      250401 => 
      array (
        'id' => '250401',
        'name' => '衡阳',
      ),
      250402 => 
      array (
        'id' => '250402',
        'name' => '衡山',
      ),
      250403 => 
      array (
        'id' => '250403',
        'name' => '衡东',
      ),
      250404 => 
      array (
        'id' => '250404',
        'name' => '祁东',
      ),
      250405 => 
      array (
        'id' => '250405',
        'name' => '衡阳县',
      ),
      250406 => 
      array (
        'id' => '250406',
        'name' => '常宁',
      ),
      250407 => 
      array (
        'id' => '250407',
        'name' => '衡南',
      ),
      250408 => 
      array (
        'id' => '250408',
        'name' => '耒阳',
      ),
      250409 => 
      array (
        'id' => '250409',
        'name' => '南岳',
      ),
    ),
  ),
  2505 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'city' => 
    array (
      'id' => '2505',
      'name' => '郴州',
    ),
    'list' => 
    array (
      250501 => 
      array (
        'id' => '250501',
        'name' => '郴州',
      ),
      250502 => 
      array (
        'id' => '250502',
        'name' => '桂阳',
      ),
      250503 => 
      array (
        'id' => '250503',
        'name' => '嘉禾',
      ),
      250504 => 
      array (
        'id' => '250504',
        'name' => '宜章',
      ),
      250505 => 
      array (
        'id' => '250505',
        'name' => '临武',
      ),
      250506 => 
      array (
        'id' => '250506',
        'name' => '资兴',
      ),
      250507 => 
      array (
        'id' => '250507',
        'name' => '汝城',
      ),
      250508 => 
      array (
        'id' => '250508',
        'name' => '安仁',
      ),
      250509 => 
      array (
        'id' => '250509',
        'name' => '永兴',
      ),
      250510 => 
      array (
        'id' => '250510',
        'name' => '桂东',
      ),
      250511 => 
      array (
        'id' => '250511',
        'name' => '苏仙',
      ),
    ),
  ),
  2506 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'city' => 
    array (
      'id' => '2506',
      'name' => '常德',
    ),
    'list' => 
    array (
      250601 => 
      array (
        'id' => '250601',
        'name' => '常德',
      ),
      250602 => 
      array (
        'id' => '250602',
        'name' => '安乡',
      ),
      250603 => 
      array (
        'id' => '250603',
        'name' => '桃源',
      ),
      250604 => 
      array (
        'id' => '250604',
        'name' => '汉寿',
      ),
      250605 => 
      array (
        'id' => '250605',
        'name' => '澧县',
      ),
      250606 => 
      array (
        'id' => '250606',
        'name' => '临澧',
      ),
      250607 => 
      array (
        'id' => '250607',
        'name' => '石门',
      ),
      250608 => 
      array (
        'id' => '250608',
        'name' => '津市',
      ),
    ),
  ),
  2507 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'city' => 
    array (
      'id' => '2507',
      'name' => '益阳',
    ),
    'list' => 
    array (
      250701 => 
      array (
        'id' => '250701',
        'name' => '益阳',
      ),
      250702 => 
      array (
        'id' => '250702',
        'name' => '赫山区',
      ),
      250703 => 
      array (
        'id' => '250703',
        'name' => '南县',
      ),
      250704 => 
      array (
        'id' => '250704',
        'name' => '桃江',
      ),
      250705 => 
      array (
        'id' => '250705',
        'name' => '安化',
      ),
      250706 => 
      array (
        'id' => '250706',
        'name' => '沅江',
      ),
    ),
  ),
  2508 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'city' => 
    array (
      'id' => '2508',
      'name' => '娄底',
    ),
    'list' => 
    array (
      250801 => 
      array (
        'id' => '250801',
        'name' => '娄底',
      ),
      250802 => 
      array (
        'id' => '250802',
        'name' => '双峰',
      ),
      250803 => 
      array (
        'id' => '250803',
        'name' => '冷水江',
      ),
      250804 => 
      array (
        'id' => '250804',
        'name' => '新化',
      ),
      250805 => 
      array (
        'id' => '250805',
        'name' => '涟源',
      ),
    ),
  ),
  2509 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'city' => 
    array (
      'id' => '2509',
      'name' => '邵阳',
    ),
    'list' => 
    array (
      250901 => 
      array (
        'id' => '250901',
        'name' => '邵阳',
      ),
      250902 => 
      array (
        'id' => '250902',
        'name' => '隆回',
      ),
      250903 => 
      array (
        'id' => '250903',
        'name' => '洞口',
      ),
      250904 => 
      array (
        'id' => '250904',
        'name' => '新邵',
      ),
      250905 => 
      array (
        'id' => '250905',
        'name' => '邵东',
      ),
      250906 => 
      array (
        'id' => '250906',
        'name' => '绥宁',
      ),
      250907 => 
      array (
        'id' => '250907',
        'name' => '新宁',
      ),
      250908 => 
      array (
        'id' => '250908',
        'name' => '武冈',
      ),
      250909 => 
      array (
        'id' => '250909',
        'name' => '城步',
      ),
      250910 => 
      array (
        'id' => '250910',
        'name' => '邵阳县',
      ),
    ),
  ),
  2510 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'city' => 
    array (
      'id' => '2510',
      'name' => '岳阳',
    ),
    'list' => 
    array (
      251001 => 
      array (
        'id' => '251001',
        'name' => '岳阳',
      ),
      251002 => 
      array (
        'id' => '251002',
        'name' => '华容',
      ),
      251003 => 
      array (
        'id' => '251003',
        'name' => '湘阴',
      ),
      251004 => 
      array (
        'id' => '251004',
        'name' => '汨罗',
      ),
      251005 => 
      array (
        'id' => '251005',
        'name' => '平江',
      ),
      251006 => 
      array (
        'id' => '251006',
        'name' => '临湘',
      ),
    ),
  ),
  2511 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'city' => 
    array (
      'id' => '2511',
      'name' => '张家界',
    ),
    'list' => 
    array (
      251101 => 
      array (
        'id' => '251101',
        'name' => '张家界',
      ),
      251102 => 
      array (
        'id' => '251102',
        'name' => '桑植',
      ),
      251103 => 
      array (
        'id' => '251103',
        'name' => '慈利',
      ),
      251104 => 
      array (
        'id' => '251104',
        'name' => '武陵源',
      ),
    ),
  ),
  2512 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'city' => 
    array (
      'id' => '2512',
      'name' => '怀化',
    ),
    'list' => 
    array (
      251201 => 
      array (
        'id' => '251201',
        'name' => '怀化',
      ),
      251202 => 
      array (
        'id' => '251202',
        'name' => '沅陵',
      ),
      251203 => 
      array (
        'id' => '251203',
        'name' => '辰溪',
      ),
      251204 => 
      array (
        'id' => '251204',
        'name' => '靖州',
      ),
      251205 => 
      array (
        'id' => '251205',
        'name' => '会同',
      ),
      251206 => 
      array (
        'id' => '251206',
        'name' => '通道',
      ),
      251207 => 
      array (
        'id' => '251207',
        'name' => '麻阳',
      ),
      251208 => 
      array (
        'id' => '251208',
        'name' => '新晃',
      ),
      251209 => 
      array (
        'id' => '251209',
        'name' => '芷江',
      ),
      251210 => 
      array (
        'id' => '251210',
        'name' => '溆浦',
      ),
      251211 => 
      array (
        'id' => '251211',
        'name' => '中方',
      ),
      251212 => 
      array (
        'id' => '251212',
        'name' => '洪江',
      ),
    ),
  ),
  2513 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'city' => 
    array (
      'id' => '2513',
      'name' => '永州',
    ),
    'list' => 
    array (
      251301 => 
      array (
        'id' => '251301',
        'name' => '永州',
      ),
      251302 => 
      array (
        'id' => '251302',
        'name' => '祁阳',
      ),
      251303 => 
      array (
        'id' => '251303',
        'name' => '东安',
      ),
      251304 => 
      array (
        'id' => '251304',
        'name' => '双牌',
      ),
      251305 => 
      array (
        'id' => '251305',
        'name' => '道县',
      ),
      251306 => 
      array (
        'id' => '251306',
        'name' => '宁远',
      ),
      251307 => 
      array (
        'id' => '251307',
        'name' => '江永',
      ),
      251308 => 
      array (
        'id' => '251308',
        'name' => '蓝山',
      ),
      251309 => 
      array (
        'id' => '251309',
        'name' => '新田',
      ),
      251310 => 
      array (
        'id' => '251310',
        'name' => '江华',
      ),
      251311 => 
      array (
        'id' => '251311',
        'name' => '冷水滩',
      ),
    ),
  ),
  2514 => 
  array (
    'province' => 
    array (
      'id' => '25',
      'name' => '湖南',
    ),
    'city' => 
    array (
      'id' => '2514',
      'name' => '湘西',
    ),
    'list' => 
    array (
      251401 => 
      array (
        'id' => '251401',
        'name' => '吉首',
      ),
      251402 => 
      array (
        'id' => '251402',
        'name' => '保靖',
      ),
      251403 => 
      array (
        'id' => '251403',
        'name' => '永顺',
      ),
      251404 => 
      array (
        'id' => '251404',
        'name' => '古丈',
      ),
      251405 => 
      array (
        'id' => '251405',
        'name' => '凤凰',
      ),
      251406 => 
      array (
        'id' => '251406',
        'name' => '泸溪',
      ),
      251407 => 
      array (
        'id' => '251407',
        'name' => '龙山',
      ),
      251408 => 
      array (
        'id' => '251408',
        'name' => '花垣',
      ),
    ),
  ),
  2601 => 
  array (
    'province' => 
    array (
      'id' => '26',
      'name' => '贵州',
    ),
    'city' => 
    array (
      'id' => '2601',
      'name' => '贵阳',
    ),
    'list' => 
    array (
      260101 => 
      array (
        'id' => '260101',
        'name' => '贵阳',
      ),
      260102 => 
      array (
        'id' => '260102',
        'name' => '白云',
      ),
      260103 => 
      array (
        'id' => '260103',
        'name' => '花溪',
      ),
      260104 => 
      array (
        'id' => '260104',
        'name' => '乌当',
      ),
      260105 => 
      array (
        'id' => '260105',
        'name' => '息烽',
      ),
      260106 => 
      array (
        'id' => '260106',
        'name' => '开阳',
      ),
      260107 => 
      array (
        'id' => '260107',
        'name' => '修文',
      ),
      260108 => 
      array (
        'id' => '260108',
        'name' => '清镇',
      ),
      260109 => 
      array (
        'id' => '260109',
        'name' => '小河',
      ),
      260110 => 
      array (
        'id' => '260110',
        'name' => '云岩',
      ),
      260111 => 
      array (
        'id' => '260111',
        'name' => '南明',
      ),
    ),
  ),
  2602 => 
  array (
    'province' => 
    array (
      'id' => '26',
      'name' => '贵州',
    ),
    'city' => 
    array (
      'id' => '2602',
      'name' => '遵义',
    ),
    'list' => 
    array (
      260201 => 
      array (
        'id' => '260201',
        'name' => '遵义',
      ),
      260202 => 
      array (
        'id' => '260202',
        'name' => '遵义县',
      ),
      260203 => 
      array (
        'id' => '260203',
        'name' => '仁怀',
      ),
      260204 => 
      array (
        'id' => '260204',
        'name' => '绥阳',
      ),
      260205 => 
      array (
        'id' => '260205',
        'name' => '湄潭',
      ),
      260206 => 
      array (
        'id' => '260206',
        'name' => '凤冈',
      ),
      260207 => 
      array (
        'id' => '260207',
        'name' => '桐梓',
      ),
      260208 => 
      array (
        'id' => '260208',
        'name' => '赤水',
      ),
      260209 => 
      array (
        'id' => '260209',
        'name' => '习水',
      ),
      260210 => 
      array (
        'id' => '260210',
        'name' => '道真',
      ),
      260211 => 
      array (
        'id' => '260211',
        'name' => '正安',
      ),
      260212 => 
      array (
        'id' => '260212',
        'name' => '务川',
      ),
      260213 => 
      array (
        'id' => '260213',
        'name' => '余庆',
      ),
      260214 => 
      array (
        'id' => '260214',
        'name' => '汇川',
      ),
      260215 => 
      array (
        'id' => '260215',
        'name' => '红花岗',
      ),
    ),
  ),
  2603 => 
  array (
    'province' => 
    array (
      'id' => '26',
      'name' => '贵州',
    ),
    'city' => 
    array (
      'id' => '2603',
      'name' => '安顺',
    ),
    'list' => 
    array (
      260301 => 
      array (
        'id' => '260301',
        'name' => '安顺',
      ),
      260302 => 
      array (
        'id' => '260302',
        'name' => '普定',
      ),
      260303 => 
      array (
        'id' => '260303',
        'name' => '镇宁',
      ),
      260304 => 
      array (
        'id' => '260304',
        'name' => '平坝',
      ),
      260305 => 
      array (
        'id' => '260305',
        'name' => '紫云',
      ),
      260306 => 
      array (
        'id' => '260306',
        'name' => '关岭',
      ),
    ),
  ),
  2604 => 
  array (
    'province' => 
    array (
      'id' => '26',
      'name' => '贵州',
    ),
    'city' => 
    array (
      'id' => '2604',
      'name' => '黔南',
    ),
    'list' => 
    array (
      260401 => 
      array (
        'id' => '260401',
        'name' => '都匀',
      ),
      260402 => 
      array (
        'id' => '260402',
        'name' => '贵定',
      ),
      260403 => 
      array (
        'id' => '260403',
        'name' => '瓮安',
      ),
      260404 => 
      array (
        'id' => '260404',
        'name' => '长顺',
      ),
      260405 => 
      array (
        'id' => '260405',
        'name' => '福泉',
      ),
      260406 => 
      array (
        'id' => '260406',
        'name' => '惠水',
      ),
      260407 => 
      array (
        'id' => '260407',
        'name' => '龙里',
      ),
      260408 => 
      array (
        'id' => '260408',
        'name' => '罗甸',
      ),
      260409 => 
      array (
        'id' => '260409',
        'name' => '平塘',
      ),
      260410 => 
      array (
        'id' => '260410',
        'name' => '独山',
      ),
      260411 => 
      array (
        'id' => '260411',
        'name' => '三都',
      ),
      260412 => 
      array (
        'id' => '260412',
        'name' => '荔波',
      ),
    ),
  ),
  2605 => 
  array (
    'province' => 
    array (
      'id' => '26',
      'name' => '贵州',
    ),
    'city' => 
    array (
      'id' => '2605',
      'name' => '黔东南',
    ),
    'list' => 
    array (
      260501 => 
      array (
        'id' => '260501',
        'name' => '凯里',
      ),
      260502 => 
      array (
        'id' => '260502',
        'name' => '岑巩',
      ),
      260503 => 
      array (
        'id' => '260503',
        'name' => '施秉',
      ),
      260504 => 
      array (
        'id' => '260504',
        'name' => '镇远',
      ),
      260505 => 
      array (
        'id' => '260505',
        'name' => '黄平',
      ),
      260506 => 
      array (
        'id' => '260506',
        'name' => '麻江',
      ),
      260507 => 
      array (
        'id' => '260507',
        'name' => '丹寨',
      ),
      260508 => 
      array (
        'id' => '260508',
        'name' => '三穗',
      ),
      260509 => 
      array (
        'id' => '260509',
        'name' => '台江',
      ),
      260510 => 
      array (
        'id' => '260510',
        'name' => '剑河',
      ),
      260511 => 
      array (
        'id' => '260511',
        'name' => '雷山',
      ),
      260512 => 
      array (
        'id' => '260512',
        'name' => '黎平',
      ),
      260513 => 
      array (
        'id' => '260513',
        'name' => '天柱',
      ),
      260514 => 
      array (
        'id' => '260514',
        'name' => '锦屏',
      ),
      260515 => 
      array (
        'id' => '260515',
        'name' => '榕江',
      ),
      260516 => 
      array (
        'id' => '260516',
        'name' => '从江',
      ),
    ),
  ),
  2606 => 
  array (
    'province' => 
    array (
      'id' => '26',
      'name' => '贵州',
    ),
    'city' => 
    array (
      'id' => '2606',
      'name' => '铜仁',
    ),
    'list' => 
    array (
      260601 => 
      array (
        'id' => '260601',
        'name' => '铜仁',
      ),
      260602 => 
      array (
        'id' => '260602',
        'name' => '江口',
      ),
      260603 => 
      array (
        'id' => '260603',
        'name' => '玉屏',
      ),
      260604 => 
      array (
        'id' => '260604',
        'name' => '万山',
      ),
      260605 => 
      array (
        'id' => '260605',
        'name' => '思南',
      ),
      260606 => 
      array (
        'id' => '260606',
        'name' => '印江',
      ),
      260607 => 
      array (
        'id' => '260607',
        'name' => '石阡',
      ),
      260608 => 
      array (
        'id' => '260608',
        'name' => '沿河',
      ),
      260609 => 
      array (
        'id' => '260609',
        'name' => '德江',
      ),
      260610 => 
      array (
        'id' => '260610',
        'name' => '松桃',
      ),
    ),
  ),
  2607 => 
  array (
    'province' => 
    array (
      'id' => '26',
      'name' => '贵州',
    ),
    'city' => 
    array (
      'id' => '2607',
      'name' => '毕节',
    ),
    'list' => 
    array (
      260701 => 
      array (
        'id' => '260701',
        'name' => '毕节',
      ),
      260702 => 
      array (
        'id' => '260702',
        'name' => '赫章',
      ),
      260703 => 
      array (
        'id' => '260703',
        'name' => '金沙',
      ),
      260704 => 
      array (
        'id' => '260704',
        'name' => '威宁',
      ),
      260705 => 
      array (
        'id' => '260705',
        'name' => '大方',
      ),
      260706 => 
      array (
        'id' => '260706',
        'name' => '纳雍',
      ),
      260707 => 
      array (
        'id' => '260707',
        'name' => '织金',
      ),
      260708 => 
      array (
        'id' => '260708',
        'name' => '黔西',
      ),
    ),
  ),
  2608 => 
  array (
    'province' => 
    array (
      'id' => '26',
      'name' => '贵州',
    ),
    'city' => 
    array (
      'id' => '2608',
      'name' => '六盘水',
    ),
    'list' => 
    array (
      260801 => 
      array (
        'id' => '260801',
        'name' => '水城',
      ),
      260802 => 
      array (
        'id' => '260802',
        'name' => '六枝',
      ),
      260803 => 
      array (
        'id' => '260803',
        'name' => '盘县',
      ),
    ),
  ),
  2609 => 
  array (
    'province' => 
    array (
      'id' => '26',
      'name' => '贵州',
    ),
    'city' => 
    array (
      'id' => '2609',
      'name' => '黔西南',
    ),
    'list' => 
    array (
      260901 => 
      array (
        'id' => '260901',
        'name' => '兴义',
      ),
      260902 => 
      array (
        'id' => '260902',
        'name' => '晴隆',
      ),
      260903 => 
      array (
        'id' => '260903',
        'name' => '兴仁',
      ),
      260904 => 
      array (
        'id' => '260904',
        'name' => '贞丰',
      ),
      260905 => 
      array (
        'id' => '260905',
        'name' => '望谟',
      ),
      260906 => 
      array (
        'id' => '260906',
        'name' => '安龙',
      ),
      260907 => 
      array (
        'id' => '260907',
        'name' => '册亨',
      ),
      260908 => 
      array (
        'id' => '260908',
        'name' => '普安',
      ),
    ),
  ),
  2701 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2701',
      'name' => '成都',
    ),
    'list' => 
    array (
      270101 => 
      array (
        'id' => '270101',
        'name' => '成都',
      ),
      270102 => 
      array (
        'id' => '270102',
        'name' => '龙泉驿',
      ),
      270103 => 
      array (
        'id' => '270103',
        'name' => '新都',
      ),
      270104 => 
      array (
        'id' => '270104',
        'name' => '温江',
      ),
      270105 => 
      array (
        'id' => '270105',
        'name' => '金堂',
      ),
      270106 => 
      array (
        'id' => '270106',
        'name' => '双流',
      ),
      270107 => 
      array (
        'id' => '270107',
        'name' => '郫县',
      ),
      270108 => 
      array (
        'id' => '270108',
        'name' => '大邑',
      ),
      270109 => 
      array (
        'id' => '270109',
        'name' => '蒲江',
      ),
      270110 => 
      array (
        'id' => '270110',
        'name' => '新津',
      ),
      270111 => 
      array (
        'id' => '270111',
        'name' => '都江堰',
      ),
      270112 => 
      array (
        'id' => '270112',
        'name' => '彭州',
      ),
      270113 => 
      array (
        'id' => '270113',
        'name' => '邛崃',
      ),
      270114 => 
      array (
        'id' => '270114',
        'name' => '崇州',
      ),
    ),
  ),
  2702 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2702',
      'name' => '攀枝花',
    ),
    'list' => 
    array (
      270201 => 
      array (
        'id' => '270201',
        'name' => '攀枝花',
      ),
      270202 => 
      array (
        'id' => '270202',
        'name' => '仁和',
      ),
      270203 => 
      array (
        'id' => '270203',
        'name' => '米易',
      ),
      270204 => 
      array (
        'id' => '270204',
        'name' => '盐边',
      ),
    ),
  ),
  2703 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2703',
      'name' => '自贡',
    ),
    'list' => 
    array (
      270301 => 
      array (
        'id' => '270301',
        'name' => '自贡',
      ),
      270302 => 
      array (
        'id' => '270302',
        'name' => '富顺',
      ),
      270303 => 
      array (
        'id' => '270303',
        'name' => '荣县',
      ),
    ),
  ),
  2704 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2704',
      'name' => '绵阳',
    ),
    'list' => 
    array (
      270401 => 
      array (
        'id' => '270401',
        'name' => '绵阳',
      ),
      270402 => 
      array (
        'id' => '270402',
        'name' => '三台',
      ),
      270403 => 
      array (
        'id' => '270403',
        'name' => '盐亭',
      ),
      270404 => 
      array (
        'id' => '270404',
        'name' => '安县',
      ),
      270405 => 
      array (
        'id' => '270405',
        'name' => '梓潼',
      ),
      270406 => 
      array (
        'id' => '270406',
        'name' => '北川',
      ),
      270407 => 
      array (
        'id' => '270407',
        'name' => '平武',
      ),
      270408 => 
      array (
        'id' => '270408',
        'name' => '江油',
      ),
    ),
  ),
  2705 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2705',
      'name' => '南充',
    ),
    'list' => 
    array (
      270501 => 
      array (
        'id' => '270501',
        'name' => '南充',
      ),
      270502 => 
      array (
        'id' => '270502',
        'name' => '南部',
      ),
      270503 => 
      array (
        'id' => '270503',
        'name' => '营山',
      ),
      270504 => 
      array (
        'id' => '270504',
        'name' => '蓬安',
      ),
      270505 => 
      array (
        'id' => '270505',
        'name' => '仪陇',
      ),
      270506 => 
      array (
        'id' => '270506',
        'name' => '西充',
      ),
      270507 => 
      array (
        'id' => '270507',
        'name' => '阆中',
      ),
    ),
  ),
  2706 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2706',
      'name' => '达州',
    ),
    'list' => 
    array (
      270601 => 
      array (
        'id' => '270601',
        'name' => '达州',
      ),
      270602 => 
      array (
        'id' => '270602',
        'name' => '宣汉',
      ),
      270603 => 
      array (
        'id' => '270603',
        'name' => '开江',
      ),
      270604 => 
      array (
        'id' => '270604',
        'name' => '大竹',
      ),
      270605 => 
      array (
        'id' => '270605',
        'name' => '渠县',
      ),
      270606 => 
      array (
        'id' => '270606',
        'name' => '万源',
      ),
      270607 => 
      array (
        'id' => '270607',
        'name' => '通川',
      ),
      270608 => 
      array (
        'id' => '270608',
        'name' => '达县',
      ),
    ),
  ),
  2707 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2707',
      'name' => '遂宁',
    ),
    'list' => 
    array (
      270701 => 
      array (
        'id' => '270701',
        'name' => '遂宁',
      ),
      270702 => 
      array (
        'id' => '270702',
        'name' => '蓬溪',
      ),
      270703 => 
      array (
        'id' => '270703',
        'name' => '射洪',
      ),
    ),
  ),
  2708 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2708',
      'name' => '广安',
    ),
    'list' => 
    array (
      270801 => 
      array (
        'id' => '270801',
        'name' => '广安',
      ),
      270802 => 
      array (
        'id' => '270802',
        'name' => '岳池',
      ),
      270803 => 
      array (
        'id' => '270803',
        'name' => '武胜',
      ),
      270804 => 
      array (
        'id' => '270804',
        'name' => '邻水',
      ),
      270805 => 
      array (
        'id' => '270805',
        'name' => '华蓥',
      ),
    ),
  ),
  2709 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2709',
      'name' => '巴中',
    ),
    'list' => 
    array (
      270901 => 
      array (
        'id' => '270901',
        'name' => '巴中',
      ),
      270902 => 
      array (
        'id' => '270902',
        'name' => '通江',
      ),
      270903 => 
      array (
        'id' => '270903',
        'name' => '南江',
      ),
      270904 => 
      array (
        'id' => '270904',
        'name' => '平昌',
      ),
    ),
  ),
  2710 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2710',
      'name' => '泸州',
    ),
    'list' => 
    array (
      271001 => 
      array (
        'id' => '271001',
        'name' => '泸州',
      ),
      271002 => 
      array (
        'id' => '271002',
        'name' => '泸县',
      ),
      271003 => 
      array (
        'id' => '271003',
        'name' => '合江',
      ),
      271004 => 
      array (
        'id' => '271004',
        'name' => '叙永',
      ),
      271005 => 
      array (
        'id' => '271005',
        'name' => '古蔺',
      ),
      271006 => 
      array (
        'id' => '271006',
        'name' => '纳溪',
      ),
    ),
  ),
  2711 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2711',
      'name' => '宜宾',
    ),
    'list' => 
    array (
      271101 => 
      array (
        'id' => '271101',
        'name' => '宜宾',
      ),
      271102 => 
      array (
        'id' => '271102',
        'name' => '宜宾县',
      ),
      271103 => 
      array (
        'id' => '271103',
        'name' => '南溪',
      ),
      271104 => 
      array (
        'id' => '271104',
        'name' => '江安',
      ),
      271105 => 
      array (
        'id' => '271105',
        'name' => '长宁',
      ),
      271106 => 
      array (
        'id' => '271106',
        'name' => '高县',
      ),
      271107 => 
      array (
        'id' => '271107',
        'name' => '珙县',
      ),
      271108 => 
      array (
        'id' => '271108',
        'name' => '筠连',
      ),
      271109 => 
      array (
        'id' => '271109',
        'name' => '兴文',
      ),
      271110 => 
      array (
        'id' => '271110',
        'name' => '屏山',
      ),
    ),
  ),
  2712 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2712',
      'name' => '内江',
    ),
    'list' => 
    array (
      271201 => 
      array (
        'id' => '271201',
        'name' => '内江',
      ),
      271202 => 
      array (
        'id' => '271202',
        'name' => '东兴',
      ),
      271203 => 
      array (
        'id' => '271203',
        'name' => '威远',
      ),
      271204 => 
      array (
        'id' => '271204',
        'name' => '资中',
      ),
      271205 => 
      array (
        'id' => '271205',
        'name' => '隆昌',
      ),
    ),
  ),
  2713 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2713',
      'name' => '资阳',
    ),
    'list' => 
    array (
      271301 => 
      array (
        'id' => '271301',
        'name' => '资阳',
      ),
      271302 => 
      array (
        'id' => '271302',
        'name' => '安岳',
      ),
      271303 => 
      array (
        'id' => '271303',
        'name' => '乐至',
      ),
      271304 => 
      array (
        'id' => '271304',
        'name' => '简阳',
      ),
    ),
  ),
  2714 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2714',
      'name' => '乐山',
    ),
    'list' => 
    array (
      271401 => 
      array (
        'id' => '271401',
        'name' => '乐山',
      ),
      271402 => 
      array (
        'id' => '271402',
        'name' => '犍为',
      ),
      271403 => 
      array (
        'id' => '271403',
        'name' => '井研',
      ),
      271404 => 
      array (
        'id' => '271404',
        'name' => '夹江',
      ),
      271405 => 
      array (
        'id' => '271405',
        'name' => '沐川',
      ),
      271406 => 
      array (
        'id' => '271406',
        'name' => '峨边',
      ),
      271407 => 
      array (
        'id' => '271407',
        'name' => '马边',
      ),
      271408 => 
      array (
        'id' => '271408',
        'name' => '峨眉',
      ),
      271409 => 
      array (
        'id' => '271409',
        'name' => '峨眉山',
      ),
    ),
  ),
  2715 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2715',
      'name' => '眉山',
    ),
    'list' => 
    array (
      271501 => 
      array (
        'id' => '271501',
        'name' => '眉山',
      ),
      271502 => 
      array (
        'id' => '271502',
        'name' => '仁寿',
      ),
      271503 => 
      array (
        'id' => '271503',
        'name' => '彭山',
      ),
      271504 => 
      array (
        'id' => '271504',
        'name' => '洪雅',
      ),
      271505 => 
      array (
        'id' => '271505',
        'name' => '丹棱',
      ),
      271506 => 
      array (
        'id' => '271506',
        'name' => '青神',
      ),
    ),
  ),
  2716 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2716',
      'name' => '凉山',
    ),
    'list' => 
    array (
      271601 => 
      array (
        'id' => '271601',
        'name' => '凉山',
      ),
      271602 => 
      array (
        'id' => '271602',
        'name' => '木里',
      ),
      271603 => 
      array (
        'id' => '271603',
        'name' => '盐源',
      ),
      271604 => 
      array (
        'id' => '271604',
        'name' => '德昌',
      ),
      271605 => 
      array (
        'id' => '271605',
        'name' => '会理',
      ),
      271606 => 
      array (
        'id' => '271606',
        'name' => '会东',
      ),
      271607 => 
      array (
        'id' => '271607',
        'name' => '宁南',
      ),
      271608 => 
      array (
        'id' => '271608',
        'name' => '普格',
      ),
      271609 => 
      array (
        'id' => '271609',
        'name' => '西昌',
      ),
      271610 => 
      array (
        'id' => '271610',
        'name' => '金阳',
      ),
      271611 => 
      array (
        'id' => '271611',
        'name' => '昭觉',
      ),
      271612 => 
      array (
        'id' => '271612',
        'name' => '喜德',
      ),
      271613 => 
      array (
        'id' => '271613',
        'name' => '冕宁',
      ),
      271614 => 
      array (
        'id' => '271614',
        'name' => '越西',
      ),
      271615 => 
      array (
        'id' => '271615',
        'name' => '甘洛',
      ),
      271616 => 
      array (
        'id' => '271616',
        'name' => '雷波',
      ),
      271617 => 
      array (
        'id' => '271617',
        'name' => '美姑',
      ),
      271618 => 
      array (
        'id' => '271618',
        'name' => '布拖',
      ),
    ),
  ),
  2717 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2717',
      'name' => '雅安',
    ),
    'list' => 
    array (
      271701 => 
      array (
        'id' => '271701',
        'name' => '雅安',
      ),
      271702 => 
      array (
        'id' => '271702',
        'name' => '名山',
      ),
      271703 => 
      array (
        'id' => '271703',
        'name' => '荥经',
      ),
      271704 => 
      array (
        'id' => '271704',
        'name' => '汉源',
      ),
      271705 => 
      array (
        'id' => '271705',
        'name' => '石棉',
      ),
      271706 => 
      array (
        'id' => '271706',
        'name' => '天全',
      ),
      271707 => 
      array (
        'id' => '271707',
        'name' => '芦山',
      ),
      271708 => 
      array (
        'id' => '271708',
        'name' => '宝兴',
      ),
    ),
  ),
  2718 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2718',
      'name' => '甘孜',
    ),
    'list' => 
    array (
      271801 => 
      array (
        'id' => '271801',
        'name' => '甘孜',
      ),
      271802 => 
      array (
        'id' => '271802',
        'name' => '康定',
      ),
      271803 => 
      array (
        'id' => '271803',
        'name' => '泸定',
      ),
      271804 => 
      array (
        'id' => '271804',
        'name' => '丹巴',
      ),
      271805 => 
      array (
        'id' => '271805',
        'name' => '九龙',
      ),
      271806 => 
      array (
        'id' => '271806',
        'name' => '雅江',
      ),
      271807 => 
      array (
        'id' => '271807',
        'name' => '道孚',
      ),
      271808 => 
      array (
        'id' => '271808',
        'name' => '炉霍',
      ),
      271809 => 
      array (
        'id' => '271809',
        'name' => '新龙',
      ),
      271810 => 
      array (
        'id' => '271810',
        'name' => '德格',
      ),
      271811 => 
      array (
        'id' => '271811',
        'name' => '白玉',
      ),
      271812 => 
      array (
        'id' => '271812',
        'name' => '石渠',
      ),
      271813 => 
      array (
        'id' => '271813',
        'name' => '色达',
      ),
      271814 => 
      array (
        'id' => '271814',
        'name' => '理塘',
      ),
      271815 => 
      array (
        'id' => '271815',
        'name' => '巴塘',
      ),
      271816 => 
      array (
        'id' => '271816',
        'name' => '乡城',
      ),
      271817 => 
      array (
        'id' => '271817',
        'name' => '稻城',
      ),
      271818 => 
      array (
        'id' => '271818',
        'name' => '得荣',
      ),
    ),
  ),
  2719 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2719',
      'name' => '阿坝',
    ),
    'list' => 
    array (
      271901 => 
      array (
        'id' => '271901',
        'name' => '阿坝',
      ),
      271902 => 
      array (
        'id' => '271902',
        'name' => '汶川',
      ),
      271903 => 
      array (
        'id' => '271903',
        'name' => '理县',
      ),
      271904 => 
      array (
        'id' => '271904',
        'name' => '茂县',
      ),
      271905 => 
      array (
        'id' => '271905',
        'name' => '松潘',
      ),
      271906 => 
      array (
        'id' => '271906',
        'name' => '九寨沟',
      ),
      271907 => 
      array (
        'id' => '271907',
        'name' => '金川',
      ),
      271908 => 
      array (
        'id' => '271908',
        'name' => '小金',
      ),
      271909 => 
      array (
        'id' => '271909',
        'name' => '黑水',
      ),
      271910 => 
      array (
        'id' => '271910',
        'name' => '马尔康',
      ),
      271911 => 
      array (
        'id' => '271911',
        'name' => '壤塘',
      ),
      271912 => 
      array (
        'id' => '271912',
        'name' => '若尔盖',
      ),
      271913 => 
      array (
        'id' => '271913',
        'name' => '红原',
      ),
    ),
  ),
  2720 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2720',
      'name' => '德阳',
    ),
    'list' => 
    array (
      272001 => 
      array (
        'id' => '272001',
        'name' => '德阳',
      ),
      272002 => 
      array (
        'id' => '272002',
        'name' => '中江',
      ),
      272003 => 
      array (
        'id' => '272003',
        'name' => '广汉',
      ),
      272004 => 
      array (
        'id' => '272004',
        'name' => '什邡',
      ),
      272005 => 
      array (
        'id' => '272005',
        'name' => '绵竹',
      ),
      272006 => 
      array (
        'id' => '272006',
        'name' => '罗江',
      ),
    ),
  ),
  2721 => 
  array (
    'province' => 
    array (
      'id' => '27',
      'name' => '四川',
    ),
    'city' => 
    array (
      'id' => '2721',
      'name' => '广元',
    ),
    'list' => 
    array (
      272101 => 
      array (
        'id' => '272101',
        'name' => '广元',
      ),
      272102 => 
      array (
        'id' => '272102',
        'name' => '旺苍',
      ),
      272103 => 
      array (
        'id' => '272103',
        'name' => '青川',
      ),
      272104 => 
      array (
        'id' => '272104',
        'name' => '剑阁',
      ),
      272105 => 
      array (
        'id' => '272105',
        'name' => '苍溪',
      ),
    ),
  ),
  2801 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2801',
      'name' => '广州',
    ),
    'list' => 
    array (
      280101 => 
      array (
        'id' => '280101',
        'name' => '广州',
      ),
      280102 => 
      array (
        'id' => '280102',
        'name' => '番禺',
      ),
      280103 => 
      array (
        'id' => '280103',
        'name' => '从化',
      ),
      280104 => 
      array (
        'id' => '280104',
        'name' => '增城',
      ),
      280105 => 
      array (
        'id' => '280105',
        'name' => '花都',
      ),
    ),
  ),
  2802 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2802',
      'name' => '韶关',
    ),
    'list' => 
    array (
      280201 => 
      array (
        'id' => '280201',
        'name' => '韶关',
      ),
      280202 => 
      array (
        'id' => '280202',
        'name' => '乳源',
      ),
      280203 => 
      array (
        'id' => '280203',
        'name' => '始兴',
      ),
      280204 => 
      array (
        'id' => '280204',
        'name' => '翁源',
      ),
      280205 => 
      array (
        'id' => '280205',
        'name' => '乐昌',
      ),
      280206 => 
      array (
        'id' => '280206',
        'name' => '仁化',
      ),
      280207 => 
      array (
        'id' => '280207',
        'name' => '南雄',
      ),
      280208 => 
      array (
        'id' => '280208',
        'name' => '新丰',
      ),
      280209 => 
      array (
        'id' => '280209',
        'name' => '曲江',
      ),
      280210 => 
      array (
        'id' => '280210',
        'name' => '浈江',
      ),
      280211 => 
      array (
        'id' => '280211',
        'name' => '武江',
      ),
    ),
  ),
  2803 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2803',
      'name' => '惠州',
    ),
    'list' => 
    array (
      280301 => 
      array (
        'id' => '280301',
        'name' => '惠州',
      ),
      280302 => 
      array (
        'id' => '280302',
        'name' => '博罗',
      ),
      280303 => 
      array (
        'id' => '280303',
        'name' => '惠阳',
      ),
      280304 => 
      array (
        'id' => '280304',
        'name' => '惠东',
      ),
      280305 => 
      array (
        'id' => '280305',
        'name' => '龙门',
      ),
    ),
  ),
  2804 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2804',
      'name' => '梅州',
    ),
    'list' => 
    array (
      280401 => 
      array (
        'id' => '280401',
        'name' => '梅州',
      ),
      280402 => 
      array (
        'id' => '280402',
        'name' => '兴宁',
      ),
      280403 => 
      array (
        'id' => '280403',
        'name' => '蕉岭',
      ),
      280404 => 
      array (
        'id' => '280404',
        'name' => '大埔',
      ),
      280405 => 
      array (
        'id' => '280405',
        'name' => '丰顺',
      ),
      280406 => 
      array (
        'id' => '280406',
        'name' => '平远',
      ),
      280407 => 
      array (
        'id' => '280407',
        'name' => '五华',
      ),
      280408 => 
      array (
        'id' => '280408',
        'name' => '梅县',
      ),
    ),
  ),
  2805 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2805',
      'name' => '汕头',
    ),
    'list' => 
    array (
      280501 => 
      array (
        'id' => '280501',
        'name' => '汕头',
      ),
      280502 => 
      array (
        'id' => '280502',
        'name' => '潮阳',
      ),
      280503 => 
      array (
        'id' => '280503',
        'name' => '澄海',
      ),
      280504 => 
      array (
        'id' => '280504',
        'name' => '南澳',
      ),
    ),
  ),
  2806 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2806',
      'name' => '深圳',
    ),
    'list' => 
    array (
      280601 => 
      array (
        'id' => '280601',
        'name' => '深圳',
      ),
    ),
  ),
  2807 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2807',
      'name' => '珠海',
    ),
    'list' => 
    array (
      280701 => 
      array (
        'id' => '280701',
        'name' => '珠海',
      ),
      280702 => 
      array (
        'id' => '280702',
        'name' => '斗门',
      ),
      280703 => 
      array (
        'id' => '280703',
        'name' => '金湾',
      ),
    ),
  ),
  2808 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2808',
      'name' => '佛山',
    ),
    'list' => 
    array (
      280801 => 
      array (
        'id' => '280801',
        'name' => '佛山',
      ),
      280802 => 
      array (
        'id' => '280802',
        'name' => '顺德',
      ),
      280803 => 
      array (
        'id' => '280803',
        'name' => '三水',
      ),
      280804 => 
      array (
        'id' => '280804',
        'name' => '南海',
      ),
      280805 => 
      array (
        'id' => '280805',
        'name' => '高明',
      ),
    ),
  ),
  2809 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2809',
      'name' => '肇庆',
    ),
    'list' => 
    array (
      280901 => 
      array (
        'id' => '280901',
        'name' => '肇庆',
      ),
      280902 => 
      array (
        'id' => '280902',
        'name' => '广宁',
      ),
      280903 => 
      array (
        'id' => '280903',
        'name' => '四会',
      ),
      280904 => 
      array (
        'id' => '280904',
        'name' => '德庆',
      ),
      280905 => 
      array (
        'id' => '280905',
        'name' => '怀集',
      ),
      280906 => 
      array (
        'id' => '280906',
        'name' => '封开',
      ),
      280907 => 
      array (
        'id' => '280907',
        'name' => '高要',
      ),
    ),
  ),
  2810 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2810',
      'name' => '湛江',
    ),
    'list' => 
    array (
      281001 => 
      array (
        'id' => '281001',
        'name' => '湛江',
      ),
      281002 => 
      array (
        'id' => '281002',
        'name' => '吴川',
      ),
      281003 => 
      array (
        'id' => '281003',
        'name' => '雷州',
      ),
      281004 => 
      array (
        'id' => '281004',
        'name' => '徐闻',
      ),
      281005 => 
      array (
        'id' => '281005',
        'name' => '廉江',
      ),
      281006 => 
      array (
        'id' => '281006',
        'name' => '赤坎',
      ),
      281007 => 
      array (
        'id' => '281007',
        'name' => '遂溪',
      ),
      281008 => 
      array (
        'id' => '281008',
        'name' => '坡头',
      ),
      281009 => 
      array (
        'id' => '281009',
        'name' => '霞山',
      ),
      281010 => 
      array (
        'id' => '281010',
        'name' => '麻章',
      ),
    ),
  ),
  2811 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2811',
      'name' => '江门',
    ),
    'list' => 
    array (
      281101 => 
      array (
        'id' => '281101',
        'name' => '江门',
      ),
      281102 => 
      array (
        'id' => '281102',
        'name' => '开平',
      ),
      281103 => 
      array (
        'id' => '281103',
        'name' => '新会',
      ),
      281104 => 
      array (
        'id' => '281104',
        'name' => '恩平',
      ),
      281105 => 
      array (
        'id' => '281105',
        'name' => '台山',
      ),
      281106 => 
      array (
        'id' => '281106',
        'name' => '蓬江',
      ),
      281107 => 
      array (
        'id' => '281107',
        'name' => '鹤山',
      ),
      281108 => 
      array (
        'id' => '281108',
        'name' => '江海',
      ),
    ),
  ),
  2812 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2812',
      'name' => '河源',
    ),
    'list' => 
    array (
      281201 => 
      array (
        'id' => '281201',
        'name' => '河源',
      ),
      281202 => 
      array (
        'id' => '281202',
        'name' => '紫金',
      ),
      281203 => 
      array (
        'id' => '281203',
        'name' => '连平',
      ),
      281204 => 
      array (
        'id' => '281204',
        'name' => '和平',
      ),
      281205 => 
      array (
        'id' => '281205',
        'name' => '龙川',
      ),
      281206 => 
      array (
        'id' => '281206',
        'name' => '东源',
      ),
    ),
  ),
  2813 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2813',
      'name' => '清远',
    ),
    'list' => 
    array (
      281301 => 
      array (
        'id' => '281301',
        'name' => '清远',
      ),
      281302 => 
      array (
        'id' => '281302',
        'name' => '连南',
      ),
      281303 => 
      array (
        'id' => '281303',
        'name' => '连州',
      ),
      281304 => 
      array (
        'id' => '281304',
        'name' => '连山',
      ),
      281305 => 
      array (
        'id' => '281305',
        'name' => '阳山',
      ),
      281306 => 
      array (
        'id' => '281306',
        'name' => '佛冈',
      ),
      281307 => 
      array (
        'id' => '281307',
        'name' => '英德',
      ),
      281308 => 
      array (
        'id' => '281308',
        'name' => '清新',
      ),
    ),
  ),
  2814 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2814',
      'name' => '云浮',
    ),
    'list' => 
    array (
      281401 => 
      array (
        'id' => '281401',
        'name' => '云浮',
      ),
      281402 => 
      array (
        'id' => '281402',
        'name' => '罗定',
      ),
      281403 => 
      array (
        'id' => '281403',
        'name' => '新兴',
      ),
      281404 => 
      array (
        'id' => '281404',
        'name' => '郁南',
      ),
      281405 => 
      array (
        'id' => '281405',
        'name' => '云安',
      ),
    ),
  ),
  2815 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2815',
      'name' => '潮州',
    ),
    'list' => 
    array (
      281501 => 
      array (
        'id' => '281501',
        'name' => '潮州',
      ),
      281502 => 
      array (
        'id' => '281502',
        'name' => '饶平',
      ),
      281503 => 
      array (
        'id' => '281503',
        'name' => '潮安',
      ),
    ),
  ),
  2816 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2816',
      'name' => '东莞',
    ),
    'list' => 
    array (
      281601 => 
      array (
        'id' => '281601',
        'name' => '东莞',
      ),
    ),
  ),
  2817 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2817',
      'name' => '中山',
    ),
    'list' => 
    array (
      281701 => 
      array (
        'id' => '281701',
        'name' => '中山',
      ),
    ),
  ),
  2818 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2818',
      'name' => '阳江',
    ),
    'list' => 
    array (
      281801 => 
      array (
        'id' => '281801',
        'name' => '阳江',
      ),
      281802 => 
      array (
        'id' => '281802',
        'name' => '阳春',
      ),
      281803 => 
      array (
        'id' => '281803',
        'name' => '阳东',
      ),
      281804 => 
      array (
        'id' => '281804',
        'name' => '阳西',
      ),
    ),
  ),
  2819 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2819',
      'name' => '揭阳',
    ),
    'list' => 
    array (
      281901 => 
      array (
        'id' => '281901',
        'name' => '揭阳',
      ),
      281902 => 
      array (
        'id' => '281902',
        'name' => '揭西',
      ),
      281903 => 
      array (
        'id' => '281903',
        'name' => '普宁',
      ),
      281904 => 
      array (
        'id' => '281904',
        'name' => '惠来',
      ),
      281905 => 
      array (
        'id' => '281905',
        'name' => '揭东',
      ),
    ),
  ),
  2820 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2820',
      'name' => '茂名',
    ),
    'list' => 
    array (
      282001 => 
      array (
        'id' => '282001',
        'name' => '茂名',
      ),
      282002 => 
      array (
        'id' => '282002',
        'name' => '高州',
      ),
      282003 => 
      array (
        'id' => '282003',
        'name' => '化州',
      ),
      282004 => 
      array (
        'id' => '282004',
        'name' => '电白',
      ),
      282005 => 
      array (
        'id' => '282005',
        'name' => '信宜',
      ),
      282006 => 
      array (
        'id' => '282006',
        'name' => '茂港',
      ),
    ),
  ),
  2821 => 
  array (
    'province' => 
    array (
      'id' => '28',
      'name' => '广东',
    ),
    'city' => 
    array (
      'id' => '2821',
      'name' => '汕尾',
    ),
    'list' => 
    array (
      282101 => 
      array (
        'id' => '282101',
        'name' => '汕尾',
      ),
      282102 => 
      array (
        'id' => '282102',
        'name' => '海丰',
      ),
      282103 => 
      array (
        'id' => '282103',
        'name' => '陆丰',
      ),
      282104 => 
      array (
        'id' => '282104',
        'name' => '陆河',
      ),
    ),
  ),
  2901 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2901',
      'name' => '昆明',
    ),
    'list' => 
    array (
      290101 => 
      array (
        'id' => '290101',
        'name' => '昆明',
      ),
      290102 => 
      array (
        'id' => '290102',
        'name' => '东川',
      ),
      290103 => 
      array (
        'id' => '290103',
        'name' => '寻甸',
      ),
      290104 => 
      array (
        'id' => '290104',
        'name' => '晋宁',
      ),
      290105 => 
      array (
        'id' => '290105',
        'name' => '宜良',
      ),
      290106 => 
      array (
        'id' => '290106',
        'name' => '石林',
      ),
      290107 => 
      array (
        'id' => '290107',
        'name' => '呈贡',
      ),
      290108 => 
      array (
        'id' => '290108',
        'name' => '富民',
      ),
      290109 => 
      array (
        'id' => '290109',
        'name' => '嵩明',
      ),
      290110 => 
      array (
        'id' => '290110',
        'name' => '禄劝',
      ),
      290111 => 
      array (
        'id' => '290111',
        'name' => '安宁',
      ),
      290112 => 
      array (
        'id' => '290112',
        'name' => '太华山',
      ),
    ),
  ),
  2902 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2902',
      'name' => '大理',
    ),
    'list' => 
    array (
      290201 => 
      array (
        'id' => '290201',
        'name' => '大理',
      ),
      290202 => 
      array (
        'id' => '290202',
        'name' => '云龙',
      ),
      290203 => 
      array (
        'id' => '290203',
        'name' => '漾濞',
      ),
      290204 => 
      array (
        'id' => '290204',
        'name' => '永平',
      ),
      290205 => 
      array (
        'id' => '290205',
        'name' => '宾川',
      ),
      290206 => 
      array (
        'id' => '290206',
        'name' => '弥渡',
      ),
      290207 => 
      array (
        'id' => '290207',
        'name' => '祥云',
      ),
      290208 => 
      array (
        'id' => '290208',
        'name' => '巍山',
      ),
      290209 => 
      array (
        'id' => '290209',
        'name' => '剑川',
      ),
      290210 => 
      array (
        'id' => '290210',
        'name' => '洱源',
      ),
      290211 => 
      array (
        'id' => '290211',
        'name' => '鹤庆',
      ),
      290212 => 
      array (
        'id' => '290212',
        'name' => '南涧',
      ),
    ),
  ),
  2903 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2903',
      'name' => '红河',
    ),
    'list' => 
    array (
      290301 => 
      array (
        'id' => '290301',
        'name' => '红河',
      ),
      290302 => 
      array (
        'id' => '290302',
        'name' => '石屏',
      ),
      290303 => 
      array (
        'id' => '290303',
        'name' => '建水',
      ),
      290304 => 
      array (
        'id' => '290304',
        'name' => '弥勒',
      ),
      290305 => 
      array (
        'id' => '290305',
        'name' => '元阳',
      ),
      290306 => 
      array (
        'id' => '290306',
        'name' => '绿春',
      ),
      290307 => 
      array (
        'id' => '290307',
        'name' => '开远',
      ),
      290308 => 
      array (
        'id' => '290308',
        'name' => '个旧',
      ),
      290309 => 
      array (
        'id' => '290309',
        'name' => '蒙自',
      ),
      290310 => 
      array (
        'id' => '290310',
        'name' => '屏边',
      ),
      290311 => 
      array (
        'id' => '290311',
        'name' => '泸西',
      ),
      290312 => 
      array (
        'id' => '290312',
        'name' => '金平',
      ),
      290313 => 
      array (
        'id' => '290313',
        'name' => '河口',
      ),
    ),
  ),
  2904 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2904',
      'name' => '曲靖',
    ),
    'list' => 
    array (
      290401 => 
      array (
        'id' => '290401',
        'name' => '曲靖',
      ),
      290402 => 
      array (
        'id' => '290402',
        'name' => '沾益',
      ),
      290403 => 
      array (
        'id' => '290403',
        'name' => '陆良',
      ),
      290404 => 
      array (
        'id' => '290404',
        'name' => '富源',
      ),
      290405 => 
      array (
        'id' => '290405',
        'name' => '马龙',
      ),
      290406 => 
      array (
        'id' => '290406',
        'name' => '师宗',
      ),
      290407 => 
      array (
        'id' => '290407',
        'name' => '罗平',
      ),
      290408 => 
      array (
        'id' => '290408',
        'name' => '会泽',
      ),
      290409 => 
      array (
        'id' => '290409',
        'name' => '宣威',
      ),
    ),
  ),
  2905 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2905',
      'name' => '保山',
    ),
    'list' => 
    array (
      290501 => 
      array (
        'id' => '290501',
        'name' => '保山',
      ),
      290502 => 
      array (
        'id' => '290502',
        'name' => '龙陵',
      ),
      290503 => 
      array (
        'id' => '290503',
        'name' => '施甸',
      ),
      290504 => 
      array (
        'id' => '290504',
        'name' => '昌宁',
      ),
      290505 => 
      array (
        'id' => '290505',
        'name' => '腾冲',
      ),
    ),
  ),
  2906 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2906',
      'name' => '文山',
    ),
    'list' => 
    array (
      290601 => 
      array (
        'id' => '290601',
        'name' => '文山',
      ),
      290602 => 
      array (
        'id' => '290602',
        'name' => '西畴',
      ),
      290603 => 
      array (
        'id' => '290603',
        'name' => '马关',
      ),
      290604 => 
      array (
        'id' => '290604',
        'name' => '麻栗坡',
      ),
      290605 => 
      array (
        'id' => '290605',
        'name' => '砚山',
      ),
      290606 => 
      array (
        'id' => '290606',
        'name' => '丘北',
      ),
      290607 => 
      array (
        'id' => '290607',
        'name' => '广南',
      ),
      290608 => 
      array (
        'id' => '290608',
        'name' => '富宁',
      ),
    ),
  ),
  2907 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2907',
      'name' => '玉溪',
    ),
    'list' => 
    array (
      290701 => 
      array (
        'id' => '290701',
        'name' => '玉溪',
      ),
      290702 => 
      array (
        'id' => '290702',
        'name' => '澄江',
      ),
      290703 => 
      array (
        'id' => '290703',
        'name' => '江川',
      ),
      290704 => 
      array (
        'id' => '290704',
        'name' => '通海',
      ),
      290705 => 
      array (
        'id' => '290705',
        'name' => '华宁',
      ),
      290706 => 
      array (
        'id' => '290706',
        'name' => '新平',
      ),
      290707 => 
      array (
        'id' => '290707',
        'name' => '易门',
      ),
      290708 => 
      array (
        'id' => '290708',
        'name' => '峨山',
      ),
      290709 => 
      array (
        'id' => '290709',
        'name' => '元江',
      ),
    ),
  ),
  2908 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2908',
      'name' => '楚雄',
    ),
    'list' => 
    array (
      290801 => 
      array (
        'id' => '290801',
        'name' => '楚雄',
      ),
      290802 => 
      array (
        'id' => '290802',
        'name' => '大姚',
      ),
      290803 => 
      array (
        'id' => '290803',
        'name' => '元谋',
      ),
      290804 => 
      array (
        'id' => '290804',
        'name' => '姚安',
      ),
      290805 => 
      array (
        'id' => '290805',
        'name' => '牟定',
      ),
      290806 => 
      array (
        'id' => '290806',
        'name' => '南华',
      ),
      290807 => 
      array (
        'id' => '290807',
        'name' => '武定',
      ),
      290808 => 
      array (
        'id' => '290808',
        'name' => '禄丰',
      ),
      290809 => 
      array (
        'id' => '290809',
        'name' => '双柏',
      ),
      290810 => 
      array (
        'id' => '290810',
        'name' => '永仁',
      ),
    ),
  ),
  2909 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2909',
      'name' => '普洱',
    ),
    'list' => 
    array (
      290901 => 
      array (
        'id' => '290901',
        'name' => '普洱',
      ),
      290902 => 
      array (
        'id' => '290902',
        'name' => '景谷',
      ),
      290903 => 
      array (
        'id' => '290903',
        'name' => '景东',
      ),
      290904 => 
      array (
        'id' => '290904',
        'name' => '澜沧',
      ),
      290905 => 
      array (
        'id' => '290905',
        'name' => '墨江',
      ),
      290906 => 
      array (
        'id' => '290906',
        'name' => '江城',
      ),
      290907 => 
      array (
        'id' => '290907',
        'name' => '孟连',
      ),
      290908 => 
      array (
        'id' => '290908',
        'name' => '西盟',
      ),
      290909 => 
      array (
        'id' => '290909',
        'name' => '镇沅',
      ),
      290910 => 
      array (
        'id' => '290910',
        'name' => '宁洱',
      ),
    ),
  ),
  2910 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2910',
      'name' => '昭通',
    ),
    'list' => 
    array (
      291001 => 
      array (
        'id' => '291001',
        'name' => '昭通',
      ),
      291002 => 
      array (
        'id' => '291002',
        'name' => '鲁甸',
      ),
      291003 => 
      array (
        'id' => '291003',
        'name' => '彝良',
      ),
      291004 => 
      array (
        'id' => '291004',
        'name' => '镇雄',
      ),
      291005 => 
      array (
        'id' => '291005',
        'name' => '威信',
      ),
      291006 => 
      array (
        'id' => '291006',
        'name' => '巧家',
      ),
      291007 => 
      array (
        'id' => '291007',
        'name' => '绥江',
      ),
      291008 => 
      array (
        'id' => '291008',
        'name' => '永善',
      ),
      291009 => 
      array (
        'id' => '291009',
        'name' => '盐津',
      ),
      291010 => 
      array (
        'id' => '291010',
        'name' => '大关',
      ),
      291011 => 
      array (
        'id' => '291011',
        'name' => '水富',
      ),
    ),
  ),
  2911 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2911',
      'name' => '临沧',
    ),
    'list' => 
    array (
      291101 => 
      array (
        'id' => '291101',
        'name' => '临沧',
      ),
      291102 => 
      array (
        'id' => '291102',
        'name' => '沧源',
      ),
      291103 => 
      array (
        'id' => '291103',
        'name' => '耿马',
      ),
      291104 => 
      array (
        'id' => '291104',
        'name' => '双江',
      ),
      291105 => 
      array (
        'id' => '291105',
        'name' => '凤庆',
      ),
      291106 => 
      array (
        'id' => '291106',
        'name' => '永德',
      ),
      291107 => 
      array (
        'id' => '291107',
        'name' => '云县',
      ),
      291108 => 
      array (
        'id' => '291108',
        'name' => '镇康',
      ),
    ),
  ),
  2912 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2912',
      'name' => '怒江',
    ),
    'list' => 
    array (
      291201 => 
      array (
        'id' => '291201',
        'name' => '怒江',
      ),
      291202 => 
      array (
        'id' => '291202',
        'name' => '福贡',
      ),
      291203 => 
      array (
        'id' => '291203',
        'name' => '兰坪',
      ),
      291204 => 
      array (
        'id' => '291204',
        'name' => '泸水',
      ),
      291205 => 
      array (
        'id' => '291205',
        'name' => '六库',
      ),
      291206 => 
      array (
        'id' => '291206',
        'name' => '贡山',
      ),
    ),
  ),
  2913 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2913',
      'name' => '迪庆',
    ),
    'list' => 
    array (
      291301 => 
      array (
        'id' => '291301',
        'name' => '香格里拉',
      ),
      291302 => 
      array (
        'id' => '291302',
        'name' => '德钦',
      ),
      291303 => 
      array (
        'id' => '291303',
        'name' => '维西',
      ),
      291304 => 
      array (
        'id' => '291304',
        'name' => '中甸',
      ),
    ),
  ),
  2914 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2914',
      'name' => '丽江',
    ),
    'list' => 
    array (
      291401 => 
      array (
        'id' => '291401',
        'name' => '丽江',
      ),
      291402 => 
      array (
        'id' => '291402',
        'name' => '永胜',
      ),
      291403 => 
      array (
        'id' => '291403',
        'name' => '华坪',
      ),
      291404 => 
      array (
        'id' => '291404',
        'name' => '宁蒗',
      ),
    ),
  ),
  2915 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2915',
      'name' => '德宏',
    ),
    'list' => 
    array (
      291501 => 
      array (
        'id' => '291501',
        'name' => '德宏',
      ),
      291502 => 
      array (
        'id' => '291502',
        'name' => '陇川',
      ),
      291503 => 
      array (
        'id' => '291503',
        'name' => '盈江',
      ),
      291504 => 
      array (
        'id' => '291504',
        'name' => '瑞丽',
      ),
      291505 => 
      array (
        'id' => '291505',
        'name' => '梁河',
      ),
      291506 => 
      array (
        'id' => '291506',
        'name' => '潞西',
      ),
    ),
  ),
  2916 => 
  array (
    'province' => 
    array (
      'id' => '29',
      'name' => '云南',
    ),
    'city' => 
    array (
      'id' => '2916',
      'name' => '西双版纳',
    ),
    'list' => 
    array (
      291601 => 
      array (
        'id' => '291601',
        'name' => '景洪',
      ),
      291602 => 
      array (
        'id' => '291602',
        'name' => '勐海',
      ),
      291603 => 
      array (
        'id' => '291603',
        'name' => '勐腊',
      ),
    ),
  ),
  3001 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'city' => 
    array (
      'id' => '3001',
      'name' => '南宁',
    ),
    'list' => 
    array (
      300101 => 
      array (
        'id' => '300101',
        'name' => '南宁',
      ),
      300102 => 
      array (
        'id' => '300102',
        'name' => '邕宁',
      ),
      300103 => 
      array (
        'id' => '300103',
        'name' => '横县',
      ),
      300104 => 
      array (
        'id' => '300104',
        'name' => '隆安',
      ),
      300105 => 
      array (
        'id' => '300105',
        'name' => '马山',
      ),
      300106 => 
      array (
        'id' => '300106',
        'name' => '上林',
      ),
      300107 => 
      array (
        'id' => '300107',
        'name' => '武鸣',
      ),
      300108 => 
      array (
        'id' => '300108',
        'name' => '宾阳',
      ),
    ),
  ),
  3002 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'city' => 
    array (
      'id' => '3002',
      'name' => '崇左',
    ),
    'list' => 
    array (
      300201 => 
      array (
        'id' => '300201',
        'name' => '崇左',
      ),
      300202 => 
      array (
        'id' => '300202',
        'name' => '天等',
      ),
      300203 => 
      array (
        'id' => '300203',
        'name' => '龙州',
      ),
      300204 => 
      array (
        'id' => '300204',
        'name' => '凭祥',
      ),
      300205 => 
      array (
        'id' => '300205',
        'name' => '大新',
      ),
      300206 => 
      array (
        'id' => '300206',
        'name' => '扶绥',
      ),
      300207 => 
      array (
        'id' => '300207',
        'name' => '宁明',
      ),
    ),
  ),
  3003 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'city' => 
    array (
      'id' => '3003',
      'name' => '柳州',
    ),
    'list' => 
    array (
      300301 => 
      array (
        'id' => '300301',
        'name' => '柳州',
      ),
      300302 => 
      array (
        'id' => '300302',
        'name' => '柳城',
      ),
      300303 => 
      array (
        'id' => '300303',
        'name' => '鹿寨',
      ),
      300304 => 
      array (
        'id' => '300304',
        'name' => '柳江',
      ),
      300305 => 
      array (
        'id' => '300305',
        'name' => '融安',
      ),
      300306 => 
      array (
        'id' => '300306',
        'name' => '融水',
      ),
      300307 => 
      array (
        'id' => '300307',
        'name' => '三江',
      ),
    ),
  ),
  3004 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'city' => 
    array (
      'id' => '3004',
      'name' => '来宾',
    ),
    'list' => 
    array (
      300401 => 
      array (
        'id' => '300401',
        'name' => '来宾',
      ),
      300402 => 
      array (
        'id' => '300402',
        'name' => '忻城',
      ),
      300403 => 
      array (
        'id' => '300403',
        'name' => '金秀',
      ),
      300404 => 
      array (
        'id' => '300404',
        'name' => '象州',
      ),
      300405 => 
      array (
        'id' => '300405',
        'name' => '武宣',
      ),
      300406 => 
      array (
        'id' => '300406',
        'name' => '合山',
      ),
    ),
  ),
  3005 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'city' => 
    array (
      'id' => '3005',
      'name' => '桂林',
    ),
    'list' => 
    array (
      300501 => 
      array (
        'id' => '300501',
        'name' => '桂林',
      ),
      300502 => 
      array (
        'id' => '300502',
        'name' => '龙胜',
      ),
      300503 => 
      array (
        'id' => '300503',
        'name' => '永福',
      ),
      300504 => 
      array (
        'id' => '300504',
        'name' => '临桂',
      ),
      300505 => 
      array (
        'id' => '300505',
        'name' => '兴安',
      ),
      300506 => 
      array (
        'id' => '300506',
        'name' => '灵川',
      ),
      300507 => 
      array (
        'id' => '300507',
        'name' => '全州',
      ),
      300508 => 
      array (
        'id' => '300508',
        'name' => '灌阳',
      ),
      300509 => 
      array (
        'id' => '300509',
        'name' => '阳朔',
      ),
      300510 => 
      array (
        'id' => '300510',
        'name' => '恭城',
      ),
      300511 => 
      array (
        'id' => '300511',
        'name' => '平乐',
      ),
      300512 => 
      array (
        'id' => '300512',
        'name' => '荔浦',
      ),
      300513 => 
      array (
        'id' => '300513',
        'name' => '资源',
      ),
    ),
  ),
  3006 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'city' => 
    array (
      'id' => '3006',
      'name' => '梧州',
    ),
    'list' => 
    array (
      300601 => 
      array (
        'id' => '300601',
        'name' => '梧州',
      ),
      300602 => 
      array (
        'id' => '300602',
        'name' => '藤县',
      ),
      300603 => 
      array (
        'id' => '300603',
        'name' => '苍梧',
      ),
      300604 => 
      array (
        'id' => '300604',
        'name' => '蒙山',
      ),
      300605 => 
      array (
        'id' => '300605',
        'name' => '岑溪',
      ),
    ),
  ),
  3007 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'city' => 
    array (
      'id' => '3007',
      'name' => '贺州',
    ),
    'list' => 
    array (
      300701 => 
      array (
        'id' => '300701',
        'name' => '贺州',
      ),
      300702 => 
      array (
        'id' => '300702',
        'name' => '昭平',
      ),
      300703 => 
      array (
        'id' => '300703',
        'name' => '富川',
      ),
      300704 => 
      array (
        'id' => '300704',
        'name' => '钟山',
      ),
    ),
  ),
  3008 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'city' => 
    array (
      'id' => '3008',
      'name' => '贵港',
    ),
    'list' => 
    array (
      300801 => 
      array (
        'id' => '300801',
        'name' => '贵港',
      ),
      300802 => 
      array (
        'id' => '300802',
        'name' => '桂平',
      ),
      300803 => 
      array (
        'id' => '300803',
        'name' => '平南',
      ),
    ),
  ),
  3009 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'city' => 
    array (
      'id' => '3009',
      'name' => '玉林',
    ),
    'list' => 
    array (
      300901 => 
      array (
        'id' => '300901',
        'name' => '玉林',
      ),
      300902 => 
      array (
        'id' => '300902',
        'name' => '博白',
      ),
      300903 => 
      array (
        'id' => '300903',
        'name' => '北流',
      ),
      300904 => 
      array (
        'id' => '300904',
        'name' => '容县',
      ),
      300905 => 
      array (
        'id' => '300905',
        'name' => '陆川',
      ),
      300906 => 
      array (
        'id' => '300906',
        'name' => '兴业',
      ),
    ),
  ),
  3010 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'city' => 
    array (
      'id' => '3010',
      'name' => '百色',
    ),
    'list' => 
    array (
      301001 => 
      array (
        'id' => '301001',
        'name' => '百色',
      ),
      301002 => 
      array (
        'id' => '301002',
        'name' => '那坡',
      ),
      301003 => 
      array (
        'id' => '301003',
        'name' => '田阳',
      ),
      301004 => 
      array (
        'id' => '301004',
        'name' => '德保',
      ),
      301005 => 
      array (
        'id' => '301005',
        'name' => '靖西',
      ),
      301006 => 
      array (
        'id' => '301006',
        'name' => '田东',
      ),
      301007 => 
      array (
        'id' => '301007',
        'name' => '平果',
      ),
      301008 => 
      array (
        'id' => '301008',
        'name' => '隆林',
      ),
      301009 => 
      array (
        'id' => '301009',
        'name' => '西林',
      ),
      301010 => 
      array (
        'id' => '301010',
        'name' => '乐业',
      ),
      301011 => 
      array (
        'id' => '301011',
        'name' => '凌云',
      ),
      301012 => 
      array (
        'id' => '301012',
        'name' => '田林',
      ),
    ),
  ),
  3011 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'city' => 
    array (
      'id' => '3011',
      'name' => '钦州',
    ),
    'list' => 
    array (
      301101 => 
      array (
        'id' => '301101',
        'name' => '钦州',
      ),
      301102 => 
      array (
        'id' => '301102',
        'name' => '浦北',
      ),
      301103 => 
      array (
        'id' => '301103',
        'name' => '灵山',
      ),
    ),
  ),
  3012 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'city' => 
    array (
      'id' => '3012',
      'name' => '河池',
    ),
    'list' => 
    array (
      301201 => 
      array (
        'id' => '301201',
        'name' => '河池',
      ),
      301202 => 
      array (
        'id' => '301202',
        'name' => '天峨',
      ),
      301203 => 
      array (
        'id' => '301203',
        'name' => '东兰',
      ),
      301204 => 
      array (
        'id' => '301204',
        'name' => '巴马',
      ),
      301205 => 
      array (
        'id' => '301205',
        'name' => '环江',
      ),
      301206 => 
      array (
        'id' => '301206',
        'name' => '罗城',
      ),
      301207 => 
      array (
        'id' => '301207',
        'name' => '宜州',
      ),
      301208 => 
      array (
        'id' => '301208',
        'name' => '凤山',
      ),
      301209 => 
      array (
        'id' => '301209',
        'name' => '南丹',
      ),
      301210 => 
      array (
        'id' => '301210',
        'name' => '都安',
      ),
      301211 => 
      array (
        'id' => '301211',
        'name' => '大化',
      ),
    ),
  ),
  3013 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'city' => 
    array (
      'id' => '3013',
      'name' => '北海',
    ),
    'list' => 
    array (
      301301 => 
      array (
        'id' => '301301',
        'name' => '北海',
      ),
      301302 => 
      array (
        'id' => '301302',
        'name' => '合浦',
      ),
      301303 => 
      array (
        'id' => '301303',
        'name' => '涠洲岛',
      ),
    ),
  ),
  3014 => 
  array (
    'province' => 
    array (
      'id' => '30',
      'name' => '广西',
    ),
    'city' => 
    array (
      'id' => '3014',
      'name' => '防城港',
    ),
    'list' => 
    array (
      301401 => 
      array (
        'id' => '301401',
        'name' => '防城港',
      ),
      301402 => 
      array (
        'id' => '301402',
        'name' => '上思',
      ),
      301403 => 
      array (
        'id' => '301403',
        'name' => '东兴',
      ),
      301404 => 
      array (
        'id' => '301404',
        'name' => '防城',
      ),
    ),
  ),
  3101 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3101',
      'name' => '海口',
    ),
    'list' => 
    array (
      310101 => 
      array (
        'id' => '310101',
        'name' => '海口',
      ),
    ),
  ),
  3102 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3102',
      'name' => '三亚',
    ),
    'list' => 
    array (
      310201 => 
      array (
        'id' => '310201',
        'name' => '三亚',
      ),
    ),
  ),
  3103 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3103',
      'name' => '东方',
    ),
    'list' => 
    array (
      310301 => 
      array (
        'id' => '310301',
        'name' => '东方',
      ),
    ),
  ),
  3104 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3104',
      'name' => '临高',
    ),
    'list' => 
    array (
      310401 => 
      array (
        'id' => '310401',
        'name' => '临高',
      ),
    ),
  ),
  3105 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3105',
      'name' => '澄迈',
    ),
    'list' => 
    array (
      310501 => 
      array (
        'id' => '310501',
        'name' => '澄迈',
      ),
    ),
  ),
  3106 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3106',
      'name' => '儋州',
    ),
    'list' => 
    array (
      310601 => 
      array (
        'id' => '310601',
        'name' => '儋州',
      ),
    ),
  ),
  3107 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3107',
      'name' => '昌江',
    ),
    'list' => 
    array (
      310701 => 
      array (
        'id' => '310701',
        'name' => '昌江',
      ),
    ),
  ),
  3108 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3108',
      'name' => '白沙',
    ),
    'list' => 
    array (
      310801 => 
      array (
        'id' => '310801',
        'name' => '白沙',
      ),
    ),
  ),
  3109 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3109',
      'name' => '琼中',
    ),
    'list' => 
    array (
      310901 => 
      array (
        'id' => '310901',
        'name' => '琼中',
      ),
    ),
  ),
  3110 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3110',
      'name' => '定安',
    ),
    'list' => 
    array (
      311001 => 
      array (
        'id' => '311001',
        'name' => '定安',
      ),
    ),
  ),
  3111 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3111',
      'name' => '屯昌',
    ),
    'list' => 
    array (
      311101 => 
      array (
        'id' => '311101',
        'name' => '屯昌',
      ),
    ),
  ),
  3112 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3112',
      'name' => '琼海',
    ),
    'list' => 
    array (
      311201 => 
      array (
        'id' => '311201',
        'name' => '琼海',
      ),
    ),
  ),
  3113 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3113',
      'name' => '文昌',
    ),
    'list' => 
    array (
      311301 => 
      array (
        'id' => '311301',
        'name' => '文昌',
      ),
    ),
  ),
  3114 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3114',
      'name' => '保亭',
    ),
    'list' => 
    array (
      311401 => 
      array (
        'id' => '311401',
        'name' => '保亭',
      ),
    ),
  ),
  3115 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3115',
      'name' => '万宁',
    ),
    'list' => 
    array (
      311501 => 
      array (
        'id' => '311501',
        'name' => '万宁',
      ),
    ),
  ),
  3116 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3116',
      'name' => '陵水',
    ),
    'list' => 
    array (
      311601 => 
      array (
        'id' => '311601',
        'name' => '陵水',
      ),
    ),
  ),
  3117 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3117',
      'name' => '西沙',
    ),
    'list' => 
    array (
      311701 => 
      array (
        'id' => '311701',
        'name' => '西沙',
      ),
    ),
  ),
  3118 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3118',
      'name' => '南沙',
    ),
    'list' => 
    array (
      311801 => 
      array (
        'id' => '311801',
        'name' => '南沙',
      ),
    ),
  ),
  3119 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3119',
      'name' => '乐东',
    ),
    'list' => 
    array (
      311901 => 
      array (
        'id' => '311901',
        'name' => '乐东',
      ),
    ),
  ),
  3120 => 
  array (
    'province' => 
    array (
      'id' => '31',
      'name' => '海南',
    ),
    'city' => 
    array (
      'id' => '3120',
      'name' => '五指山',
    ),
    'list' => 
    array (
      312001 => 
      array (
        'id' => '312001',
        'name' => '五指山',
      ),
    ),
  ),
  3201 => 
  array (
    'province' => 
    array (
      'id' => '32',
      'name' => '香港',
    ),
    'city' => 
    array (
      'id' => '3201',
      'name' => '香港',
    ),
    'list' => 
    array (
      320101 => 
      array (
        'id' => '320101',
        'name' => '香港',
      ),
      320102 => 
      array (
        'id' => '320102',
        'name' => '九龙',
      ),
      320103 => 
      array (
        'id' => '320103',
        'name' => '新界',
      ),
    ),
  ),
  3301 => 
  array (
    'province' => 
    array (
      'id' => '33',
      'name' => '澳门',
    ),
    'city' => 
    array (
      'id' => '3301',
      'name' => '澳门',
    ),
    'list' => 
    array (
      330101 => 
      array (
        'id' => '330101',
        'name' => '澳门',
      ),
      330102 => 
      array (
        'id' => '330102',
        'name' => '氹仔岛',
      ),
      330103 => 
      array (
        'id' => '330103',
        'name' => '路环岛',
      ),
    ),
  ),
  3401 => 
  array (
    'province' => 
    array (
      'id' => '34',
      'name' => '台湾',
    ),
    'city' => 
    array (
      'id' => '3401',
      'name' => '台北',
    ),
    'list' => 
    array (
      340101 => 
      array (
        'id' => '340101',
        'name' => '台北',
      ),
      340102 => 
      array (
        'id' => '340102',
        'name' => '桃园',
      ),
      340103 => 
      array (
        'id' => '340103',
        'name' => '新竹',
      ),
      340104 => 
      array (
        'id' => '340104',
        'name' => '宜兰',
      ),
    ),
  ),
  3402 => 
  array (
    'province' => 
    array (
      'id' => '34',
      'name' => '台湾',
    ),
    'city' => 
    array (
      'id' => '3402',
      'name' => '高雄',
    ),
    'list' => 
    array (
      340201 => 
      array (
        'id' => '340201',
        'name' => '高雄',
      ),
      340202 => 
      array (
        'id' => '340202',
        'name' => '嘉义',
      ),
      340203 => 
      array (
        'id' => '340203',
        'name' => '台南',
      ),
      340204 => 
      array (
        'id' => '340204',
        'name' => '台东',
      ),
      340205 => 
      array (
        'id' => '340205',
        'name' => '屏东',
      ),
    ),
  ),
  3403 => 
  array (
    'province' => 
    array (
      'id' => '34',
      'name' => '台湾',
    ),
    'city' => 
    array (
      'id' => '3403',
      'name' => '台中',
    ),
    'list' => 
    array (
      340301 => 
      array (
        'id' => '340301',
        'name' => '台中',
      ),
      340302 => 
      array (
        'id' => '340302',
        'name' => '苗栗',
      ),
      340303 => 
      array (
        'id' => '340303',
        'name' => '彰化',
      ),
      340304 => 
      array (
        'id' => '340304',
        'name' => '南投',
      ),
      340305 => 
      array (
        'id' => '340305',
        'name' => '花莲',
      ),
      340306 => 
      array (
        'id' => '340306',
        'name' => '云林',
      ),
    ),
  ),
);